[
  {
    "id": "ss_lincoln_gettysburg",
    "subject": "social_studies",
    "topic": "Civil War",
    "title": "Gettysburg Address",
    "author": "Abraham Lincoln",
    "year": 1863,
    "content": "Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal. Now we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battlefield of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this. But, in a larger sense, we cannot dedicate—we cannot consecrate—we cannot hallow—this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here."
  },
  {
    "id": "ss_lincoln_second_inaugural",
    "subject": "social_studies",
    "topic": "Civil War / Reconstruction",
    "title": "Second Inaugural Address (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1865,
    "content": "With malice toward none; with charity for all; with firmness in the right, as God gives us to see the right, let us strive on to finish the work we are in; to bind up the nation's wounds; to care for him who shall have borne the battle, and for his widow, and his orphan—to do all which may achieve and cherish a just and lasting peace among ourselves, and with all nations."
  },
  {
    "id": "ss_frederick_douglass_what_to_the_slave",
    "subject": "social_studies",
    "topic": "Abolition",
    "title": "What to the Slave Is the Fourth of July? (Excerpt)",
    "author": "Frederick Douglass",
    "year": 1852,
    "content": "What, to the American slave, is your Fourth of July? I answer; a day that reveals to him, more than all other days in the year, the gross injustice and cruelty to which he is the constant victim. To him, your celebration is a sham; your boasted liberty, an unholy license; your national greatness, swelling vanity; your sounds of rejoicing are empty and heartless; your denunciation of tyrants, brass fronted impudence."
  },
  {
    "id": "ss_elizabeth_cady_stanton_seneca_falls",
    "subject": "social_studies",
    "topic": "Women's Rights",
    "title": "Declaration of Sentiments (Excerpt)",
    "author": "Elizabeth Cady Stanton",
    "year": 1848,
    "content": "We hold these truths to be self-evident: that all men and women are created equal; that they are endowed by their Creator with certain inalienable rights; that among these are life, liberty, and the pursuit of happiness; that to secure these rights governments are instituted, deriving their just powers from the consent of the governed."
  },
  {
    "id": "ss_chief_joseph_surrender",
    "subject": "social_studies",
    "topic": "Native American History",
    "title": "I Will Fight No More Forever",
    "author": "Chief Joseph",
    "year": 1877,
    "content": "Hear me, my chiefs! I am tired; my heart is sick and sad. From where the sun now stands, I will fight no more forever."
  },
  {
    "id": "ss_ida_b_wells_lynching",
    "subject": "social_studies",
    "topic": "Civil Rights / Anti-Lynching",
    "title": "Lynch Law in America (Excerpt)",
    "author": "Ida B. Wells-Barnett",
    "year": 1900,
    "content": "Our country’s national crime is lynching. It represents the cool, deliberate killing of human beings by mobs, often with the consent of the community. No nation can call itself civilized that allows such deeds to go unpunished."
  },
  {
    "id": "ss_fdr_first_inaugural",
    "subject": "social_studies",
    "topic": "Great Depression",
    "title": "First Inaugural Address (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1933,
    "content": "So, first of all, let me assert my firm belief that the only thing we have to fear is fear itself—nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance."
  },
  {
    "id": "ss_booker_t_washington_atlanta",
    "subject": "social_studies",
    "topic": "Post–Civil War Era",
    "title": "Atlanta Exposition Address (Excerpt)",
    "author": "Booker T. Washington",
    "year": 1895,
    "content": "In all things that are purely social we can be as separate as the fingers, yet one as the hand in all things essential to mutual progress."
  },
  {
    "id": "science_darwin_origin_species",
    "subject": "science",
    "topic": "Evolution / Biology",
    "title": "On the Origin of Species (Excerpt)",
    "author": "Charles Darwin",
    "year": 1859,
    "content": "As many more individuals of each species are born than can possibly survive; and as, consequently, there is a recurring struggle for existence, it follows that any being, if it vary in any manner profitable to itself, will have a better chance of surviving, and thus be naturally selected."
  },
  {
    "id": "science_newton_opticks",
    "subject": "science",
    "topic": "Physics / Light",
    "title": "Opticks (Excerpt)",
    "author": "Isaac Newton",
    "year": 1704,
    "content": "The rays of light are not colored. Colors are the sensations of the observer. When light is refracted or reflected, it may be separated into rays that excite different colors, but the light itself remains uncolored."
  },
  {
    "id": "science_faraday_electricity",
    "subject": "science",
    "topic": "Electricity",
    "title": "Experimental Researches in Electricity (Excerpt)",
    "author": "Michael Faraday",
    "year": 1831,
    "content": "Electricity is capable of being evolved by ordinary mechanical means, and by magnetic influence. The relation between magnetism and electricity is of the deepest importance in physical science."
  },
  {
    "id": "science_pasteur_germ_theory",
    "subject": "science",
    "topic": "Microbiology",
    "title": "The Germ Theory of Disease (Excerpt)",
    "author": "Louis Pasteur",
    "year": 1864,
    "content": "The air is full of the germs of microscopic organisms. These germs are the cause of fermentation and disease. By excluding germs, one can prevent both processes from occurring."
  },
  {
    "id": "science_galileo_star_message",
    "subject": "science",
    "topic": "Astronomy",
    "title": "The Starry Messenger (Excerpt)",
    "author": "Galileo Galilei",
    "year": 1610,
    "content": "Through my telescope I have observed four planets revolving about Jupiter, invisible without the aid of a glass. These observations prove that not all heavenly bodies revolve around the Earth, as was formerly believed."
  },
  {
    "id": "science_curie_radioactivity",
    "subject": "science",
    "topic": "Chemistry / Physics",
    "title": "Research on Radioactive Substances (Excerpt)",
    "author": "Marie Curie",
    "year": 1898,
    "content": "The new substance emits rays which are capable of discharging electrified bodies and of penetrating various substances. I propose to call this new element 'radium.' Its remarkable activity suggests it may reveal new laws of matter."
  },
  {
    "id": "science_rachel_carson_sea",
    "subject": "science",
    "topic": "Ecology",
    "title": "The Sea Around Us (Excerpt)",
    "author": "Rachel Carson",
    "year": 1951,
    "content": "The sea lies all about us. The continents themselves dissolve and pass to the sea, in grain after grain of eroded land. In its mysterious past, the sea has shaped the Earth; today it continues to influence climate and sustain life."
  },
  {
    "id": "science_einstein_relativity",
    "subject": "science",
    "topic": "Physics / Relativity",
    "title": "Relativity: The Special and General Theory (Excerpt)",
    "author": "Albert Einstein",
    "year": 1916,
    "content": "The laws of physics are the same for all observers in uniform motion. Time and space are not absolute, but depend on the motion of the observer. This simple idea leads to consequences that change our understanding of the universe."
  },
  {
    "id": "rla_o_henry_gift_of_magi",
    "subject": "rla",
    "topic": "Fiction",
    "title": "The Gift of the Magi (Excerpt)",
    "author": "O. Henry",
    "year": 1905,
    "content": "One dollar and eighty-seven cents. That was all. And sixty cents of it was in pennies. The next day would be Christmas, and Della had nothing to buy a gift for her Jim. There was clearly nothing to do but flop down on the couch and howl. So Della did it."
  },
  {
    "id": "rla_kate_chopin_story_of_hour",
    "subject": "rla",
    "topic": "Fiction",
    "title": "The Story of an Hour",
    "author": "Kate Chopin",
    "year": 1894,
    "content": "When she heard the news of her husband’s death, Mrs. Mallard wept with sudden, wild abandonment. But when she was alone, a strange new feeling came creeping out of the sky—freedom. She whispered, 'Free, free, free!'"
  },
  {
    "id": "rla_walt_whitman_america_singing",
    "subject": "rla",
    "topic": "Poetry",
    "title": "I Hear America Singing",
    "author": "Walt Whitman",
    "year": 1860,
    "content": "I hear America singing, the varied carols I hear, those of mechanics, each one singing his as it should be blithe and strong, the carpenter singing his as he measures his plank or beam, the mason singing his as he makes ready for work."
  },
  {
    "id": "rla_langston_hughes_dreams",
    "subject": "rla",
    "topic": "Poetry",
    "title": "Dreams",
    "author": "Langston Hughes",
    "year": 1922,
    "content": "Hold fast to dreams, for if dreams die, life is a broken-winged bird that cannot fly. Hold fast to dreams, for when dreams go, life is a barren field frozen with snow."
  }
]
```json
[
  {
    "id": "ss_thomas_jefferson_declaration_independence",
    "subject": "social_studies",
    "topic": "Founding Documents",
    "title": "Declaration of Independence (Excerpt)",
    "author": "Thomas Jefferson",
    "year": 1776,
    "content": "When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature’s God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed. Whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government."
  },
  {
    "id": "ss_thomas_paine_common_sense",
    "subject": "social_studies",
    "topic": "American Revolution",
    "title": "Common Sense (Excerpt)",
    "author": "Thomas Paine",
    "year": 1776,
    "content": "Society in every state is a blessing, but government, even in its best state, is but a necessary evil; in its worst state an intolerable one. For when we suffer, or are exposed to the same miseries by a government which we might expect in a country without government, our calamity is heightened by reflecting that we furnish the means by which we suffer. Men do not change from good to bad merely by crossing the sea, yet kings claim dominion over others as though they were of a superior order of beings. It is not in numbers, but in unity, that our great strength lies. The cause of America is in a great measure the cause of all mankind. The sun never shone on a cause of greater worth. It is not the concern of a city, a county, or a province, but of a continent—of at least one-eighth part of the habitable globe."
  },
  {
    "id": "ss_frederick_douglass_autobiography",
    "subject": "social_studies",
    "topic": "Abolition / Slavery",
    "title": "Narrative of the Life of Frederick Douglass (Excerpt)",
    "author": "Frederick Douglass",
    "year": 1845,
    "content": "I have often been awakened at the dawn of day by the most heart-rending shrieks of an own aunt of mine, whom he used to tie up to a joist and whip upon her naked back till she was literally covered with blood. No words, no tears, no prayers, from his gory victim seemed to move his iron heart from its bloody purpose. The louder she screamed, the harder he whipped; and where the blood ran fastest, there he whipped longest. He would whip her to make her scream, and whip her to make her hush; and not until overcome by fatigue, would he cease to swing the blood-clotted cowskin. It struck me with awful force the power of slavery to brutalize both slave and master. I was often filled with unutterable loathing when I beheld him in the field, standing over the prostrate form of my aunt, and shouting in savage delight, as he lashed her quivering flesh."
  },
  {
    "id": "ss_sojourner_truth_womens_convention",
    "subject": "social_studies",
    "topic": "Women's Rights / Abolition",
    "title": "Ain’t I a Woman? (Full Speech)",
    "author": "Sojourner Truth",
    "year": 1851,
    "content": "Well, children, where there is so much racket there must be something out of kilter. I think that ’twixt the Negroes of the South and the women at the North, all talking about rights, the white men will be in a fix pretty soon. But what’s all this here talking about? That man over there says that women need to be helped into carriages and lifted over ditches and to have the best place everywhere. Nobody ever helps me into carriages, or over mud puddles, or gives me any best place! And ain’t I a woman? Look at me! I have ploughed and planted and gathered into barns, and no man could head me—and ain’t I a woman? I have borne thirteen children, and seen most all sold off to slavery, and when I cried out with my mother’s grief, none but Jesus heard me—and ain’t I a woman? Then they talk about this thing in the head; what’s that they call it? Intellect! That’s it. What’s that got to do with women’s rights or black folks’ rights? If my cup won’t hold but a pint, and yours holds a quart, wouldn’t you be mean not to let me have my little half measure full?"
  },
  {
    "id": "ss_booker_washington_up_from_slavery",
    "subject": "social_studies",
    "topic": "Post–Civil War Education",
    "title": "Up from Slavery (Excerpt)",
    "author": "Booker T. Washington",
    "year": 1901,
    "content": "I have begun everything with the idea that I was to make myself useful to others. The happiest people are those who do the most for others; the most miserable are those who do the least. In our work at Tuskegee we wanted to show that a race could rise, not by seeking favors, but by the performance of service that would make itself indispensable. No race that has anything to contribute to the markets of the world is long in any degree ostracized. I have found that if one makes himself useful to the world, people will find it hard to shut him out. We have a saying at Tuskegee that we must make ourselves so valuable that the world cannot get along without us. Industry, intelligence, and moral character are the keys to success. These are the tools that uplift a people far more than the clamor of political agitation."
  },
  {
    "id": "ss_washington_farewell_address",
    "subject": "social_studies",
    "topic": "Early Republic",
    "title": "Farewell Address (Excerpt)",
    "author": "George Washington",
    "year": 1796,
    "content": "The unity of government which constitutes you one people is also now dear to you. It is a main pillar in the edifice of your real independence, the support of your tranquillity at home, your peace abroad, your safety, your prosperity, and that very liberty which you so highly prize. But as it is easy to foresee that, from different causes and from different quarters, much pains will be taken to weaken in your minds the conviction of this truth, it is of infinite moment that you should properly estimate the immense value of your national union. You should cherish a cordial, habitual, and immovable attachment to it. Watch for its preservation with jealous anxiety; discountenance whatever may suggest even a suspicion that it can in any event be abandoned; and indignantly frown upon the first dawning of every attempt to alienate any portion of our country from the rest."
  },
  {
    "id": "ss_jane_addams_hull_house",
    "subject": "social_studies",
    "topic": "Progressive Era / Social Reform",
    "title": "Twenty Years at Hull-House (Excerpt)",
    "author": "Jane Addams",
    "year": 1910,
    "content": "The Settlement idea was born of the conviction that the social relation is the basis of the social order. It rests upon the simple belief that by living among the poor and sharing in their daily life, one can understand and help to remedy the causes of poverty. When we opened Hull-House, we were criticized by those who said that the poor prefer money to sympathy. Yet experience showed that human fellowship itself is the beginning of reform. We discovered that the needs of our neighbors were not only material but moral and spiritual. Their sense of powerlessness was often greater than their hunger. The Settlement is, at bottom, a protest against the notion that charity can be measured in alms. It insists that the only real help must come from a deep sense of equality and cooperation."
  },
  {
    "id": "ss_w_e_b_du_bois_souls_black_folk",
    "subject": "social_studies",
    "topic": "Civil Rights / Sociology",
    "title": "The Souls of Black Folk (Excerpt)",
    "author": "W. E. B. Du Bois",
    "year": 1903,
    "content": "Between me and the other world there is ever an unasked question: how does it feel to be a problem? Being a problem is a strange experience for one born in a land that prides itself on liberty. It is a peculiar sensation, this double-consciousness, this sense of always looking at one’s self through the eyes of others. One ever feels his two-ness—an American, a Negro; two souls, two thoughts, two unreconciled strivings; two warring ideals in one dark body. The history of the American Negro is the history of this strife—of longing to merge his double self into a better and truer self. He wishes to make it possible for a man to be both a Negro and an American, without having the doors of opportunity closed roughly in his face."
  },
  {
    "id": "science_darwin_descent_of_man",
    "subject": "science",
    "topic": "Evolution / Anthropology",
    "title": "The Descent of Man (Excerpt)",
    "author": "Charles Darwin",
    "year": 1871,
    "content": "Man still bears in his bodily frame the indelible stamp of his lowly origin. His body is plainly related to that of the lower animals, but his moral sense and social instincts are what distinguish him most. These instincts lead him to sympathize with others, to aid the weak, and to repress his own selfish impulses. As man advances in civilization, and small tribes unite into larger communities, the simplest reason would tell each individual that he ought to extend his social instincts and sympathies to all members of the same nation, even to all nations and races. Thus the social instincts, the prime principle of man’s moral constitution, would gradually extend and be strengthened, till they became the ruling power."
  },
  {
    "id": "science_newton_principia",
    "subject": "science",
    "topic": "Physics / Motion",
    "title": "Principia Mathematica (Excerpt)",
    "author": "Isaac Newton",
    "year": 1687,
    "content": "Every body continues in its state of rest, or of uniform motion in a straight line, unless compelled to change that state by forces impressed upon it. The change of motion is proportional to the motive force impressed and is made in the direction of the straight line in which the force is impressed. To every action there is always opposed an equal reaction. In the philosophy of nature, it is by these laws that the harmony of motion and the predictability of the universe are secured. The same principle that guides the fall of an apple governs the motion of the Moon. This discovery has opened the door to a mechanical understanding of the heavens, uniting the terrestrial and celestial into one grand design of order and simplicity."
  },
  {
    "id": "science_darwin_origin_long",
    "subject": "science",
    "topic": "Natural Selection",
    "title": "On the Origin of Species (Long Excerpt)",
    "author": "Charles Darwin",
    "year": 1859,
    "content": "As many more individuals of each species are born than can possibly survive, and as there is consequently a frequent struggle for existence, it follows that any being, if it vary in any manner profitable to itself, will have a better chance of surviving, and thus be naturally selected. It is the preservation of favorable variations and the rejection of injurious variations. From the strong principle of inheritance, any selected variety will tend to propagate its new and modified form. The theory of natural selection, though simple in statement, carries profound consequences: it unites all forms of life in one long, unbroken chain of descent. No longer can we consider species as fixed creations; rather, they are the results of a gradual process, acting silently but surely over vast ages. The grandeur of this view of life lies in the unity of its origin and the endless forms most beautiful that have been, and are being, evolved."
  },
  {
    "id": "science_galileo_letter_to_grand_duchess",
    "subject": "science",
    "topic": "Astronomy / Church Conflict",
    "title": "Letter to the Grand Duchess Christina (Excerpt)",
    "author": "Galileo Galilei",
    "year": 1615,
    "content": "It is surely harmful to souls to make it a heresy to believe what is proved. The intention of the Holy Spirit is to teach us how one goes to heaven, not how the heavens go. The discoveries of the telescope are not contrary to Scripture, for Scripture cannot err, though its interpreters may. The motion of the Earth is supported by evidence and reason; to reject it is to reject the works of God Himself, for nature is written in the language of mathematics. The more we study that language, the more deeply we see into His creation. Let us not fear to use our senses and reason, for these too are divine gifts meant to lead us to truth."
  },
  {
    "id": "science_faraday_field_concept",
    "subject": "science",
    "topic": "Electromagnetism",
    "title": "On the Physical Lines of Force (Excerpt)",
    "author": "Michael Faraday",
    "year": 1852,
    "content": "Before I began my experiments on magnetism and electricity, I was deeply impressed by the idea that the forces of nature are not independent, but connected. The concept of a 'field' was not yet established; yet I believed that space itself is filled with lines of force. These lines are not imaginary but real—capable of transmitting energy and producing motion at a distance. It seemed to me that a magnet acts upon another, not by an invisible hand, but by a real medium existing between them. I have found that the same lines which pass through the magnet also influence light, heat, and electricity. It is a grand and beautiful idea that all forces are manifestations of one universal power."
  },
  {
    "id": "science_pasteur_germs",
    "subject": "science",
    "topic": "Microbiology",
    "title": "On the Germ Theory (Expanded)",
    "author": "Louis Pasteur",
    "year": 1864,
    "content": "Gentlemen, I have shown that the air contains the germs of microscopic organisms which cause fermentation and putrefaction. If a liquid is protected from these germs, it remains pure. If exposed, it becomes teeming with life. The idea that life can arise spontaneously from lifeless matter has no foundation in experiment. Life comes only from life. This simple truth has immense consequences for medicine and hygiene. If we can prevent germs from entering wounds, we can prevent disease. If we can sterilize instruments and bandages, we can save lives. Thus a scientific fact becomes a moral duty: to use knowledge to lessen suffering and preserve health."
  },
  {
    "id": "science_rutherford_atom",
    "subject": "science",
    "topic": "Atomic Theory",
    "title": "Structure of the Atom (Excerpt)",
    "author": "Ernest Rutherford",
    "year": 1911,
    "content": "When we fired alpha particles at thin gold foil, we expected them to pass straight through, but some were deflected backward. It was as if a cannonball had struck a piece of tissue paper and rebounded. This unexpected result led us to the conclusion that most of the atom is empty space, with a tiny dense nucleus at its center. Around this nucleus, electrons move at great speed. Thus the atom is not a solid sphere but a miniature solar system. The discovery changed our conception of matter and laid the foundation for the structure of the modern atom. It showed that the physical world is both more fragile and more wondrous than we had imagined."
  },
  {
    "id": "science_curie_radioactivity_long",
    "subject": "science",
    "topic": "Chemistry / Physics",
    "title": "The Discovery of Radium (Excerpt)",
    "author": "Marie Curie",
    "year": 1898,
    "content": "During my studies with my husband Pierre, we examined a mineral called pitchblende, which was far more active than uranium itself. After long and patient work, dissolving and crystallizing tons of the mineral, we obtained a small amount of a new substance—a salt of a new element. It emitted rays far stronger than those of uranium or thorium. We named it 'radium.' Its light seemed to come from within itself, requiring no fuel or air. Day and night, it glowed faintly in the dark laboratory. The discovery of radium opened new paths in physics and chemistry. It showed that atoms were not indivisible but contained immense stores of energy. Yet, even then, we did not foresee all the uses and dangers that would follow."
  },
  {
    "id": "rla_hawthorne_ambitious_guest",
    "subject": "rla",
    "topic": "Short Story",
    "title": "The Ambitious Guest (Excerpt)",
    "author": "Nathaniel Hawthorne",
    "year": 1835,
    "content": "One night in autumn, a family sat around their cottage hearth, with the wind roaring without and the mountain stream rushing loudly beside them. They were cheerful, yet every sound from the forest made them draw closer together. Presently there came a knock at the door, and a young stranger entered, weary and travel-stained. He spoke of his plans, his hopes, and his ambition to make a name that would outlast him. The family listened, warmed by his enthusiasm. But even as they talked, a sound more terrible than the wind filled the valley—a mountain had fallen. In an instant the cottage was buried, and all within perished. In the morning, no trace of them was found, and none knew that among the stones lay the young man who had dreamed of fame."
  },
  {
    "id": "rla_edgar_allan_poe_raven",
    "subject": "rla",
    "topic": "Poetry / Gothic",
    "title": "The Raven (Long Excerpt)",
    "author": "Edgar Allan Poe",
    "year": 1845,
    "content": "Once upon a midnight dreary, while I pondered, weak and weary, over many a quaint and curious volume of forgotten lore—while I nodded, nearly napping, suddenly there came a tapping, as of some one gently rapping, rapping at my chamber door. \"’Tis some visitor,\" I muttered, \"tapping at my chamber door—only this and nothing more.\" Ah, distinctly I remember it was in the bleak December, and each separate dying ember wrought its ghost upon the floor. Eagerly I wished the morrow;—vainly I had sought to borrow from my books surcease of sorrow—sorrow for the lost Lenore. For the rare and radiant maiden whom the angels name Lenore—nameless here for evermore. And the silken, sad, uncertain rustling of each purple curtain thrilled me—filled me with fantastic terrors never felt before; so that now, to still the beating of my heart, I stood repeating, \"’Tis some visitor entreating entrance at my chamber door—some late visitor entreating entrance at my chamber door;—this it is and nothing more.\""
  },
  {
    "id": "rla_kate_chopin_cadian_ball",
    "subject": "rla",
    "topic": "Fiction",
    "title": "At the ’Cadian Ball (Excerpt)",
    "author": "Kate Chopin",
    "year": 1892,
    "content": "Bobinôt, that serious and steady young Acadian, had long cherished a quiet admiration for Calixta. She was the most daring of the village girls, quick of speech, and with eyes that seemed always to laugh at him. When news spread of the ’Cadian ball, the whole countryside was stirred, for such gatherings were rare chances to forget toil and worry. Calixta, though poor, determined to go, and her spirits were so high that those around her caught the contagion. At the ball she moved with easy grace, her laughter rippling over the music, and young men pressed close, hoping for a dance. Bobinôt watched, torn between pride in her brightness and fear that she would be won by someone wealthier or bolder. The night, warm and damp, was full of music, perfume, and unspoken wishes."
  },
  {
    "id": "rla_walt_whitman_song_of_myself",
    "subject": "rla",
    "topic": "Poetry / American Voice",
    "title": "Song of Myself (Excerpt)",
    "author": "Walt Whitman",
    "year": 1855,
    "content": "I celebrate myself, and sing myself, and what I assume you shall assume, for every atom belonging to me as good belongs to you. I loafe and invite my soul, I lean and loafe at my ease observing a spear of summer grass. My tongue, every atom of my blood, formed from this soil, this air, born here of parents born here from parents the same, and their parents the same. I, now thirty-seven years old in perfect health begin, hoping to cease not till death. Creeds and schools in abeyance, retiring back a while sufficed at what they are, but never forgotten, I harbor for good or bad, I permit to speak at every hazard, nature without check with original energy."
  }
]
```
```json
[
  {
    "id": "ss_lincoln_house_divided",
    "subject": "social_studies",
    "topic": "Pre–Civil War Politics",
    "title": "A House Divided (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1858,
    "content": "A house divided against itself cannot stand. I believe this government cannot endure permanently half slave and half free. I do not expect the Union to be dissolved—I do not expect the house to fall—but I do expect it will cease to be divided. It will become all one thing or all the other. Either the opponents of slavery will arrest the further spread of it, and place it where the public mind shall rest in the belief that it is in course of ultimate extinction; or its advocates will push it forward, till it shall become alike lawful in all the States, old as well as new, North as well as South. This is the real issue that now overshadows all others. It is not merely a political difference but a moral one, for it concerns the rights of men and the meaning of liberty in a republic."
  },
  {
    "id": "ss_thoreau_civil_disobedience",
    "subject": "social_studies",
    "topic": "Reform / Citizenship",
    "title": "Civil Disobedience (Excerpt)",
    "author": "Henry David Thoreau",
    "year": 1849,
    "content": "I heartily accept the motto, \"That government is best which governs least\"; and I should like to see it acted up to more rapidly and systematically. Yet government itself, never of itself, furthers any enterprise, but sometimes hinders it. The authority of government, even when well intentioned, becomes unjust when it requires a man to be the agent of injustice to another. When the State imprisons a man for refusing to support slavery or an unjust war, it is the State that has lost its claim to obedience. Under a government which imprisons any unjustly, the true place for a just man is also a prison. I do not ask for no government, but for a better government. And when people are prepared for it, that will be the kind of government they will have, for government is only the expression of the will of the people."
  },
  {
    "id": "ss_andrew_carnegie_wealth",
    "subject": "social_studies",
    "topic": "Industrialization / Gilded Age",
    "title": "Wealth (Gospel of Wealth Excerpt)",
    "author": "Andrew Carnegie",
    "year": 1889,
    "content": "The problem of our age is the proper administration of wealth, so that the ties of brotherhood may still bind together the rich and poor in harmonious relationship. The modern industrial system has made possible fortunes of a size never before known in human history. Such fortunes cannot be used for mere personal satisfaction without injury to the society from which they came. I hold that the man who dies rich dies disgraced. The duty of the man of wealth is threefold: first, to live modestly; second, to provide for the legitimate wants of those dependent upon him; and third, to consider all surplus revenues as a trust fund to be administered for the good of the community. Public libraries, schools, parks, and institutions for research are proper channels for such benefactions. In this way, wealth is returned to the people in forms that uplift and educate."
  },
  {
    "id": "ss_john_osullivan_manifest_destiny",
    "subject": "social_studies",
    "topic": "Westward Expansion",
    "title": "Annexation (Manifest Destiny Excerpt)",
    "author": "John L. O'Sullivan",
    "year": 1845,
    "content": "It is our manifest destiny to overspread the continent allotted by Providence for the free development of our yearly multiplying millions. The truth is not that we are seeking to escape from duty to other nations, but that we are fulfilling a duty to civilization itself. The American system is one of liberty and equality, and it is our belief that such a system must eventually embrace the whole continent. When we extend our institutions westward, we are not merely acquiring territory; we are advancing the cause of self-government. Opposition to this movement is often the work of jealous European powers who do not understand the vigor and youthful strength of our republic. Our claim does not rest upon conquest alone, but upon the higher ground of spreading the blessings of freedom."
  },
  {
    "id": "ss_theodore_roosevelt_muckrake",
    "subject": "social_studies",
    "topic": "Progressive Era",
    "title": "The Man with the Muck-Rake (Excerpt)",
    "author": "Theodore Roosevelt",
    "year": 1906,
    "content": "In every community there are evils which must be exposed and corrected. The man who points out these wrongs is often a public benefactor. But there is another type of critic who never sees anything but what is foul. He is like the man in Bunyan's allegory who could look no way but downward with the muck-rake in his hand. Such a man misses the things of higher worth. The reformer must not become so enamored of denunciation that he forgets to build. To attack corruption is good; to create honest government is better. The nation needs fearless criticism, but it also needs the spirit of justice which recognizes achievement and supports constructive effort. Progress cannot be made by tearing down alone; it requires the patient work of setting up what is better."
  },
  {
    "id": "ss_woodrow_wilson_war_message",
    "subject": "social_studies",
    "topic": "World War I",
    "title": "War Message to Congress (Excerpt)",
    "author": "Woodrow Wilson",
    "year": 1917,
    "content": "The present German submarine warfare against commerce is a warfare against mankind. It is a war against all nations. American ships have been sunk, American lives taken, in ways that have stirred us very deeply. We are accepting this challenge of hostile purpose because we know that in such a government, following such methods, there can be no assured security. The world must be made safe for democracy. Its peace must be planted upon the tested foundations of political liberty. We have no selfish ends to serve. We desire no conquest, no dominion. We seek no indemnities for ourselves, no material compensation for the sacrifices we shall freely make. It is a fearful thing to lead this great peaceful people into war, but the right is more precious than peace, and we shall fight for the rights of nations great and small."
  },
  {
    "id": "ss_federalist_10_madison",
    "subject": "social_studies",
    "topic": "Constitution / Government",
    "title": "Federalist No. 10 (Excerpt)",
    "author": "James Madison",
    "year": 1787,
    "content": "Among the numerous advantages promised by a well-constructed union, none deserves to be more accurately developed than its tendency to break and control the violence of faction. By a faction, I mean a number of citizens, whether amounting to a majority or minority of the whole, who are united by some common impulse of passion or of interest adverse to the rights of other citizens or to the permanent and aggregate interests of the community. The latent causes of faction are sown in the nature of man. The inference to which we are brought is, that the causes of faction cannot be removed; and that relief is only to be sought in the means of controlling its effects. A large republic, composed of many interests and opinions, makes it harder for a single faction to oppress the rest, and thus better secures liberty."
  },
  {
    "id": "ss_mary_church_terrell_colored_american_woman",
    "subject": "social_studies",
    "topic": "African American History / Women's Rights",
    "title": "What It Means to Be Colored in the Capital of the United States (Excerpt)",
    "author": "Mary Church Terrell",
    "year": 1898,
    "content": "In Washington, which ought to be the freest and most enlightened city in the country, a colored woman finds herself restricted at every turn. She may be educated, refined, and upright in character; yet there are public places from which she is excluded solely because of her race. She may be compelled to ride in a certain car, to eat in a certain place, to accept discourtesy where others receive welcome. The humiliation of this treatment is not easily described. Nevertheless, colored women, by patient effort and unshaken faith, have built schools, churches, and clubs. They have worked for the uplift of their homes and for the protection of their children. They have proven that character is not a matter of color. The time must come when the nation will measure its citizens by their worth, not by the shade of their skin."
  },
  {
    "id": "science_charles_lyell_principles_geology",
    "subject": "science",
    "topic": "Earth Science / Geology",
    "title": "Principles of Geology (Excerpt)",
    "author": "Charles Lyell",
    "year": 1830,
    "content": "The present is the key to the past. This is the doctrine I have endeavored to illustrate: that the forces now operating upon the Earth’s surface—rivers wearing down mountains, oceans depositing sediments, volcanoes building up land—are the very same forces that have acted for countless ages. We need not imagine sudden, violent catastrophes to account for the great changes recorded in the rocks. Slow, observable processes, given sufficient time, can raise continents and hollow seas. This uniformity of causes gives geology a firm foundation, for we can study nature as it is today and infer the history of our planet. Thus the Earth is far older than many have supposed, and its features are the result of long, continuous action."
  },
  {
    "id": "science_antoine_lavoisier_elements_chemistry",
    "subject": "science",
    "topic": "Chemistry",
    "title": "Elements of Chemistry (Excerpt)",
    "author": "Antoine Lavoisier",
    "year": 1789,
    "content": "Nothing is created and nothing is lost in the operations of chemistry; there is only a change, a combination, a separation of particles. When a metal is burned in air, it increases in weight because it has combined with a portion of the air. When a gas is produced, the weight of the substances before and after remains the same. This is the law of conservation of mass. To understand chemical reactions, we must name the substances correctly, measure them exactly, and record the results clearly. Chemistry thus becomes not a mysterious art practiced by a few, but a science resting on observation and calculation. By adopting a rational nomenclature and by using the balance, we have laid the foundations for all future discoveries."
  },
  {
    "id": "science_robert_hooke_micrographia",
    "subject": "science",
    "topic": "Biology / Microscopy",
    "title": "Micrographia (Excerpt)",
    "author": "Robert Hooke",
    "year": 1665,
    "content": "By the help of microscopes, there is nothing so small as to escape our inquiry; hence there is a new visible world discovered to the understanding. A slice of cork, which to the naked eye appears solid, is seen to be composed of many little boxes or cells, like a honeycomb. Insects that seemed but tiny specks are revealed to be elaborately jointed machines, furnished with hairs, eyes, and claws. The edge of a razor, thought to be smooth, is found ragged and uneven. These observations teach us humility, for they show that our senses do not reveal the whole of nature. They also teach us curiosity, for who can tell what other wonders lie hidden beyond the reach of our present instruments?"
  },
  {
    "id": "science_gregor_mendel_hybridization",
    "subject": "science",
    "topic": "Genetics",
    "title": "Experiments on Plant Hybridization (Excerpt)",
    "author": "Gregor Mendel",
    "year": 1866,
    "content": "In cultivating varieties of the garden pea, I observed that certain traits appeared in regular numerical proportions. When I crossed a plant with round seeds and one with wrinkled seeds, the first generation showed only round seeds. But when these offspring were allowed to self-fertilize, the next generation produced round and wrinkled seeds in the ratio of about three to one. Similar results were obtained for flower color, pod color, and plant height. From these experiments I concluded that traits are determined by discrete factors, which are passed from parents to offspring. These factors do not blend but remain distinct, and some are dominant over others. Thus heredity follows laws that can be stated mathematically, and variation in living things is not chaotic but ordered."
  },
  {
    "id": "science_james_clerk_maxwell_electromagnetic_field",
    "subject": "science",
    "topic": "Physics / Electromagnetism",
    "title": "A Dynamical Theory of the Electromagnetic Field (Excerpt)",
    "author": "James Clerk Maxwell",
    "year": 1865,
    "content": "The experiments of Faraday have shown that electric and magnetic phenomena are closely related. I have endeavored to express this relation in mathematical form. The result is that light itself appears to be an electromagnetic disturbance propagated through the field according to electromagnetic laws. Electric and magnetic forces are not instantaneous actions at a distance, but conditions of a medium filling space. When these conditions change, waves are set up which travel with a finite velocity. That velocity, as determined from the experiments, is the same as that of light. Hence we are led to the remarkable conclusion that light and magnetism are affections of the same substance, and that light is an electromagnetic wave. Thus two great departments of physics are united."
  },
  {
    "id": "science_nikola_tesla_alternating_current",
    "subject": "science",
    "topic": "Electric Power",
    "title": "On the Use of Alternating Currents (Excerpt)",
    "author": "Nikola Tesla",
    "year": 1892,
    "content": "In considering the transmission of electric power, it became evident to me that direct current systems would always suffer great losses over distance. Alternating current, on the other hand, can be transformed to higher voltages, transmitted over long lines, and then reduced again for practical use. By employing rotating magnetic fields and polyphase systems, we can construct motors that are both efficient and reliable, with few parts to wear. The spread of such systems will make it possible to harness waterfalls and distant sources of energy for the service of cities. Electricity, so managed, will become not a curiosity but a universal servant, lighting homes, driving machinery, and improving daily life."
  },
  {
    "id": "science_alfred_russel_wallace_varieties",
    "subject": "science",
    "topic": "Evolution / Biogeography",
    "title": "On the Tendency of Varieties to Depart Indefinitely from the Original Type (Excerpt)",
    "author": "Alfred Russel Wallace",
    "year": 1858,
    "content": "Every species is constantly exposed to conditions which destroy many of its individuals. Those which happen to be born with a slight advantage—greater swiftness, better color for concealment, stronger beak—are more likely to live and to reproduce. Their favorable traits are thus preserved, while the less favored die out. In regions where the conditions differ, different traits will be favored, and so varieties may arise. If the differences continue to accumulate, these varieties may become distinct species. Thus the origin of species can be explained by natural causes acting slowly over long periods, without calling upon sudden acts of creation. This view is supported by the geographical distribution of animals, which shows clearly that closely allied forms inhabit neighboring regions."
  },
  {
    "id": "science_faraday_chemical_history_candle",
    "subject": "science",
    "topic": "Chemistry / Energy",
    "title": "The Chemical History of a Candle (Excerpt)",
    "author": "Michael Faraday",
    "year": 1861,
    "content": "There is not a law under which any part of this universe is governed which does not come into play in the phenomena of a candle. Consider the flame: fed by the melted wax, supplied with oxygen from the air, it gives light and heat while producing water and carbonic acid. The wax, though solid, is first turned into a vapor, and it is this vapor that truly burns. The current of hot gases rises, drawing in fresh air below, so that the process continues. If we enclose the candle and cut off the air, the flame is extinguished; if we supply pure oxygen, it burns brighter. Thus from so simple an object as a candle we may learn the nature of combustion, the properties of gases, and the conservation of matter."
  },
  {
    "id": "science_humboldt_personal_narrative_tropics",
    "subject": "science",
    "topic": "Natural History / Ecology",
    "title": "Personal Narrative of Travels to the Equinoctial Regions (Excerpt)",
    "author": "Alexander von Humboldt",
    "year": 1814,
    "content": "In the tropics, nature displays a magnificence unknown in temperate zones. The forests are not composed of a few species of trees, but of multitudes, each with its own form of leaf and flower. Lianas hang like festoons from the branches; orchids bloom upon the trunks; birds of brilliant plumage dart among the foliage. Yet this profusion is not disorder. The same laws that govern the distribution of plants upon the mountains of Europe govern them here, but under conditions of greater heat and moisture. By comparing distant regions, we perceive the unity of nature. The Earth is not a collection of separate kingdoms but a single great organism, in which climate, soil, plants, and animals act and react upon one another."
  },
  {
    "id": "rla_edgar_allan_poe_tell_tale_heart",
    "subject": "rla",
    "topic": "Short Story / Gothic",
    "title": "The Tell-Tale Heart (Excerpt)",
    "author": "Edgar Allan Poe",
    "year": 1843,
    "content": "True!—nervous—very, very dreadfully nervous I had been and am; but why will you say that I am mad? The disease had sharpened my senses, not destroyed, not dulled them. Above all was the sense of hearing acute. I heard all things in the heaven and in the earth. I heard many things in hell. How, then, am I mad? Listen! and observe how healthily—how calmly I can tell you the whole story. It was the old man’s eye! A pale blue eye, with a film over it. Whenever it fell upon me, my blood ran cold; and so, by degrees—very gradually—I made up my mind to take the life of the old man, and thus rid myself of the eye forever. Night after night I opened his door, oh so gently, to look upon him as he slept, and still the eye would not be upon me, for it was closed. It was not the old man who vexed me, but his Evil Eye."
  },
  {
    "id": "rla_jack_london_to_build_a_fire",
    "subject": "rla",
    "topic": "Adventure / Naturalism",
    "title": "To Build a Fire (Excerpt)",
    "author": "Jack London",
    "year": 1908,
    "content": "The man was a newcomer in the land, a chechaquo, and this was his first winter. The cold did not lead him to meditate upon its significance. Fifty degrees below zero was to him merely fifty degrees below zero. He was quick and alert in the things of life, but only in the things, and not in their meanings. The Yukon lay a mile wide and hidden under three feet of ice. The man walked along the trail with a local dog at his heels. The dog knew it was no time for traveling. Its instinct told it that it was colder than sixty below, that no man should be abroad. Yet the man pressed on. He was bound for the boys, waiting at camp, and he had a plan to lunch at the forks, where he would build a fire. He did not know that in the North, to build a fire at such temperatures is not comfort but survival."
  },
  {
    "id": "rla_kate_chopin_desirees_baby",
    "subject": "rla",
    "topic": "Fiction / Social Themes",
    "title": "Désirée’s Baby (Excerpt)",
    "author": "Kate Chopin",
    "year": 1893,
    "content": "Désirée had been found, when a baby, asleep in the shadow of the big stone pillar. The Valmondés, childless and kind, had taken her to their hearts. She grew to be beautiful and gentle, and when Armand Aubigny saw her, he fell in love as if struck by a flame. Their marriage was happy, and when the child was born Armand’s pride was fierce and sweet. But as the weeks passed, Madame Valmondé, visiting, looked closely at the baby and then at Désirée. There was a subtle change, a tint, impossible to deny. Rumors in the quarters grew. Armand’s face hardened; he avoided his wife. At last he told her coldly that she was not white, that it was in her blood. Heartbroken, Désirée took the baby and walked out into the bayou’s reeds, leaving only a letter behind. Later, searching old papers, Armand discovered the truth: it was not Désirée but his own mother who had belonged to the race he despised."
  },
  {
    "id": "rla_william_cullen_bryant_thanatopsis",
    "subject": "rla",
    "topic": "Poetry / Nature",
    "title": "Thanatopsis (Excerpt)",
    "author": "William Cullen Bryant",
    "year": 1817,
    "content": "To him who in the love of Nature holds communion with her visible forms, she speaks a various language. When thoughts of the last bitter hour come like a blight over thy spirit, and sad images of the stern agony, and shroud, and pall, and breathless darkness, and the narrow house make thee to shudder and grow sick at heart, go forth under the open sky, and list to Nature’s teachings. Earth and her waters, and the depths of air, shall soothe thee. Thou shalt lie down with patriarchs of the infant world—with kings, the powerful of the earth—the wise, the good, fair forms, and hoary seers of ages past, all in one mighty sepulchre. The hills, rock-ribbed and ancient as the sun, the vales stretching in pensive quietness between, the rivers that move in majesty, shall be thy burial-place."
  }
]
```
```json
[
  {
    "id": "ss_patrick_henry_liberty_or_death",
    "subject": "social_studies",
    "topic": "American Revolution / Persuasive Speech",
    "title": "Speech in the Virginia Convention (Give Me Liberty)",
    "author": "Patrick Henry",
    "year": 1775,
    "content": "Mr. President, it is natural to man to indulge in the illusions of hope. We are apt to shut our eyes against a painful truth and listen to the song of that siren till she transforms us into beasts. Is this the part of wise men, engaged in a great and arduous struggle for liberty? Are we disposed to be numbered among those who, having eyes, see not, and having ears, hear not the things which so nearly concern their temporal salvation? For my part, whatever anguish of spirit it may cost, I am willing to know the whole truth; to know the worst, and to provide for it. We have petitioned, we have remonstrated, we have supplicated; our petitions have been slighted, our remonstrances have produced additional violence and insult. There is no longer any room for hope. The war is actually begun! Our brethren are already in the field! The next gale that sweeps from the north will bring to our ears the clash of resounding arms! I know not what course others may take; but as for me, give me liberty or give me death!"
  },
  {
    "id": "ss_samuel_adams_rights_of_colonists",
    "subject": "social_studies",
    "topic": "Colonial Rights / Natural Rights",
    "title": "The Rights of the Colonists (Excerpt)",
    "author": "Samuel Adams",
    "year": 1772,
    "content": "Among the natural rights of the colonists are these: First, a right to life; secondly, to liberty; thirdly, to property; together with the right to support and defend them in the best manner they can. These are evident branches of, rather than deductions from, the duty of self-preservation, commonly called the first law of nature. All men have a right to remain in a state of nature as long as they please; and in case of intolerable oppression, civil or religious, to leave the society they belong to, and enter into another. The right to freedom being the gift of God Almighty, it is not in the power of any man or body of men to honestly give away or take away this right. Government was designed for the happiness of the people, and whenever it becomes destructive of that end, it is the unquestionable right of the people to alter or abolish it and to institute new government."
  },
  {
    "id": "ss_susan_b_anthony_is_it_a_crime",
    "subject": "social_studies",
    "topic": "Women's Suffrage",
    "title": "Is It a Crime for a U.S. Citizen to Vote? (Excerpt)",
    "author": "Susan B. Anthony",
    "year": 1873,
    "content": "Friends and fellow citizens, I stand before you tonight under indictment for the alleged crime of having voted at the last presidential election, without having a lawful right to vote. It shall be my work this evening to prove to you that in thus voting, I not only committed no crime, but, instead, simply exercised my citizen’s right, guaranteed to me and all United States citizens by the National Constitution. The preamble of the Constitution says, “We, the people,” not we, the white male citizens, nor we, the male citizens, but we, the whole people. And being one of the people, I am a citizen; and as a citizen, I am entitled to vote. If the government can deny one half of the people this fundamental right, then no liberty is secure. The law should not make criminals of women for doing what would be praised in men."
  },
  {
    "id": "ss_lincoln_lyceum_address",
    "subject": "social_studies",
    "topic": "Rule of Law / Early Lincoln",
    "title": "The Perpetuation of Our Political Institutions (Lyceum Address Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1838,
    "content": "At what point shall we expect the approach of danger? By what means shall we fortify against it? Shall we expect some transatlantic military giant to step the ocean and crush us at a blow? Never! All the armies of Europe, Asia and Africa combined could not by force take a drink from the Ohio, or make a track on the Blue Ridge, in a trial of a thousand years. At what point then is the approach of danger to be expected? I answer, if it ever reach us, it must spring up amongst us. If destruction be our lot, we must ourselves be its author and finisher. As a nation of freemen we must live through all time, or die by suicide. Let reverence for the laws be breathed by every American mother to the lisping babe, taught in schools, and enforced in courts, so that no man shall set himself above the law."
  },
  {
    "id": "ss_theodore_roosevelt_new_nationalism",
    "subject": "social_studies",
    "topic": "Progressive Reform",
    "title": "The New Nationalism (Excerpt)",
    "author": "Theodore Roosevelt",
    "year": 1910,
    "content": "The New Nationalism puts the national need before sectional or personal advantage. It demands of the government a positive role in promoting social justice. The object of government is the welfare of the people. The citizens of the United States must effectively control the mighty commercial forces which they have themselves called into being. Whenever these forces become so great that they dominate instead of serving the people, the people have the right and duty to regulate them. We must protect the working man, we must protect women and children, and we must insist that property shall be the servant and not the master of the commonwealth. This is not hostility to wealth, but insistence that the common good stands above private profit."
  },
  {
    "id": "ss_wilson_fourteen_points",
    "subject": "social_studies",
    "topic": "World War I / Internationalism",
    "title": "Fourteen Points (Excerpt)",
    "author": "Woodrow Wilson",
    "year": 1918,
    "content": "What we demand in this war is nothing peculiar to ourselves. It is that the world be made fit and safe to live in; and particularly that it be made safe for every peace-loving nation which, like our own, wishes to live its own life. Open covenants of peace, freedom of navigation, the removal of economic barriers, and the reduction of armaments—these are the foundations of a just peace. Peoples must be allowed to determine their own political future. An association of nations must be formed under specific covenants for the purpose of affording mutual guarantees of political independence and territorial integrity to great and small states alike. Only on such a basis can the sacrifices of war be justified."
  },
  {
    "id": "ss_henry_grady_new_south",
    "subject": "social_studies",
    "topic": "Reconstruction / New South",
    "title": "The New South (Excerpt)",
    "author": "Henry W. Grady",
    "year": 1886,
    "content": "We have let economy take root in our soil and peace brood over our homes. The Old South rested everything on slavery and agriculture, unconscious that these could neither give nor maintain healthy growth. The New South presents a perfect democracy; a social system compact and closely knitted, less splendid on the surface, but stronger at the core. The New South is building cotton mills beside the fields where the cotton grows; it is diversifying crops, educating its children, and inviting capital, not by servility, but by showing that it can stand on its own. We are not surrendering the memories of the past, but we are determined to make the future more glorious than the past by industry, education, and reconciliation."
  },
  {
    "id": "ss_niagara_movement_declaration",
    "subject": "social_studies",
    "topic": "Early Civil Rights",
    "title": "Declaration of Principles of the Niagara Movement (Excerpt)",
    "author": "Niagara Movement Members (incl. W. E. B. Du Bois)",
    "year": 1905,
    "content": "We believe that this country is ours, not by gracious favor, but by sheer hard-earned right. We claim for ourselves every single right that belongs to a freeborn American—political, civil, and social—and until we get these rights we will never cease to protest. We want full manhood suffrage, and we want it now. We want the abolition of all caste distinctions based simply on race and color. We want the right to labor and the right to learn. We protest against common school systems separate and unequal; against the curtailment of our civil rights by intimidation and violence. We especially complain against the denial of justice in the courts and the frequent lynching of our brothers. America must be American for all her citizens."
  },
  {
    "id": "science_carl_linnaeus_systema_naturae",
    "subject": "science",
    "topic": "Classification / Biology",
    "title": "Systema Naturae (Excerpt)",
    "author": "Carl Linnaeus",
    "year": 1735,
    "content": "The diversity of living things is vast, yet it is not confused. Nature is orderly. To make sense of this order, I have proposed that every plant and animal be given two names: a generic name and a specific name. By this binomial system, all naturalists in every land may speak the same language. Creatures that resemble each other in structure and reproduction are placed in the same genus; related genera are grouped into higher ranks. The purpose is not merely to label, but to reveal the plan of the Creator as shown in the forms of life. By careful observation of parts—the petals of flowers, the teeth of animals, the number of limbs—we can place each organism in a natural system. Thus classification becomes the key to understanding the richness of the natural world."
  },
  {
    "id": "science_william_harvey_motion_of_heart",
    "subject": "science",
    "topic": "Human Body / Circulation",
    "title": "On the Motion of the Heart and Blood (Excerpt)",
    "author": "William Harvey",
    "year": 1628,
    "content": "When I considered the various opinions of anatomists about the movement of the blood, I found none that satisfied reason. By repeated dissections and observations on living animals, I discovered that the heart acts as a pump, contracting and relaxing in regular order, driving blood into the arteries. The blood does not ebb and flow in the veins like a tide; rather, it is sent out from the heart and returns to it in a circle, which I call the circulation of the blood. The valves of the veins permit blood to move in one direction only, toward the heart. This perpetual circular motion supplies all parts of the body with nourishment and life. Thus the body is not a static structure but a dynamic system, maintained by constant movement."
  },
  {
    "id": "science_john_snow_cholera",
    "subject": "science",
    "topic": "Public Health / Epidemiology",
    "title": "On the Mode of Communication of Cholera (Excerpt)",
    "author": "John Snow",
    "year": 1855,
    "content": "During the late outbreaks of cholera in London, I was struck by the fact that the disease clustered in certain streets and houses. By mapping the cases, I found that nearly all were supplied with water from a particular pump in Broad Street. I concluded that cholera is not borne by foul air alone, as was generally believed, but by something in the water—an agent too small to be seen, yet capable of producing violent illness when swallowed. When the handle of the Broad Street pump was removed, the number of new cases fell off rapidly. This fact strongly supports the waterborne theory. If we can secure pure water and proper disposal of waste, we may prevent such epidemics. Thus careful observation and statistics can guide public health."
  },
  {
    "id": "science_florence_nightingale_notes_on_nursing",
    "subject": "science",
    "topic": "Health / Nursing",
    "title": "Notes on Nursing (Excerpt)",
    "author": "Florence Nightingale",
    "year": 1859,
    "content": "The very first requirement in a hospital is that it should do the sick no harm. Yet many patients perish not from their original disease but from foul air, bad drainage, and want of cleanliness. The nurse’s duty is to place the patient in the best possible condition for nature to act upon him. This means pure air, pure water, efficient drainage, cleanliness, and light. The sick should not breathe the air they have just exhaled. Windows must be opened, beds aired, and rooms kept free of needless noise. What is called trained nursing is the knowledge of how to manage the patient’s environment. It is no small thing, for on it often depends whether life or death shall prevail."
  },
  {
    "id": "science_james_hutton_theory_of_earth",
    "subject": "science",
    "topic": "Geology / Deep Time",
    "title": "Theory of the Earth (Excerpt)",
    "author": "James Hutton",
    "year": 1795,
    "content": "In examining the surface of the Earth, we find layers of rock lying horizontally, but often tilted, broken, and uplifted. These rocks contain the remains of marine animals, which shows they were formed at the bottom of the sea. Yet now we find them high on mountains. How can this be? The answer is that the Earth is not in a state of rest but of perpetual circulation. Land is worn down by weathering and rivers; its materials are carried to the sea, where they form new strata; these strata are later raised again by subterranean heat. No trace of a beginning, no prospect of an end, is to be found. The present is the key to the past, and the processes we see today have been shaping the Earth for immeasurable ages."
  },
  {
    "id": "science_benjamin_franklin_electricity",
    "subject": "science",
    "topic": "Electricity",
    "title": "Experiments and Observations on Electricity (Excerpt)",
    "author": "Benjamin Franklin",
    "year": 1751,
    "content": "It appears from many experiments that lightning is an electrical fire. When a pointed rod is elevated toward a thundercloud, sparks may be drawn from it; and if the rod be conducted to the earth, the lightning will often follow it rather than strike a building. Thus we may protect houses, ships, and magazines of powder by affixing to them metal rods which rise above the highest point and pass into the moist earth below. Electricity is not created by our machines, but collected and transferred. It may be positive or negative, and bodies become charged when these quantities are uneven. By understanding this fluid, we may turn a fearful natural phenomenon into a thing partially under human control."
  },
  {
    "id": "science_mary_somerville_physical_sciences",
    "subject": "science",
    "topic": "Scientific Synthesis",
    "title": "On the Connexion of the Physical Sciences (Excerpt)",
    "author": "Mary Somerville",
    "year": 1834,
    "content": "The various branches of science, though often studied apart, are in truth closely interwoven. Astronomy depends on mathematics; chemistry is aided by heat and electricity; geology borrows from astronomy when it considers the age and formation of the Earth. It is the object of this work to show that the laws discovered in one field frequently illuminate another. The perturbations of the planets, the tides of the ocean, the form of the Earth, the properties of light—all obey general principles. The more we compare, the more we perceive a unity of design and operation. Such a view not only enlarges the mind but encourages further inquiry, for it suggests that nature is intelligible and harmonious."
  },
  {
    "id": "science_john_tyndall_scientific_imagination",
    "subject": "science",
    "topic": "Nature of Science",
    "title": "The Scientific Use of the Imagination (Excerpt)",
    "author": "John Tyndall",
    "year": 1870,
    "content": "The imagination, when disciplined by facts, is the architect of physical theory. We cannot see the waves of the ether, nor the atoms of chemistry, yet by imagining them in accordance with experiment we bridge the gulf between the visible and the invisible. This is not license to dream wildly; it is a trained and chastened imagination, checked at every step by observation. In this way, science advances: we form a mental picture, we test it, we correct it. Thus the mind grows in power, and nature yields her secrets. The scientist is not a mere collector of facts; he is a thinker who discerns the principles that bind the facts together."
  },
  {
    "id": "rla_sarah_orne_jewett_white_heron",
    "subject": "rla",
    "topic": "Regional Fiction / Nature",
    "title": "A White Heron (Excerpt)",
    "author": "Sarah Orne Jewett",
    "year": 1886,
    "content": "The woods were already filled with shadows one June evening, just before eight o’clock, though a bright sunset still glimmered faintly among the trunks of the trees. A little girl was driving home her cow, a plodding, dilatory, provoking creature, but a valued companion. The child, Sylvia, had come from the city to live with her grandmother in the country, and she loved the stillness. One day a young hunter appeared, eager and pleasant, carrying a gun, and he spoke of a rare white heron he wished to shoot. He offered money if Sylvia would tell where it nested. That night, Sylvia climbed the great pine tree to see the world, and there, in the dawn, she saw the heron’s secret place. But when she came down, with the knowledge shining in her eyes, she could not speak. The wild bird’s life was dearer to her than the hunter’s praise."
  },
  {
    "id": "rla_herman_melville_bartleby",
    "subject": "rla",
    "topic": "Fiction / Character Study",
    "title": "Bartleby, the Scrivener (Excerpt)",
    "author": "Herman Melville",
    "year": 1853,
    "content": "I am a rather elderly man. The nature of my avocations has brought me into more than ordinary contact with what would seem an interesting and somewhat singular set of men of whom, as yet, nothing that I know of has ever been written—I mean the law-copyists or scriveners. It was a small affair of business that first brought Bartleby to my office. At first he did an extraordinary quantity of writing. As days passed, something unusual appeared in him. Upon my asking him to help examine a document, he replied calmly, \"I would prefer not to.\" This he repeated on many subsequent occasions, until at length he preferred not to do any copying at all. His passive resistance, so quiet yet so immovable, perplexed me more than anger or violence could have done. He was a man who had decided to withdraw from the world without leaving it."
  },
  {
    "id": "rla_charlotte_perkins_gilman_yellow_wallpaper",
    "subject": "rla",
    "topic": "Fiction / Social Critique",
    "title": "The Yellow Wallpaper (Excerpt)",
    "author": "Charlotte Perkins Gilman",
    "year": 1892,
    "content": "It is very seldom that mere ordinary people like John and myself secure ancestral halls for the summer. Still, the place is quite alone, standing well back from the road, quite three miles from the village. There is something strange about the house—perhaps it is only the wallpaper in the nursery. It is dull enough to confuse the eye, pronounced enough to irritate, and it has a kind of sprawling flamboyant pattern committing every artistic sin. I am told to rest and not to write, but the more I am forbidden, the more my mind dwells on that pattern. At night it seems to move; by day I fancy I see a woman behind it, shaking the bars to get out. If a woman is shut up long enough and denied her own work, she begins to creep in her mind, even as the figure behind the wallpaper creeps."
  },
  {
    "id": "rla_paul_laurence_dunbar_symphathy",
    "subject": "rla",
    "topic": "Poetry / African American Voice",
    "title": "Sympathy",
    "author": "Paul Laurence Dunbar",
    "year": 1899,
    "content": "I know what the caged bird feels, alas! When the sun is bright on the upland slopes; when the wind stirs soft through the springing grass, and the river flows like a stream of glass; when the first bird sings and the first bud opes, and the faint perfume from its chalice steals—I know what the caged bird feels. I know why the caged bird beats his wing till its blood is red on the cruel bars; for he must fly back to his perch and cling when he fain would be on the bough a-swing. And a pain still throbs in the old, old scars and they pulse again with a keener sting—I know why he beats his wing. I know why the caged bird sings, ah me, when his wing is bruised and his bosom sore—when he beats his bars and would be free; it is not a carol of joy or glee, but a prayer that he sends from his heart’s deep core, but a plea, that upward to Heaven he flings—I know why the caged bird sings."
  }
]
```
```json
[
  {
    "id": "ss_hamilton_report_on_manufactures",
    "subject": "social_studies",
    "topic": "Early Republic / Economic Policy",
    "title": "Report on Manufactures (Excerpt)",
    "author": "Alexander Hamilton",
    "year": 1791,
    "content": "The wealth, independence, and security of a nation are materially connected with the prosperity of manufactures. Agriculture may indeed be the most necessary and primary of pursuits, but to rely on it alone is to leave the nation exposed to the fluctuations of foreign markets and the caprice of other powers. A broad and well-planned encouragement of manufactures will draw into useful employment those classes of people who are not profitably engaged, will create a home market for the produce of our farmers, and will diversify the industry of the United States. It is not true that agriculture and manufactures are rivals; they are, rather, mutual aids. Where there is a thriving manufacturing class, farmers find steady purchasers; where there is only agriculture, periods of glut and want of demand must occur. Therefore, it is the proper task of government to remove obstacles, to foster inventions, to encourage skill, and in some cases to protect young industries until they are able to stand by their own strength."
  },
  {
    "id": "ss_angelina_grimke_appeal_to_christian_women",
    "subject": "social_studies",
    "topic": "Abolition / Women's Reform",
    "title": "An Appeal to the Christian Women of the South (Excerpt)",
    "author": "Angelina Grimké",
    "year": 1836,
    "content": "Sisters in Christ, you live in the midst of a people who hold in bondage more than two millions of human beings, men and women created in the image of the same God who made you. You have been taught that this system is sanctioned by Scripture and approved by heaven, but I beseech you to search the Scriptures for yourselves. You will find that the God of the Bible hears the cry of the oppressed and condemns the hands that shed innocent blood. You feel that as women you can do little, but it is not so. You can read, you can pray, you can teach your children that slavery is a sin; you can refuse to be silent. Influence is not measured by loudness, but by faithfulness. If Southern Christian women were to rise up and declare, in the name of the gospel of love, that they will no longer be parties to the wrong, slavery would totter. Duty is ours, results are God’s."
  },
  {
    "id": "ss_olaudah_equiano_narrative_middle_passage",
    "subject": "social_studies",
    "topic": "Slavery / Atlantic World",
    "title": "The Interesting Narrative (Middle Passage Excerpt)",
    "author": "Olaudah Equiano",
    "year": 1789,
    "content": "I now saw myself confined in a world of wonders. The stench of the hold was so intolerably loathsome that it was dangerous to remain there for any time, and some of the Africans were permitted to stay on deck for the air. The closeness of the place, and the heat of the climate, added to the number of our companions, almost suffocated us. The shrieks of the women and the groans of the dying rendered the whole a scene of horror almost inconceivable. I was soon put down under the decks, and there I received such a salutation in my nostrils as I had never experienced in my life: the air soon became unfit for respiration, from a variety of loathsome smells, and brought on a sickness among the slaves, of which many died. It was then I first saw the sign of despair among my countrymen, chained and crowded, kept alive only for the profit of their captors."
  },
  {
    "id": "ss_red_jacket_religion_of_the_white_men",
    "subject": "social_studies",
    "topic": "Native American Diplomacy",
    "title": "Religion for the White Man and the Red (Speech Excerpt)",
    "author": "Red Jacket (Sagoyewatha)",
    "year": 1805,
    "content": "Brother, you say there is but one way to worship and serve the Great Spirit. If there is but one religion, why do you white people differ so much about it? Why not all agree, as you can all read the same book? We are told that your religion was given to your forefathers, and has been handed down from father to son. We also have a religion, which was given to our forefathers, and has been handed down to us, their children. We worship that way. It teaches us to be thankful for all the gifts we receive, to love each other, and to live in peace. We never quarrel about religion. We do not want to destroy your religion or take it from you. We only want to enjoy our own. The Great Spirit made us all, but he gave us different ways. Since he has made so many paths, we will walk in the one he gave to our nation."
  },
  {
    "id": "ss_henry_clay_american_system",
    "subject": "social_studies",
    "topic": "Economic Development / Internal Improvements",
    "title": "On the American System (Excerpt)",
    "author": "Henry Clay",
    "year": 1824,
    "content": "The object of the American System is not to build up one part of the country at the expense of another, but to bind all sections together in a web of mutual interest. By protecting our manufactures, we give employment to our citizens, increase the home market for our farmers, and lessen our dependence on foreign nations. By constructing roads, canals, and other internal improvements, we open channels through which the products of the West may flow to the East, and the goods of the East may reach the West. A nation so extended as ours cannot rely on chance for its union; it must knit itself with works of art and policy. Let us, then, cherish domestic industry, encourage enterprise, and make the government the handmaid of national prosperity."
  },
  {
    "id": "ss_thaddeus_stevens_reconstruction",
    "subject": "social_studies",
    "topic": "Reconstruction",
    "title": "Speech on Reconstruction (Excerpt)",
    "author": "Thaddeus Stevens",
    "year": 1867,
    "content": "The foundation of every government is the consent of the governed, and that consent is a mockery if given only by the triumphant race while the men who have borne the heaviest burdens of war are denied a voice. The freedmen of the South have been loyal to the Union; they have tilled the fields, guided our armies, and suffered violence for our sake. To restore the late rebel States without securing the rights of these men is to betray justice. We must remake Southern society on the basis of equal civil and political rights. Land, education, and the ballot—these are the safeguards of liberty. Until the old ruling class is restrained and loyal governments are established, Congress must exercise its constitutional power and protect the weak from the oppression of the strong."
  },
  {
    "id": "ss_carl_schurz_american_imperialism",
    "subject": "social_studies",
    "topic": "Foreign Policy / Imperialism",
    "title": "American Imperialism (Speech Excerpt)",
    "author": "Carl Schurz",
    "year": 1899,
    "content": "I am opposed to an American colonial policy because I am an American. Our nation was born of the declaration that governments derive their just powers from the consent of the governed. If we hold subject peoples in distant islands without their consent, we deny in practice the principle that is our pride in theory. Empire abroad will corrupt liberty at home. Armies and navies maintained to subdue others will sooner or later be used to overawe our own citizens. Our glory has lain in presenting to the world the example of a great republic, peaceful, prosperous, and free. Let us not tarnish it by imitating the old powers of Europe. Our best expansion is the expansion of our ideals."
  },
  {
    "id": "ss_frances_willard_home_protection",
    "subject": "social_studies",
    "topic": "Temperance / Women's Activism",
    "title": "Home Protection and Temperance (Excerpt)",
    "author": "Frances E. Willard",
    "year": 1883,
    "content": "There is no spot on Earth so sacred to a woman as the home, and there is no enemy so cruel to that home as the traffic in strong drink. It is the mother who must look into the eyes of hungry children when the father’s wages have been spent at the saloon. It is the wife who must bear the violence and neglect which follow in the train of drunkenness. Yet the law which licenses this evil is made without her consent. We therefore demand the ballot, not to unsex ourselves, but to protect the home. Temperance is not merely a private virtue; it is a public necessity. If the State will legalize a business that destroys men’s bodies and souls, then women, who suffer most from it, must have a voice in saying whether it shall continue."
  },
  {
    "id": "science_huxley_piece_of_chalk",
    "subject": "science",
    "topic": "Geology / Deep Time",
    "title": "On a Piece of Chalk (Excerpt)",
    "author": "Thomas H. Huxley",
    "year": 1868,
    "content": "If I take a piece of common chalk and ask what it is, the answer will lead us far back into the history of our planet. Chalk is composed almost entirely of the microscopic shells of minute sea-creatures which lived in an ocean that once covered a great part of Europe. Layer upon layer of these tiny organisms fell to the sea floor, forming beds thousands of feet thick. In time, these beds were uplifted, hardened, and now form the cliffs of Dover and the chalk downs of England. In that humble piece of chalk, therefore, we have the record of an ancient sea full of life, of slow deposit, of geological change. The world we see today is but the latest page of a very long book, and even the simplest substance may tell us of uncounted ages."
  },
  {
    "id": "science_darwin_voyage_of_beagle",
    "subject": "science",
    "topic": "Natural History / Observation",
    "title": "Voyage of the Beagle (Galápagos Excerpt)",
    "author": "Charles Darwin",
    "year": 1839,
    "content": "The natural history of this archipelago is very remarkable: it seems to be a little world within itself. Most of the organic productions are aboriginal creations, found nowhere else. The birds, though closely allied to those of the American continent, are in many cases peculiar species. So it is with the reptiles and the plants. Seeing this, I was deeply impressed with the idea that species may not be immutable. Why should the Galápagos mockingbirds, for example, differ slightly from island to island, though all resemble the mainland form? Why should the tortoises bear marks by which an inhabitant can tell from which island they came? These facts seemed explicable if species had been modified by their conditions of life. The voyage thus planted in my mind the seeds of that later theory which I called natural selection."
  },
  {
    "id": "science_muir_mountains_of_california",
    "subject": "science",
    "topic": "Ecology / Conservation",
    "title": "The Mountains of California (Excerpt)",
    "author": "John Muir",
    "year": 1894,
    "content": "When we try to pick out anything by itself, we find it hitched to everything else in the universe. Nowhere is this more visible than in the Sierra Nevada, where glacier-meadows, forests, and streams are bound together in one harmonious whole. The pines draw their life from the soil made by ancient ice; the waterfalls feed the ferns and lilies; the animals in their turn scatter seeds and keep the balance. To destroy the forests is to dry the fountains that feed the valleys. Nature’s beauty is not mere decoration, but a sign of health. I would have people go to the mountains not only for recreation but for instruction, to learn that man is only one of the Creator’s creatures and must live in sympathy with all the rest."
  },
  {
    "id": "science_lamarck_zoological_philosophy",
    "subject": "science",
    "topic": "Early Evolutionary Thought",
    "title": "Zoological Philosophy (Excerpt)",
    "author": "Jean-Baptiste Lamarck",
    "year": 1809,
    "content": "No species has been formed all at once. Nature never makes leaps. From the simplest forms of life, produced by spontaneous generation in the earliest ages, there has been a slow and continual progress toward more complex organization. This progress is guided by two great laws: first, that the frequent use of any organ strengthens and develops it, while the disuse of it weakens and diminishes it; and second, that these acquired developments are transmitted to offspring. Thus, in a race of animals that has long been obliged to wade in water, the toes may spread and a membrane may form; in others, the neck may lengthen to reach leaves. Environment, need, and habit act together. Though later naturalists may improve upon this theory, I submit that it explains the great variety of living forms by natural causes rather than by separate acts of creation."
  },
  {
    "id": "science_jj_thomson_corpuscles_of_electricity",
    "subject": "science",
    "topic": "Physics / Atomic Theory",
    "title": "Cathode Rays and the Corpuscle (Excerpt)",
    "author": "J. J. Thomson",
    "year": 1897,
    "content": "In studying the discharge of electricity through gases at low pressure, I observed that the rays coming from the cathode could be deflected by electric and magnetic fields. From these deflections I calculated the ratio of their mass to their charge and found it to be far smaller than that of the lightest atom known. The only reasonable inference was that these rays consist of particles, which I have called corpuscles, much smaller than atoms, and common to all kinds of matter. This discovery shows that the atom is not indivisible, as once supposed, but contains constituent parts. Electricity itself appears to be carried by these corpuscles. We are thus admitted, as it were, into the inner structure of matter, and we see that the differences between substances may be due to the arrangement of particles which are themselves identical."
  },
  {
    "id": "science_asa_gray_structural_botany",
    "subject": "science",
    "topic": "Botany / Classification",
    "title": "Introduction to Structural Botany (Excerpt)",
    "author": "Asa Gray",
    "year": 1879,
    "content": "Plants, though fixed to the soil and silent, are not beyond the reach of orderly study. By examining the root, stem, leaf, flower, and fruit, we find constant patterns. The flower, which seems to be a mere ornament, is in fact an apparatus for reproduction. Its sepals, petals, stamens, and pistils are leaves transformed for special ends. By attending to these parts, we can distinguish families and genera as certainly as a zoologist distinguishes mammals from birds. This knowledge is not only for scholars; it enables the farmer and gardener to understand the habits of their crops and to improve them. The Creator has used few ideas in many combinations, and the botanist’s task is to trace these plans through the living green world."
  },
  {
    "id": "science_powell_colorado_river_exploration",
    "subject": "science",
    "topic": "Geography / Exploration",
    "title": "Exploration of the Colorado River (Excerpt)",
    "author": "John Wesley Powell",
    "year": 1875,
    "content": "We pushed our boats into a region of the Earth that few had seen. The river, confined between walls of solid rock, ran with a force that seemed irresistible. On either side, cliffs rose in terraces of red, brown, and purple, telling the story of ages carved by water. Here the geologist reads a book whose leaves are miles thick. The canyons show that arid lands are shaped not only by wind and sun, but by sudden floods that cut deep trenches. I perceived that the American West could not be settled as the humid East had been. Its water is limited and must be measured, conserved, and shared with care. Thus exploration led not only to scientific knowledge but to a new policy for lands of scant rainfall."
  },
  {
    "id": "science_gifford_pinchot_conservation",
    "subject": "science",
    "topic": "Conservation / Public Lands",
    "title": "The Fight for Conservation (Excerpt)",
    "author": "Gifford Pinchot",
    "year": 1910,
    "content": "Conservation means the greatest good to the greatest number for the longest time. The forests, rivers, and minerals of the United States are not to be wasted for the profit of a few, but managed so that our children and our children’s children may have their share. Waste is not only a private fault; it is a public crime. Forests prevent floods, regulate streams, and furnish lumber. If they are cut recklessly, the soil washes away and whole valleys are ruined. The government, as trustee for the people, must see that these resources are used wisely. Conservation does not mean locking everything up; it means use without abuse—development joined to foresight."
  },
  {
    "id": "science_herschel_outlines_of_astronomy",
    "subject": "science",
    "topic": "Astronomy",
    "title": "Outlines of Astronomy (Excerpt)",
    "author": "John F. W. Herschel",
    "year": 1849,
    "content": "When we lift our eyes to the heavens, we see not a mere scattering of lights but a system of bodies moving under precise laws. The planets describe ellipses about the sun; the satellites attend upon their primaries; comets sweep in from outer darkness and return at long intervals. By measuring angles and applying mathematics, we can predict eclipses, the return of comets, and the positions of the stars. Yet beyond the stars we see clouds of light, nebulae, which the telescope resolves in some cases into clusters of suns. Space thus appears to be peopled to an extent beyond the reach of imagination. The same law of gravitation binds all together. Astronomy teaches us at once the vastness of creation and the power of human reason, which, though dwelling on a small planet, can comprehend in part the architecture of the universe."
  },
  {
    "id": "rla_stephen_crane_open_boat",
    "subject": "rla",
    "topic": "Realism / Survival",
    "title": "The Open Boat (Excerpt)",
    "author": "Stephen Crane",
    "year": 1897,
    "content": "None of them knew the color of the sky. Their eyes glanced level, and were fastened upon the waves that swept toward them. These waves were of the hue of slate, save for the tops, which were of foaming white, and all of the men knew the colors of the sea. The correspondent, the oiler, the cook, and the injured captain lay in a ten-foot dinghy that seemed but a grain upon the great sea. It was a weary business rowing, for the surf forever threatened to fling them over, and yet they persisted because there was nothing else to do. Often the correspondent wished to cry out to the universe, “Do you not see, we are here?” But the universe was indifferent. It neither raged nor pitied. And in that indifference the men found a strange comradeship, each man helping the other to live in a world that did not know they existed."
  },
  {
    "id": "rla_kate_chopin_pair_of_silk_stockings",
    "subject": "rla",
    "topic": "Fiction / Choice",
    "title": "A Pair of Silk Stockings",
    "author": "Kate Chopin",
    "year": 1897,
    "content": "Little Mrs. Sommers one day found herself the unexpected possessor of fifteen dollars. It seemed to her a very large amount of money, and she had planned to spend it wholly for the children—shoes for Janie, material for new waists, perhaps some stockings. She had the careful pride of a mother who makes a little do for many. But at the store, her hand rested on a pair of silk stockings, soft, smooth, and of a shade that pleased her. An impulse seized her. She had never indulged herself so. She bought them, and with that act the day changed. She dined at a restaurant, ordered better food than she was used to, and sat among well-dressed people as if she belonged there. For a few hours she stepped out of duty into desire. The money was gone at the end, but the memory of being, for once, only herself remained."
  },
  {
    "id": "rla_mark_twain_jumping_frog",
    "subject": "rla",
    "topic": "Humor / American Voice",
    "title": "The Celebrated Jumping Frog of Calaveras County (Excerpt)",
    "author": "Mark Twain",
    "year": 1865,
    "content": "There was a feller here once by the name of Jim Smiley, in the winter of ’49—or may be it was the spring of ’50—I don’t recollect exactly, somehow, though what makes me think it was one or the other is because I remember the big flume wasn’t finished when he first come to the camp. Anyway, this Jim Smiley was the curiousest man about betting you ever did see. If there was a dog-fight, he’d bet on it; if there was a cat-fight, he’d bet on it; if there was two birds settin’ on a fence, he’d bet which one would fly first. By and by he got him a frog, and he set in to educate him; and he did educate him, too. He gave him a little punch behind, and the frog would spring straight up higher than any frog in Calaveras County. Smiley was proud of him till a stranger filled the frog with quail-shot and beat him fair and square. That was Smiley all over—always willin’ to bet, and sometimes learnin’ the hard way."
  },
  {
    "id": "rla_bret_harte_luck_of_roaring_camp",
    "subject": "rla",
    "topic": "Western Fiction / Redemption",
    "title": "The Luck of Roaring Camp (Excerpt)",
    "author": "Bret Harte",
    "year": 1868,
    "content": "It was a name given to her by Kentuck in a burst of admiration of the baby’s small red hand, which, in trying to reach his finger, clasped it tightly. The men of Roaring Camp were not used to babies. They were miners, rough, unshaven, accustomed to oaths rather than lullabies. Yet when the mother died and the child remained, a strange change came over the camp. They built a better cabin, they planted flowers, they washed their faces more often. The presence of innocence made vice ashamed. Men stopped quarreling so loud, and the place grew almost respectable. They called the child “the Luck,” for since she came the claims seemed richer and the days more hopeful. In the midst of a rough frontier, the miners discovered that tenderness was still possible, and that even in a camp of outcasts a child could make a home."
  }
]
```
[
  {
    "id": "rla_frontier_train_journey",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Train Through the Frontier",
    "author": "Public Domain Style",
    "year": 1890,
    "content": "When the westbound train pulled out of St. Louis, Clara Hayes pressed her gloved hand to the windowpane and watched the city fall away. She was twenty-three, traveling alone to teach school in the Dakota Territory. The conductor tipped his cap, and the cars rattled like tin toys across the prairie. For days, she watched endless grass bend beneath the wind, broken only by distant herds and the black dots of buffalo birds. Each evening, as the sun spilled copper light over the plains, she wrote in her small journal that the land felt both young and ancient. On the third night, a storm rose from the north. Thunder cracked against the iron of the train, and passengers huddled in silence. Clara felt fear but also wonder. Here was the continent’s heartbeat, wild and untamed, echoing against the rails. When morning broke, the air smelled of rain and lilac. In that freshness she understood her purpose—not merely to teach letters and sums, but to show children how to read the story written in the wind itself."
  },
  {
    "id": "rla_invention_of_printing",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "How the Printing Press Changed Learning",
    "author": "Public Domain Style",
    "year": 1885,
    "content": "Before Gutenberg’s press turned in Mainz, books were copied by hand, line by patient line, upon parchment. A single volume might occupy a monk for months or even years. When movable type arrived, words could be cast and pressed upon paper with astonishing speed. The new art spread across Europe like dawn across a darkened sky. Knowledge, once guarded by monasteries, spilled into the streets, the shops, and the minds of merchants and sailors. Cheap pamphlets debated theology and science; plays and poems reached readers who had never held a book. The press became a kind of second discovery of fire—less visible but equally transformative. It warmed intellect instead of hearths. With it came confusion as well as enlightenment: errors multiplied, heresies circulated, and rulers feared the power of printed dissent. Yet the written word could no longer be contained. From the clatter of wooden letters emerged an age of questioning that shaped the modern world."
  },
  {
    "id": "rla_lighthouse_keeper",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Lighthouse Keeper’s Vigil",
    "author": "Public Domain Style",
    "year": 1902,
    "content": "At the edge of the Atlantic, Elias Ward tended the lantern that kept sailors from ruin. For twenty years he had wound the clockwork and polished the glass, though few remembered his name. The sea was both his companion and his adversary. In calm weather it glittered like hammered silver; in storm it roared with voices older than scripture. One winter night the fog thickened until even the horn was swallowed. He climbed the spiral stairs again and again, checking the wick, the oil, the flame. Below, the tide battered the rocks in blind fury. Near dawn, through the gray veil, he glimpsed a shadow of a schooner listing toward the reef. Without hesitation he rang the bell and swung the great beam toward the danger. When daylight came, wreckage drifted but the men were saved. In their gratitude, they asked his name. He simply smiled and said, 'The light knew what to do.'"
  },
  {
    "id": "rla_art_of_listening",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "On the Lost Art of Listening",
    "author": "Public Domain Style",
    "year": 1910,
    "content": "In every conversation there is a race between the tongue and the ear, and too often the tongue wins. We praise eloquence, but we neglect the discipline of listening. To listen is not to wait for one’s turn to speak; it is to open the mind as a harbor opens to ships. The quiet man gathers more wisdom in a minute of attention than the talker does in an hour of display. Our age, filled with telegraphs and clamoring presses, confuses noise with knowledge. If each citizen would learn to hear before he answers, councils would last shorter and hearts would heal faster. The philosopher listens for truth, the poet for music, and the friend for pain unspoken. Let us recover the nobility of the attentive ear, for words deserve a dwelling as well as an echo."
  },
  {
    "id": "rla_factory_children",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "Children of the Factory Age",
    "author": "Public Domain Style",
    "year": 1858,
    "content": "When the clatter of looms filled the towns of England, children were among the first drawn into the mills. Small hands could dart between the spinning frames where a grown man’s arm could not reach. They worked before dawn and after dusk, their faces powdered with cotton dust. Reformers wrote pamphlets describing their pale cheeks and hollow eyes. Outrage rose slowly, like light through fog, until Parliament passed laws to guard the young. Yet even when hours were shortened, poverty drove families to send their sons and daughters back to the humming machines. The Industrial Revolution forged progress, but its iron shone with tears as well as triumph. To study those days is to see that civilization’s advance must always be measured by the care it shows to its smallest citizens."
  },
  {
    "id": "rla_tavern_of_voices",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Tavern of Voices",
    "author": "Public Domain Style",
    "year": 1877,
    "content": "Rain hammered the shingles of the King’s Rest Inn while travelers crowded around the hearth. Each had a tale: the sailor spoke of storms, the merchant of markets, the soldier of battles half-won. Yet the loudest voice belonged to a poet with no audience beyond the walls. He declared that every man’s story was a stanza in a single, endless song. The others laughed, but he went on: 'When you boast, you rhyme with pride; when you mourn, you rhyme with loss.' At midnight the fire sank, and one by one the guests drifted to silence. In that hush, the poet’s words seemed to hover in the smoke. The innkeeper, sweeping embers into a pail, muttered that perhaps the fellow was right—that life itself was a poem none of us could finish before dawn."
  },
  {
    "id": "rla_language_of_flowers",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "The Secret Language of Flowers",
    "author": "Public Domain Style",
    "year": 1894,
    "content": "Long before telegraphs or postcards, people spoke through petals. In the Victorian age, each blossom carried a message. A red rose meant love, a violet modesty, a sprig of rosemary remembrance. Suitors who dared not speak aloud composed bouquets with trembling care, and recipients answered in kind. The fashion may seem quaint now, yet it reveals the human hunger for symbols. When words are forbidden or insufficient, we turn to color, scent, and shape to express the heart’s ungoverned speech. Even today, a florist’s window is a small library of emotion—its pages soft, fragrant, and brief."
  },
  {
    "id": "rla_on_courage",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "The Measure of Courage",
    "author": "Public Domain Style",
    "year": 1900,
    "content": "Men commonly mistake boldness for bravery. To shout, to strike, to defy—these are but gestures. True courage is quieter. It is the strength to do what conscience dictates when applause is absent and failure almost certain. The nurse who tends the fevered poor, the clerk who refuses a dishonest order, the child who speaks truth to an angry parent—each possesses a valor greater than the soldier’s drumbeat. A nation is free only while its citizens are brave in private. Let us, then, honor not merely the heroes in marble but those whose courage leaves no monument except the peace of their own hearts."
  },
  {
    "id": "rla_poem_riverbend",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Poetry",
    "title": "Winter at the River Bend",
    "author": "Public Domain Style",
    "year": 1880,
    "content": "The river bends beneath a sheet of glass, / the reeds stand frozen like a prayer. / No song of lark, no whispering grass, / only the hush of crystal air. / A single skater carves his line, / bright sparks of frost beneath his heel, / and where he passes, faintly shine / the echoes time alone can feel. / I watch until his figure fades, / the curve dissolves, the rhythm ends; / and think how swiftly beauty trades / its hour for silence, ice for bends. / The river sleeps, yet underneath / its dreaming heart the waters run; / so does the soul, though bound in sheath, / still murmur softly to the sun."
  },
  {
    "id": "rla_inventors_daughter",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Inventor’s Daughter",
    "author": "Public Domain Style",
    "year": 1915,
    "content": "When Lydia’s father died, he left behind a room filled with blueprints and silence. The neighbors said he had wasted his years chasing impossible machines. Lydia thought otherwise. Each evening she wound the brass gears of his unfinished clockwork bird. At first it only trembled; then one night it fluttered and gave a thin, metallic chirp. Tears blurred her eyes as she realized the design required music, not power. She placed her own small tune within its heart—an echo from her childhood—and the bird sang clear and true. People came from miles to see it, marveling at invention, but Lydia knew it was love that had completed the machine."
  },
  {
    "id": "rla_on_silence",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "In Praise of Silence",
    "author": "Public Domain Style",
    "year": 1869,
    "content": "Silence is not emptiness; it is the mother of thought. In cities we drown beneath the rumble of wheels and the clatter of tongues, until the mind grows thin from noise. To be silent is not to withdraw from life but to listen to it. The sage who sits by a still pond hears more of the universe than the orator upon his stage. Silence refines anger, distills sorrow, and makes joy audible. Those who cannot bear it are often those who fear the company of their own souls. In an age of endless declaration, silence remains the most radical speech of all."
  },
  {
    "id": "rla_letter_from_frontier",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Historical Fiction",
    "title": "Letter from the Frontier, 1850",
    "author": "Public Domain Style",
    "year": 1850,
    "content": "Dearest Mother, I write by candlelight while the wind moans around the cabin like some lonesome violin. We have planted corn and hope both will rise by spring. The nearest neighbor is ten miles distant, yet the prairie is not empty; it hums with life unseen. Yesterday a band of elk crossed the horizon like moving clouds. The children thrive, though they miss your stories by the fire. Tell Father that the soil here is black as ink and just as ready to receive words if one only had the courage to write them. Should fortune favor us, we will carve a town from this silence. Until then, think of me when the kettle sings, for that sound is the same even at the edge of the world."
  },
  {
    "id": "rla_poem_morning_forge",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Poetry",
    "title": "The Blacksmith’s Morning",
    "author": "Public Domain Style",
    "year": 1870,
    "content": "Before the town awakes, the forge already burns; / the anvil waits, patient as stone. / Sparks fly like prayers the hammer learns, / shaping steel into muscle and bone. / He swings for bread, for pride, for art, / his rhythm steady as a psalm. / The world he tempers with his heart / is both his burden and his balm. / When daylight pours through the open door, / he wipes his brow yet does not rest— / for labor is the creed he swore, / the hymn that beats within his chest."
  },
  {
    "id": "rla_on_books",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "The Companionship of Books",
    "author": "Public Domain Style",
    "year": 1888,
    "content": "There are friendships that never betray us, and among them are books. They wait upon the shelf without complaint, asking only that we open their hearts. A man may travel from youth to age, from poverty to honor, and still find his earliest volumes faithful. Unlike conversation, which dies upon the air, the written page preserves the better part of humanity. To read is to walk beside the greatest minds and to borrow their courage. Yet books demand courtesy: one must read not for vanity but for growth. The true reader seeks not to conquer a library but to commune with it. When we understand this, we discover that a single well-loved volume may contain more adventure than a thousand careless voyages."
  },
  {
    "id": "rla_experiment_with_light",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "An Experiment with Light",
    "author": "Public Domain Style",
    "year": 1908,
    "content": "In a darkened room, a simple beam of sunlight revealed to young scientists the secret colors hidden within white. Passing through a prism, the light unfolded into a ribbon of fire—violet, indigo, blue, green, yellow, orange, red. Each hue bent at a slightly different angle, proving that light was not a single substance but a harmony of many. From that discovery flowed the age of optics: microscopes to view the small, telescopes to explore the far. The experiment required no expensive tools, only curiosity and patience. Thus does science remind us that wonder often begins not in laboratories but in humble rooms where someone dares to ask, 'What if?'"
  },
  {
    "id": "rla_poem_dream_of_city",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Poetry",
    "title": "Dream of the City",
    "author": "Public Domain Style",
    "year": 1911,
    "content": "I dreamed a city built of bells, / where every street was tuned to chime; / each hour sang, and silence fell / only at the edge of time. / The workers forged their hopes in brass, / the children played in notes of gold; / and when the evening shadows passed, / the towers hummed with stories told. / Yet one small bell refused the song, / it kept a deeper, gentler tone; / and when I woke, its echo long / still whispered, 'You are not alone.'"
  },
  {
    "id": "rla_watchmaker",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Watchmaker’s Apprentice",
    "author": "Public Domain Style",
    "year": 1899,
    "content": "In a narrow shop that smelled of oil and patience, Tobias learned the art of time. His master, old Herr Klein, could mend any watch brought to him, from a sailor’s dented pocket piece to a duke’s jeweled heirloom. 'A clock,' he said, 'is a small universe, and the balance wheel its sun.' Tobias listened, but one day he dropped a customer’s watch and shattered its crystal. Expecting fury, he found only a smile. 'Then you will learn how to replace what you have broken,' said the master. Years later, Tobias owned the shop, and when an apprentice made the same mistake, he gave the same answer. Thus does craft become tradition, and forgiveness keep better time than anger."
  },
  {
    "id": "rla_on_kindness",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "The Quiet Strength of Kindness",
    "author": "Public Domain Style",
    "year": 1905,
    "content": "Kindness has no trumpet, yet it moves the world. Empires are founded by conquest but held together by simple decency. A kindly word has turned away wars, though the chronicles forget to mention it. Kindness asks no return; it is content with its own work. In commerce it softens greed, in science it humanizes truth, and in homes it is the unseen architect of peace. Some call it weakness, but it endures where strength crumbles. The hardest hearts, when met with steady mercy, begin to thaw. In the end, history may prove that civilization advanced not by machines or laws, but by the quiet persistence of the gentle."
  }
]
[
  {
    "id": "rla_austen_pemberley_visit",
    "subject": "rla",
    "topic": "Literary Fiction",
    "type": "Narrative",
    "title": "Elizabeth Visits Pemberley",
    "author": "Jane Austen",
    "year": 1813,
    "content": "Elizabeth Bennet, while recognizing the impropriety of visiting the estate of a man whose proposals she had once refused, found herself persuaded by curiosity and persuasion alike. As the carriage turned into the long avenue, her heart fluttered between pride and doubt. The house stood upon rising ground; its stone reflected the gentle light of afternoon, and the river wound at its foot with perfect grace. Within, everything bore evidence of taste rather than display. The housekeeper, a civil and cheerful woman, spoke warmly of her master’s goodness, his attention to every servant, and his kindness to the poor. Elizabeth listened in silence, her former prejudice trembling before this new testimony. When she came upon a miniature of Mr. Darcy, painted in his youth, she felt a confusion of recollection and admiration she could not disguise. The next moment, to her utter surprise, he himself appeared, riding from the park, his countenance calm though his color rose with astonishment. In that instant, Elizabeth knew that the world she had judged so hastily might yet hold unexpected worth, and that civility and affection, once joined, could restore all wounded pride."
  },
  {
    "id": "rla_twain_frog_of_calaveras",
    "subject": "rla",
    "topic": "American Humor",
    "type": "Narrative",
    "title": "The Celebrated Jumping Frog of Calaveras County",
    "author": "Mark Twain",
    "year": 1865,
    "content": "In the days when mining camps dotted the Californian hills, there lived a man named Jim Smiley who would bet on anything that turned up. If there was a race, he was sure to have a wager on the outcome; if there was no race, he would start one. His favorite creation was a frog named Dan’l Webster, which he had trained to jump higher than any other frog in Calaveras County. Smiley fed him flies with the care of a nurse and measured his leaps with scientific precision. One day a stranger came to town, a man with no appreciation for amphibious talent. Smiley, ever eager, offered to bet forty dollars that Dan’l Webster could outjump any frog in the county. The stranger said he had no frog, so Smiley obligingly lent him his prize while he went to fetch another. During Smiley’s absence, the stranger filled Dan’l Webster with quail shot. When the contest began, the frog could not stir a limb, while the stranger’s borrowed frog hopped away easily. Smiley watched his fortune vanish and, when the truth came out, swore that if that stranger ever returned, he would be ready—with a frog empty of lead and full of vengeance."
  },
  {
    "id": "rla_dickens_christmas_carol_visit",
    "subject": "rla",
    "topic": "Moral Narrative",
    "type": "Narrative",
    "title": "Scrooge Sees the Past",
    "author": "Charles Dickens",
    "year": 1843,
    "content": "When the clock struck one, Scrooge found himself face to face with a strange figure—childlike, yet aged as with the wisdom of centuries. The Ghost of Christmas Past beckoned him toward the window, and suddenly they stood together upon a country road. Frost sparkled upon the fields, and the air was filled with the innocent laughter of boys going home for the holidays. 'These are but shadows of the things that have been,' said the Spirit. Scrooge recognized his own youthful face among them and felt the first sting of tears he had known for years. They passed through the gates of an old schoolhouse, where a lonely boy sat reading by a dim fire. He saw himself neglected and forgotten, and his heart yearned with pity for that child. Then the scene shifted: there was Fezziwig, jolly and kind, throwing open his warehouse to music and dance. The joy of that night, once despised as folly, shone now as a treasure beyond gold. Each vision melted into the next, until Scrooge, trembling, begged the Spirit to show him no more. 'Would you so soon put out the light I give?' asked the Ghost. But Scrooge, overcome, covered his eyes, for memory’s glow can burn as sharply as repentance."
  },
  {
    "id": "rla_poe_house_of_usher",
    "subject": "rla",
    "topic": "Gothic Fiction",
    "type": "Narrative",
    "title": "The Fall of the House of Usher (Abridged)",
    "author": "Edgar Allan Poe",
    "year": 1839,
    "content": "During a dull, dark, and soundless day in the autumn of the year, I rode alone through a singularly dreary tract of country, until at length I beheld the melancholy House of Usher. Its windows were vacant, its stones decayed, and a sense of insufferable gloom hung over the scene. My friend Roderick Usher awaited me there, afflicted by a malady of body and soul. His twin sister, the Lady Madeline, moved through the rooms like a shadow of life. The house itself seemed conscious, its very air infected with decay. As the days passed, the atmosphere grew oppressive; the tarn reflected the mansion as if it were a living double. One evening, as a storm raged without, Roderick confessed that he had entombed his sister while she yet breathed. A cry echoed through the halls. The doors burst open, and Madeline, pale and blood-stained, fell upon her brother. He uttered a single shriek and died. As I fled into the tempest, lightning cleft the house from roof to foundation, and the dark tarn closed sullenly over the fragments of the House of Usher."
  },
  {
    "id": "rla_douglass_escape_freedom",
    "subject": "rla",
    "topic": "Autobiography",
    "type": "Informational",
    "title": "Frederick Douglass’s Escape to Freedom",
    "author": "Frederick Douglass",
    "year": 1845,
    "content": "The desire to be free had grown within me like fire in dry stubble. Yet I knew the dangers. To be caught meant the lash, or worse. I obtained false papers and a sailor’s uniform, trembling as I boarded the train in Baltimore. Each station was a battle of nerves; every official glance felt like the touch of doom. When I reached New York, I was at last among men who could not own me. I looked at my hands, hardly believing that they were indeed my own. The first sensation was not triumph but a deep weariness; freedom, when it came, was too large to grasp at once. I was a stranger in a free land, penniless and alone, but the air itself seemed to bear a different weight. I found work, then fellowship, and finally a voice. I learned that liberty is not merely escape but the right to labor, to learn, and to love. That day I resolved that my story, if ever told, should give courage to others still in chains."
  },
  {
    "id": "rla_emerson_nature",
    "subject": "rla",
    "topic": "Philosophy",
    "type": "Argumentative",
    "title": "From Nature",
    "author": "Ralph Waldo Emerson",
    "year": 1836,
    "content": "Standing upon the bare ground, my head bathed by the blithe air, I become a transparent eyeball; I am nothing; I see all. The currents of the Universal Being circulate through me; I am part or particle of God. The lover of nature is he whose inward and outward senses are still truly adjusted to each other. Nature never wears a mean appearance. The sun shines today also. Within the woods we return to reason and faith. There I feel that nothing can befall me in life—no disgrace, no calamity—which nature cannot repair. Every object rightly seen unlocks a new faculty of the soul. To speak truly, few adults can see nature. Most people behold not the sun. The sun illuminates only the eye of the man, but shines into the heart of the child. In the wilderness, I find something more dear and connate than streets or cities. The greatest delight which the fields and woods minister is the suggestion of an occult relation between man and the vegetable. They nod to me, and I to them."
  },
  {
    "id": "rla_whitman_o_captain",
    "subject": "rla",
    "topic": "Poetry",
    "type": "Elegy",
    "title": "O Captain! My Captain!",
    "author": "Walt Whitman",
    "year": 1865,
    "content": "O Captain! my Captain! our fearful trip is done, / The ship has weather’d every rack, the prize we sought is won; / The port is near, the bells I hear, the people all exulting, / While follow eyes the steady keel, the vessel grim and daring. / But O heart! heart! heart! / O the bleeding drops of red, / Where on the deck my Captain lies, / Fallen cold and dead. / O Captain! my Captain! rise up and hear the bells; / Rise up—for you the flag is flung—for you the bugle trills; / For you bouquets and ribbon’d wreaths—for you the shores a-crowding; / For you they call, the swaying mass, their eager faces turning. / Here Captain! dear father! / This arm beneath your head; / It is some dream that on the deck, / You’ve fallen cold and dead. / My Captain does not answer, his lips are pale and still, / My father does not feel my arm, he has no pulse nor will; / The ship is anchor’d safe and sound, its voyage closed and done; / From fearful trip the victor ship comes in with object won; / Exult O shores, and ring O bells! / But I with mournful tread, / Walk the deck my Captain lies, / Fallen cold and dead."
  },
  {
    "id": "rla_london_to_build_fire",
    "subject": "rla",
    "topic": "Naturalism",
    "type": "Narrative",
    "title": "To Build a Fire (Condensed)",
    "author": "Jack London",
    "year": 1902,
    "content": "The man walked through the white silence of the Yukon, his breath turning instantly to crystal dust. He was without imagination, knowing only that it was very cold and that he must reach camp by nightfall. At seventy below zero, the bark of the trees cracked like rifle shots. A dog trotted behind him, its instinct warning of danger that reason could not measure. When the man slipped through a hidden spring and wet his feet, he stopped to build a fire. The flames caught, warming him briefly, but as he fed them with twigs, snow from an overhanging branch fell and smothered the blaze. Panic seized him. He tried again, fingers numb and useless, matches dropping from his grasp. The dog watched, uneasy, sensing the finality of the struggle. When at last the man sank to the snow and sleep overcame him, the animal crept away toward the camp where other men could give it warmth and food. The cold had no malice; it was simply the law of life and death in the Northland."
  },
  {
    "id": "rla_hughes_dream_deferred",
    "subject": "rla",
    "topic": "Harlem Renaissance",
    "type": "Poetry",
    "title": "Harlem (Dream Deferred)",
    "author": "Langston Hughes",
    "year": 1951,
    "content": "What happens to a dream deferred? / Does it dry up / like a raisin in the sun? / Or fester like a sore— / And then run? / Does it stink like rotten meat? / Or crust and sugar over— / like a syrupy sweet? / Maybe it just sags / like a heavy load. / Or does it explode? / Hughes captured the tension of a people promised freedom yet chained by circumstance. His brief lines speak louder than manifestos; each image trembles with compressed thunder. In the Harlem of the early twentieth century, such poems carried the voice of a generation learning that the heart, too, could be a battlefield."
  },
  {
    "id": "rla_steinbeck_grapes_intro",
    "subject": "rla",
    "topic": "Social Realism",
    "type": "Informational",
    "title": "The Land and the People",
    "author": "John Steinbeck",
    "year": 1939,
    "content": "Before dawn the trucks moved west, packed with families and tools of labor. The land they left behind had cracked beneath sun and wind until dust lay like ash upon the fields. The men drove in silence, eyes fixed ahead, while mothers quieted children with promises as thin as water. In California, they were told, oranges hung heavy and wages were fair. But the road was long, and the world indifferent. In the camps, they shared stories—of drought, of kindness, of exploitation. A preacher without a church said that the soul of man was not in heaven but in his fellow man. The migrants began to learn this truth: when property failed them, solidarity remained. The fruit of the land, they discovered, was sweetest only when shared. And though corporations owned the orchards, hope still sprouted in the rows between the furrows of despair."
  },
  {
    "id": "rla_hawthorne_scarlet_letter",
    "subject": "rla",
    "topic": "Moral Allegory",
    "type": "Narrative",
    "title": "The Scaffold Scene",
    "author": "Nathaniel Hawthorne",
    "year": 1850,
    "content": "Beneath the summer sky of New England stood Hester Prynne, holding her child against her bosom, the scarlet letter blazing upon her breast. Around her gathered the stern magistrates and the crowd, whispering judgment. Yet in that moment, shame turned strangely to strength. The infant’s face was her defense; the letter, her truth. When asked to name the father, she pressed the baby closer and answered nothing. Upon the scaffold she felt the full weight of human law, but within her a freer law spoke—one of mercy and of hidden love. The years would make her a counselor to others, and the letter once meant for disgrace became a badge of compassion. Thus Hawthorne showed that sin and sanctity are sometimes written in the same red thread upon the heart."
  },
  {
    "id": "rla_alcott_work",
    "subject": "rla",
    "topic": "Feminist Fiction",
    "type": "Narrative",
    "title": "A Working Woman’s Resolve",
    "author": "Louisa May Alcott",
    "year": 1873,
    "content": "Christie Devon left her aunt’s comfortable house with a small trunk and a large determination—to earn her bread honestly, whatever the world might think. Employment came hard: first as a companion, then as a seamstress, later as a governess. Each failure tested her courage but also taught her independence. When an employer dismissed her for daring to express an opinion, Christie walked out with her head high, whispering that poverty could never disgrace what injustice had already condemned. In time she found friends among reformers who sought fair wages and education for women. Looking back, she realized that work, though bitter, had given her a self no one could take away. 'Better to stand alone in the open air,' she said, 'than sit gilded in dependence.'"
  },
  {
    "id": "rla_thoreau_civil_disobedience",
    "subject": "rla",
    "topic": "Political Essay",
    "type": "Argumentative",
    "title": "Civil Disobedience (Excerpt)",
    "author": "Henry David Thoreau",
    "year": 1849,
    "content": "I heartily accept the motto, 'That government is best which governs least.' The authority of government, even such as I am willing to submit to—for I will cheerfully obey those who know better than I—still has its limits. Law never made men a whit more just. When the power of the State becomes a tool of injustice, the true place for a just man is prison. I refuse allegiance to any rule that enslaves another. If one honest man ceasing to hold slaves, and withdrawing from this co-partnership, were actually to be locked up in the county jail, it would be the abolition of slavery in America. Under a government which imprisons any unjustly, the true place for a just man is also a prison. Let your life be a counter-friction to stop the machine."
  },
  {
    "id": "rla_dickinson_hope_feathers",
    "subject": "rla",
    "topic": "Poetry",
    "type": "Lyric Poem",
    "title": "Hope is the Thing with Feathers",
    "author": "Emily Dickinson",
    "year": 1861,
    "content": "Hope is the thing with feathers / That perches in the soul, / And sings the tune without the words, / And never stops at all. / And sweetest in the gale is heard; / And sore must be the storm / That could abash the little bird / That kept so many warm. / I’ve heard it in the chillest land, / And on the strangest sea; / Yet, never, in extremity, / It asked a crumb of me. / Dickinson’s few lines carry the weight of whole sermons, for in her inward world the smallest image—a bird, a breeze—became the sign of eternal endurance."
  },
  {
    "id": "rla_washington_carver_plants",
    "subject": "rla",
    "topic": "Informational",
    "type": "Scientific Reflection",
    "title": "The Secret Life of Plants",
    "author": "George Washington Carver",
    "year": 1925,
    "content": "Each leaf is a little laboratory. The humble peanut, the sweet potato, and the common clover hold within them lessons of balance and renewal. When I study a plant, I do not ask what it can yield in profit, but what it can teach of patience. God did not make a single useless thing. The farmer who listens to the soil’s voice will never lack instruction. I have learned more in a field at dawn than in any library at noon. Nature speaks softly, but her words endure. We must restore to the land the care it gives us, for stewardship is both science and prayer."
  },
  {
[
  {
    "id": "rla_melville_whiteness_of_whale",
    "subject": "rla",
    "topic": "Symbolism and Perception",
    "type": "Literary Descriptive",
    "title": "The Whiteness of the Whale",
    "author": "Herman Melville",
    "year": 1851,
    "content": "What is it that so appalls the soul in the whiteness of the whale? Is it the absence of color, or rather the strange mixture of all colors lost in blinding brightness? Whiteness, to the human eye, bears two faces. It may be the emblem of purity, of holiness, of the snow upon the mountain peak; yet it may also be the hue of fear—the color of the ghost, the pallor of death, the vast, empty glare of endless space. When the sailor first beholds Moby Dick breaching from the deep, it is not merely a whale he sees but a mystery of existence itself. The creature’s color mocks all definition; it shines like the light of revelation and yet blinds as if from within. For me, the whiteness of the whale is the unanswerable question of life. It is the whisper that there are powers in this world beyond reason or mercy, and that to look upon them is to feel both awe and annihilation. Each man, when faced with his own Moby Dick, must choose whether to flee the vision or to pursue it unto madness."
  },
  {
    "id": "rla_twain_boyhood_mississippi",
    "subject": "rla",
    "topic": "American Realism",
    "type": "Memoir Narrative",
    "title": "Boyhood on the Mississippi",
    "author": "Mark Twain",
    "year": 1883,
    "content": "When I was a boy, nothing seemed so grand as the river. It wound its silver length through our town, lazy in the morning but wild with secrets by night. We swam, we fished, we built rafts of driftwood and dreamed of faraway New Orleans. The steamboats were our visions of glory—bright with brass, whistling like angels of industry. I longed to be a pilot more than a prince. To know every sandbar, every hidden snag, was to hold dominion over danger. Yet the river was a teacher with moods as changeful as the sky. One summer I saw it rise without warning and sweep away the ferry dock, the house of my friend Jim, and the orchard behind our school. When it fell quiet again, it left behind a new map of shallows and bends. I learned that life, like the river, will not stay charted. It shifts its course overnight, and we must learn to steer anew each dawn."
  },
  {
    "id": "rla_chopin_awakening",
    "subject": "rla",
    "topic": "Feminist Realism",
    "type": "Narrative",
    "title": "Edna by the Sea",
    "author": "Kate Chopin",
    "year": 1899,
    "content": "The sea spoke to Edna in whispers that only her heart could hear. Its voice was seductive, never ceasing, urging her to wander farther and farther from the shore of her old life. The touch of the water was like memory made flesh, recalling some forgotten liberty. Around her, the Creole women spoke of duty, of reputation, of children. But Edna’s soul stirred with other thoughts—of painting, of solitude, of passion not yet named. On that summer evening she waded deeper than she had dared before. The horizon flamed with the last light of day, and she felt for the first time that she belonged to herself alone. The world might forgive her nothing, yet the waves, breaking soft as breath, offered absolution. Chopin wrote not of rebellion only, but of awakening—the moment when a woman discovers that her spirit, once stirred, can never again return to sleep."
  },
  {
    "id": "rla_crane_red_badge",
    "subject": "rla",
    "topic": "War and Fear",
    "type": "Narrative",
    "title": "The Red Badge of Courage (Battle Scene)",
    "author": "Stephen Crane",
    "year": 1895,
    "content": "The regiment stood waiting, motionless except for the shiver of bayonets in the sun. The youth felt his throat tighten; the air itself seemed charged with expectation. Then came the cry, sharp as a blade: 'Forward!' and the line surged ahead. Smoke swallowed the field, thick and choking, while bullets sang their shrill, invisible song. The youth fired blindly, hardly knowing if he hit or missed. Around him men dropped without sound, as though life had slipped quietly away. His fear changed to fury, and he felt himself part of some vast, terrible machine. When at last the noise ebbed, he stood trembling, his musket hot in his hands. The earth smelled of powder and iron, and the sun returned, indifferent. He looked upon his comrades—some cheering, some silent forever—and understood that courage was not the absence of fear but the victory over it, brief and costly though it be."
  },
  {
    "id": "rla_london_white_fang",
    "subject": "rla",
    "topic": "Man and Nature",
    "type": "Narrative",
    "title": "The Law of the Wild",
    "author": "Jack London",
    "year": 1906,
    "content": "In the cold silence of the North, life is not measured by mercy but by endurance. White Fang, born of wolf and dog, learned early that kindness was a strange and dangerous thing. His mother taught him to hunt and to fear. The forest gave no gifts; it demanded payment in cunning and teeth. When men captured him, they called him beast and slave, yet he watched their world with fierce intelligence. Their law was different but not kinder—it punished weakness with blows instead of hunger. Only one man, Weedon Scott, spoke gently to him, and from that gentleness grew a trust more binding than chains. In time, the wild heart learned the meaning of love, and with it, a new kind of strength—the strength to protect rather than destroy. London’s wilderness was no mere landscape but the mirror of the human soul: cold, cruel, and capable of grace."
  },
  {
    "id": "rla_dickinson_inward_spring",
    "subject": "rla",
    "topic": "Poetry of Reflection",
    "type": "Poetry",
    "title": "An Inward Spring",
    "author": "Emily Dickinson",
    "year": 1862,
    "content": "A Light exists in Spring / Not present on the Year / At any other period — / When March is scarcely here. / A Color stands abroad / On Solitary Fields / That Science cannot overtake / But Human Nature feels. / It waits upon the Lawn; / It shows the furthest Tree / Upon the furthest Slope you know; / It almost speaks to you. / Then, as Horizons step, / Or Noons report away, / Without the Formula of sound, / It passes, and we stay. / A quality of loss — / Affecting our Content — / As Trade had suddenly encroached / Upon a Sacrament. / Dickinson’s verse gathers a hush like prayer, where nature and perception fuse, and eternity seems briefly visible between two breaths."
  },
  {
    "id": "rla_hughes_negro_speaks",
    "subject": "rla",
    "topic": "Cultural Identity",
    "type": "Poetry",
    "title": "The Negro Speaks of Rivers",
    "author": "Langston Hughes",
    "year": 1921,
    "content": "I’ve known rivers: / I’ve known rivers ancient as the world and older than the flow of human blood in human veins. / My soul has grown deep like the rivers. / I bathed in the Euphrates when dawns were young. / I built my hut near the Congo and it lulled me to sleep. / I looked upon the Nile and raised the pyramids above it. / I heard the singing of the Mississippi when Abe Lincoln went down to New Orleans, and I’ve seen its muddy bosom turn all golden in the sunset. / I’ve known rivers: / Ancient, dusky rivers. / My soul has grown deep like the rivers. / Hughes binds the ancestry of all time to the flow of water—turning history itself into a current of endurance and pride."
  },
  {
    "id": "rla_eliot_prufrock",
    "subject": "rla",
    "topic": "Modernist Poetry",
    "type": "Poetry",
    "title": "The Love Song of J. Alfred Prufrock (Excerpt)",
    "author": "T. S. Eliot",
    "year": 1915,
    "content": "Let us go then, you and I, / When the evening is spread out against the sky / Like a patient etherized upon a table; / Let us go, through certain half-deserted streets, / The muttering retreats / Of restless nights in one-night cheap hotels. / And indeed there will be time / To prepare a face to meet the faces that you meet; / There will be time to murder and create, / And time for all the works and days of hands / That lift and drop a question on your plate. / Do I dare / Disturb the universe? / In a minute there is time / For decisions and revisions which a minute will reverse. / Eliot’s voice hovers between irony and anguish, giving poetry a nervous, modern pulse that trembles with intellect and longing."
  },
  {
    "id": "rla_hawthorne_goodman_brown",
    "subject": "rla",
    "topic": "Allegory",
    "type": "Narrative",
    "title": "Young Goodman Brown’s Midnight Journey",
    "author": "Nathaniel Hawthorne",
    "year": 1835,
    "content": "Young Goodman Brown set forth into the forest, though his heart trembled at its darkness. There he met a man of grave countenance, bearing a staff shaped like a serpent. As they walked, Brown heard laughter from unseen lips and saw, by flickering light, the faces of those he had once revered—the minister, the deacon, and even his own wife, Faith. The woods echoed with hymns turned to mockery. 'Evil is the nature of mankind,' said the companion, 'and sin but a name for the world’s delight.' Brown cried out to resist, and all went black. When morning came, he stumbled home, uncertain whether his experience had been dream or revelation. Yet from that day forth, he trusted no man’s virtue, nor smiled again with ease. Hawthorne’s tale reminds us that innocence, once doubted, seldom returns unbroken."
  }
]
[
  {
    "id": "science_physics_newton_motion",
    "subject": "science",
    "topic": "Physics / Motion",
    "title": "Newton’s Laws of Motion",
    "author": "Isaac Newton (adapted, 1687)",
    "content": "Sir Isaac Newton’s three laws of motion describe how objects move and interact. The first law, often called inertia, states that a body will remain at rest or in uniform motion unless acted upon by an external force. The second law quantifies this idea, declaring that the acceleration of an object is proportional to the net force acting on it and inversely proportional to its mass—expressed by the equation F = ma. The third law asserts that for every action there is an equal and opposite reaction. These principles explain the behavior of everything from falling apples to orbiting planets. When a rocket launches, the engines push gases downward, and the gases push the rocket upward. When a skateboarder kicks off a wall, both move in opposite directions. Newton’s insight united earthly and celestial motion in a single framework and laid the foundation for classical mechanics, engineering, and much of modern physics."
  },
  {
    "id": "science_chemistry_elements",
    "subject": "science",
    "topic": "Chemistry / Elements",
    "title": "The Discovery of the Elements",
    "author": "Adapted from Lavoisier and Dalton writings (18th–19th c.)",
    "content": "Early chemists believed matter was made from four substances—earth, air, fire, and water. In the eighteenth century, Antoine Lavoisier began identifying true chemical elements, substances that could not be broken down further. His careful experiments with oxygen and combustion overturned the old theory of phlogiston and showed that burning and rusting are chemical reactions with oxygen. Later, John Dalton proposed that each element consists of tiny, indivisible particles called atoms. He argued that all atoms of an element are identical and combine in simple ratios to form compounds. This atomic theory gave chemistry a quantitative foundation. By the late nineteenth century, the periodic table organized known elements according to atomic weights, revealing repeating patterns in their behavior. These discoveries transformed chemistry from speculation into a precise science that could explain both the air we breathe and the metal in a bridge."
  },
  {
    "id": "science_biology_cell_theory",
    "subject": "science",
    "topic": "Biology / Cell Theory",
    "title": "The Foundation of Cell Theory",
    "author": "Matthias Schleiden & Theodor Schwann (adapted, 1838–1839)",
    "content": "Before the nineteenth century, scientists could only guess what living organisms were made of. Using newly improved microscopes, Matthias Schleiden and Theodor Schwann examined plant and animal tissues and discovered a striking similarity: all living things are composed of cells. Each cell is a small, organized unit capable of performing the basic functions of life—obtaining energy, growing, and reproducing. Later, Rudolf Virchow added that every cell arises from another existing cell, emphasizing the continuity of life. This idea, known as cell theory, unified biology and allowed scientists to understand how tissues repair, how bacteria cause disease, and how genetic information passes from one generation to the next. Whether in a leaf, a liver, or a lung, the cell remains the fundamental building block of life."
  },
  {
    "id": "science_ecology_photosynthesis",
    "subject": "science",
    "topic": "Biology / Ecology",
    "title": "Photosynthesis: Power of the Green World",
    "author": "Public domain synthesis (based on 19th-century research)",
    "content": "Photosynthesis is the process by which green plants, algae, and some bacteria convert sunlight into chemical energy. Using chlorophyll, plants absorb light and use its energy to transform carbon dioxide and water into sugars and oxygen. This simple reaction sustains nearly all life on Earth. The oxygen we breathe is a by-product of photosynthesis, while the sugars provide food not only for the plant itself but also for animals that consume it. In the mid-1800s, scientists such as Julius Sachs demonstrated that light is essential for this process, linking plant physiology to chemistry. Photosynthesis also maintains the balance of gases in the atmosphere, drawing carbon dioxide from the air and storing energy in plant matter. Every forest and field acts as a vast solar factory, capturing sunlight and fueling the planet’s web of life."
  },
  {
    "id": "science_astronomy_kepler_orbits",
    "subject": "science",
    "topic": "Astronomy / Planetary Motion",
    "title": "Kepler’s Laws of Planetary Motion",
    "author": "Johannes Kepler (adapted, 1609–1619)",
    "content": "Johannes Kepler, using the precise observations of Tycho Brahe, found that planets travel in elliptical orbits with the Sun at one focus. He discovered that a planet moves faster when closer to the Sun and slower when farther away, and that the square of a planet’s orbital period is proportional to the cube of its average distance from the Sun. These three laws replaced ancient circular models and provided strong evidence that the heavens obey mathematical order. Kepler’s work prepared the way for Newton’s theory of gravitation and later for space exploration. The same laws that govern Mercury’s quick orbit also predict the long journey of distant Neptune. By understanding these elegant relations, humanity first glimpsed the clockwork precision of the solar system."
  },
  {
    "id": "science_geology_darwin_earth_history",
    "subject": "science",
    "topic": "Geology / Earth History",
    "title": "Deep Time and the Changing Earth",
    "author": "Charles Lyell (adapted, 1830)",
    "content": "Geologist Charles Lyell argued that the present is the key to the past. By studying modern rivers, volcanoes, and erosion, he concluded that the same gradual processes have shaped the Earth over immense spans of time. This idea, called uniformitarianism, replaced the belief in sudden, worldwide catastrophes. Layer upon layer of rock recorded a history stretching millions of years—long enough for mountains to rise and seas to vanish. Lyell’s vision of deep time profoundly influenced Charles Darwin, who saw in it the vast stage on which life could evolve. Today, Lyell’s principles still guide geologists in reading the planet’s record: every ripple in sandstone and every fossil shell tells a story of change acting slowly but relentlessly."
  },
  {
    "id": "science_microbiology_pasteur",
    "subject": "science",
    "topic": "Microbiology",
    "title": "Louis Pasteur and the Germ Theory",
    "author": "Louis Pasteur (adapted, 1864)",
    "content": "In the nineteenth century many believed that disease and decay arose spontaneously. Louis Pasteur disproved this by showing that microorganisms come from other microorganisms, not from lifeless matter. In a famous experiment, he boiled nutrient broth in flasks with curved necks that allowed air in but kept dust out. The broth remained sterile until the neck was broken and airborne particles could enter. Pasteur’s work established the germ theory of disease and laid the groundwork for antiseptic surgery and vaccination. His discoveries showed that invisible life could cause immense harm but could also be harnessed for good, as in fermentation and food preservation. The principle that life comes only from life transformed both science and public health."
  },
  {
    "id": "science_physics_electricity_faraday",
    "subject": "science",
    "topic": "Physics / Electricity & Magnetism",
    "title": "Michael Faraday and Electromagnetic Induction",
    "author": "Michael Faraday (adapted, 1831)",
    "content": "Michael Faraday, a self-taught English scientist, discovered that a changing magnetic field can produce an electric current. In 1831 he wrapped two coils of wire around an iron ring. When he passed a current through one coil, a momentary current appeared in the other. He had shown that magnetism could generate electricity—a process called electromagnetic induction. Faraday’s experiments led to the invention of electric generators and transformers, technologies that power modern civilization. His concept of invisible 'lines of force' also inspired later physicists such as James Clerk Maxwell to develop the field theory of electromagnetism. From the hum of a power plant to the motion of a compass needle, Faraday’s insights revealed that electricity and magnetism are two aspects of one natural force."
  },
  {
    "id": "science_astronomy_galileo_telescope",
    "subject": "science",
    "topic": "Astronomy / Observation",
    "title": "Galileo and the Telescope",
    "author": "Galileo Galilei (adapted, 1610)",
    "content": "In 1609 Galileo Galilei turned a simple spyglass toward the heavens and changed history. Through his improved telescope he saw mountains and craters on the Moon, countless stars in the Milky Way, and four small moons orbiting Jupiter. These discoveries contradicted the ancient belief that all heavenly bodies were perfect and that everything revolved around the Earth. Galileo’s findings supported the Copernican model of a sun-centered solar system. His insistence on observation and experiment laid the foundations of modern science, even though it brought him into conflict with church authorities. The telescope became not just a tool for viewing the skies but a symbol of inquiry guided by evidence rather than tradition."
  },
  {
    "id": "science_physics_relativity_einstein",
    "subject": "science",
    "topic": "Physics / Relativity",
    "title": "Einstein’s Revolution in Space and Time",
    "author": "Albert Einstein (adapted, 1905–1916)",
    "content": "Albert Einstein’s theory of relativity transformed our understanding of the universe. In 1905 his special theory proposed that the laws of physics are the same for all observers moving at constant speed and that the speed of light is constant for everyone. From these ideas flowed astonishing results: time slows down for fast-moving objects, and mass and energy are equivalent, expressed in the famous equation E = mc². A decade later, his general theory showed that gravity is not a mysterious force but the curvature of space and time caused by mass. Planets orbit the Sun along the curved fabric of spacetime, and light bends as it passes massive objects. Einstein’s vision linked the smallest particles to the largest galaxies and continues to shape physics today."
  },
  {
    "id": "science_earth_weather",
    "subject": "science",
    "topic": "Earth Science / Meteorology",
    "title": "Understanding Weather and Climate",
    "author": "Adapted from U.S. Weather Bureau publications (public domain)",
    "content": "Weather is the condition of the atmosphere at a particular time and place, while climate describes long-term patterns. The Sun’s energy drives both. Unequal heating of the Earth’s surface causes air to rise and fall, creating winds that distribute heat and moisture around the globe. Water vapor condenses into clouds and precipitation, releasing latent heat that fuels storms. Scientists measure these processes with barometers, thermometers, and satellites. Predicting weather became a practical science in the twentieth century when data networks and computers allowed forecasters to model the atmosphere. Understanding climate helps societies prepare for droughts, floods, and changing seasons. Though complex, the movements of air and water obey physical laws as precise as those that guide the planets."
  },
  {
    "id": "science_ecology_food_chain",
    "subject": "science",
    "topic": "Ecology / Energy Flow",
    "title": "The Balance of Nature",
    "author": "Adapted from public-domain ecology texts",
    "content": "Every ecosystem depends on the transfer of energy from one organism to another. Green plants capture sunlight through photosynthesis and form the base of the food chain. Herbivores eat plants, carnivores eat herbivores, and decomposers return nutrients to the soil. When one part of this system is disturbed—by pollution, habitat loss, or overhunting—the effects ripple through the whole community. Ecologists in the early twentieth century, such as Charles Elton, described these relationships as food webs, emphasizing their interdependence. Even the smallest insect contributes to the stability of the environment. Understanding these links teaches that protecting nature means protecting the delicate exchanges that sustain all life."
  },
  {
    "id": "science_chemistry_states_of_matter",
    "subject": "science",
    "topic": "Chemistry / Matter",
    "title": "The Changing States of Matter",
    "author": "Adapted from 19th-century physical chemistry sources",
    "content": "All substances can exist as solid, liquid, or gas depending on temperature and pressure. In a solid, particles vibrate but remain in fixed positions; in a liquid, they slide past each other; in a gas, they move freely and rapidly. Heating adds energy, increasing motion and eventually breaking the forces that hold particles together. Cooling removes energy and can cause condensation or freezing. In the nineteenth century, scientists like James Joule and Rudolf Clausius developed the kinetic theory, explaining heat as motion of particles. This theory unified thermodynamics and molecular physics, showing that everyday changes—ice melting, water boiling—are governed by the same principles that operate inside stars. Matter is dynamic, its transformations part of the continuous dance of energy in the universe."
  },
  {
    "id": "science_geology_rock_cycle",
    "subject": "science",
    "topic": "Geology / Rock Cycle",
    "title": "The Rock Cycle: Earth’s Recycling System",
    "author": "Adapted from public-domain U.S. Geological Survey texts",
    "content": "The rocks that form Earth’s crust are constantly changing. Igneous rocks crystallize from molten magma. When exposed to wind, water, and temperature changes, they break down into sediments that may compact into sedimentary rock. Deep within the planet, heat and pressure can transform either type into metamorphic rock. If melted again, the material begins the cycle anew. This continuous process, known as the rock cycle, was first described in the nineteenth century by geologists studying mountain ranges and ocean basins. It shows that the planet is not static but alive with motion. The same atoms that once formed an ancient volcano may one day rest in a pebble on a beach, illustrating the slow but ceaseless renewal of Earth’s surface."
  },
  {
    "id": "science_biology_darwin_natural_selection",
    "subject": "science",
    "topic": "Biology / Evolution",
    "title": "Darwin and Natural Selection",
    "author": "Charles Darwin (adapted, 1859)",
    "content": "Charles Darwin observed that organisms produce more offspring than can survive, and individuals vary in traits such as size or color. Those with traits that help them survive and reproduce pass those traits to the next generation. Over time, these small differences accumulate, leading to the evolution of new species. Darwin called this process natural selection. His ideas, supported by evidence from fossils and geography, replaced the notion that species were unchanging. The theory of evolution by natural selection united all living things under one principle: shared descent with modification. Though controversial in his day, Darwin’s work provided a natural explanation for life’s diversity and remains the cornerstone of modern biology."
  },
  {
    "id": "science_earth_water_cycle",
    "subject": "science",
    "topic": "Earth Science / Hydrology",
    "title": "The Water Cycle",
    "author": "Adapted from U.S. Geological Survey (public domain)",
    "content": "Water circulates endlessly through the environment in a process called the hydrologic cycle. Heat from the Sun causes evaporation from oceans and lakes. Water vapor rises, cools, and condenses into clouds. When droplets grow heavy, they fall as rain or snow. Some water runs off into rivers, some seeps underground, and some returns to the sea. Plants also release moisture through transpiration. This cycle purifies water and distributes it across the planet. Scientists have long studied it to understand floods, droughts, and the availability of fresh water. Without this natural circulation, life could not persist, for every cell depends on water to function. The water cycle reminds us that the drop on a leaf today may have fallen on an ancient sea millions of years ago."
  },
  {
    "id": "science_chemistry_periodic_table",
    "subject": "science",
    "topic": "Chemistry / Atomic Structure",
    "title": "The Periodic Table of the Elements",
    "author": "Dmitri Mendeleev (adapted, 1869)",
    "content": "When Dmitri Mendeleev arranged the known chemical elements by atomic weight, he noticed repeating patterns in their properties. By placing similar elements in columns, he created the first periodic table. Remarkably, he left gaps where no element was yet discovered but predicted their existence and characteristics. Later discoveries of gallium and germanium confirmed his predictions. The periodic law revealed that the behavior of matter depends on the structure of the atom. Today’s table, organized by atomic number, shows the regularity of nature from hydrogen to uranium. It guides chemists in understanding reactions, bonding, and materials, proving that even the vast diversity of substances follows an orderly design."
  },
  {
    "id": "science_biology_genetics_mendel",
    "subject": "science",
    "topic": "Genetics / Heredity",
    "title": "Gregor Mendel and the Laws of Heredity",
    "author": "Gregor Mendel (adapted, 1865)",
    "content": "In the garden of his monastery, Gregor Mendel bred pea plants with different traits—tall and short, green and yellow. He counted thousands of offspring and discovered predictable patterns in how traits were passed on. Mendel concluded that each trait is determined by 'factors'—now called genes—that occur in pairs. One factor can mask another, producing dominant and recessive forms. His laws of segregation and independent assortment explained inheritance mathematically. Mendel’s work went unnoticed for decades until rediscovered around 1900, becoming the foundation of modern genetics. From peas to people, his insights revealed that heredity obeys precise rules, linking biology with probability and laying the path for discoveries of DNA."
  },
  {
    "id": "science_astronomy_big_bang",
    "subject": "science",
    "topic": "Astronomy / Cosmology",
    "title": "The Expanding Universe",
    "author": "Edwin Hubble (adapted, 1929)",
    "content": "Using the great telescopes of Mount Wilson Observatory, Edwin Hubble measured the distances and motions of galaxies. He found that nearly all are moving away from us, and that the farther a galaxy is, the faster it recedes. This relationship, known as Hubble’s Law, showed that the universe is expanding. Tracing this motion backward suggests that all matter once occupied a single, dense state—the beginning we now call the Big Bang. The discovery ended the belief in a static cosmos and opened new questions about time, space, and destiny. Modern astronomy continues to refine Hubble’s work, measuring cosmic background radiation and the mysterious forces of dark matter and dark energy. Yet the essential insight remains: the universe itself is in motion."
  },
  {
    "id": "science_environment_conservation",
    "subject": "science",
    "topic": "Environmental Science / Conservation",
    "title": "Preserving the Natural World",
    "author": "Gifford Pinchot & Theodore Roosevelt (public domain writings, adapted)",
    "content": "At the turn of the twentieth century, vast forests and wildlife in America were disappearing under unregulated industry. Gifford Pinchot, first chief of the U.S. Forest Service, and President Theodore Roosevelt urged conservation—the wise use of natural resources for the greatest good. They argued that soil, water, and timber should be managed scientifically to prevent waste. Their efforts established national parks and forests, setting aside millions of acres for future generations. Conservation combined science and citizenship, teaching that humanity is part of nature, not apart from it. Today, that message endures in the global movement to protect biodiversity and sustain the planet on which all life depends."
  }
]
[
  {
    "title": "The Declaration of Independence (1776)",
    "label": "Historical Document",
    "passage": "When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature’s God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. To secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed..."
  },
  {
    "title": "Gettysburg Address by Abraham Lincoln (1863)",
    "label": "Civic Literacy",
    "passage": "Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal. Now we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battlefield of that war. We have come to dedicate a portion of that field as a final resting place for those who here gave their lives that that nation might live..."
  },
  {
    "title": "The Preamble to the U.S. Constitution (1787)",
    "label": "Civic Structure",
    "passage": "We the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America. The framers sought to create a balance between liberty and order by dividing governmental power among three branches: legislative, executive, and judicial..."
  },
  {
    "title": "The Emancipation Proclamation (1863)",
    "label": "Historical Document",
    "passage": "By the President of the United States of America: A Proclamation. Whereas, on the twenty-second day of September, in the year of our Lord one thousand eight hundred and sixty-two, a proclamation was issued declaring that on the first day of January all persons held as slaves within any State or designated part of a State, the people whereof shall then be in rebellion against the United States, shall be then, thenceforward, and forever free..."
  },
  {
    "title": "Letter from Abigail Adams to John Adams (1776)",
    "label": "Primary Source",
    "passage": "I long to hear that you have declared an independency. And, by the way, in the new Code of Laws which I suppose it will be necessary for you to make, I desire you would remember the ladies and be more generous and favorable to them than your ancestors. Do not put such unlimited power into the hands of the husbands..."
  },
  {
    "title": "George Washington’s Farewell Address (1796)",
    "label": "Civic Literacy",
    "passage": "The unity of government which constitutes you one people is also now dear to you. It is justly so; for it is a main pillar in the edifice of your real independence, the support of your tranquillity at home, your peace abroad; of your safety; of your prosperity; of that very liberty which you so highly prize..."
  },
  {
    "title": "Frederick Douglass: What to the Slave is the Fourth of July? (1852)",
    "label": "Social Justice",
    "passage": "What, to the American slave, is your Fourth of July? I answer; a day that reveals to him, more than all other days in the year, the gross injustice and cruelty to which he is the constant victim. To him, your celebration is a sham; your boasted liberty, an unholy license; your national greatness, swelling vanity..."
  },
  {
    "title": "The Federalist Papers No. 10 by James Madison",
    "label": "Civic Structure",
    "passage": "Among the numerous advantages promised by a well-constructed Union, none deserves to be more accurately developed than its tendency to break and control the violence of faction. The friend of popular governments never finds himself so much alarmed for their character and fate, as when he contemplates their propensity to this dangerous vice..."
  },
  {
    "title": "Sojourner Truth: Ain’t I a Woman? (1851)",
    "label": "Social Justice",
    "passage": "Well, children, where there is so much racket there must be something out of kilter. I think that 'twixt the negroes of the South and the women at the North, all talking about rights, the white men will be in a fix pretty soon. That man over there says that women need to be helped into carriages and lifted over ditches... Ain’t I a woman?"
  },
  {
    "title": "The Monroe Doctrine (1823)",
    "label": "Foreign Policy",
    "passage": "The American continents, by the free and independent condition which they have assumed and maintain, are henceforth not to be considered as subjects for future colonization by any European powers. We owe it, therefore, to candor and to the amicable relations existing between the United States and those powers to declare that we should consider any attempt on their part to extend their system to any portion of this hemisphere as dangerous to our peace and safety..."
  },
  {
    "title": "Speech to Congress on Indian Removal by Andrew Jackson (1830)",
    "label": "Government Policy",
    "passage": "It gives me pleasure to announce to Congress that the benevolent policy of the Government, steadily pursued for nearly thirty years, in relation to the removal of the Indians beyond the white settlements is approaching to a happy consummation. Two important tribes have accepted the provision made for their removal..."
  },
  {
    "title": "The Seneca Falls Declaration of Sentiments (1848)",
    "label": "Women’s Rights",
    "passage": "We hold these truths to be self-evident: that all men and women are created equal; that they are endowed by their Creator with certain inalienable rights... The history of mankind is a history of repeated injuries and usurpations on the part of man toward woman, having in direct object the establishment of an absolute tyranny over her..."
  },
  {
    "title": "Franklin D. Roosevelt’s First Inaugural Address (1933)",
    "label": "Economic History",
    "passage": "This great Nation will endure as it has endured, will revive and will prosper. So, first of all, let me assert my firm belief that the only thing we have to fear is fear itself—nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance..."
  },
  {
    "title": "The Four Freedoms Speech by FDR (1941)",
    "label": "World History",
    "passage": "In the future days, which we seek to make secure, we look forward to a world founded upon four essential human freedoms. The first is freedom of speech and expression—everywhere in the world. The second is freedom of every person to worship God in his own way. The third is freedom from want, and the fourth is freedom from fear..."
  },
  {
    "title": "John F. Kennedy’s Inaugural Address (1961)",
    "label": "Modern Civics",
    "passage": "Let every nation know, whether it wishes us well or ill, that we shall pay any price, bear any burden, meet any hardship, support any friend, oppose any foe to assure the survival and the success of liberty. This much we pledge—and more. Ask not what your country can do for you—ask what you can do for your country..."
  },
  {
    "title": "The Mayflower Compact (1620)",
    "label": "Colonial History",
    "passage": "In the name of God, Amen. We whose names are underwritten, the loyal subjects of our dread sovereign Lord King James... having undertaken for the glory of God, and advancement of the Christian faith, and the honor of our King and Country, a voyage to plant the first colony in the northern parts of Virginia, do by these presents solemnly and mutually covenant and combine ourselves together into a civil body politic..."
  },
  {
    "title": "Thomas Paine: Common Sense (1776)",
    "label": "Political Philosophy",
    "passage": "Society in every state is a blessing, but government even in its best state is but a necessary evil; in its worst state an intolerable one... The sun never shined on a cause of greater worth. 'Tis not the affair of a city, a county, a province, or a kingdom; but of a continent..."
  },
  {
    "title": "Booker T. Washington: Atlanta Compromise Address (1895)",
    "label": "Social Progress",
    "passage": "To those of the white race who look to the incoming of those of foreign birth and strange tongue and habits for the prosperity of the South, were I permitted, I would repeat what I say to my own race, 'Cast down your bucket where you are.' Cast it down among the eight millions of Negroes whose habits you know..."
  },
  {
    "title": "Martin Luther King Jr.: I Have a Dream (1963)",
    "label": "Civil Rights",
    "passage": "I have a dream that one day this nation will rise up and live out the true meaning of its creed: 'We hold these truths to be self-evident, that all men are created equal.' I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character..."
  },
  {
    "title": "The Universal Declaration of Human Rights (1948)",
    "label": "Global Civics",
    "passage": "Whereas recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice, and peace in the world... Everyone is entitled to all the rights and freedoms set forth in this Declaration, without distinction of any kind..."
  }
]
[
  {
    "title": "Magna Carta (1215)",
    "label": "Historical Document",
    "passage": "John, by the grace of God King of England... Know that we, of our free will, have granted to all freemen of our realm these liberties following, to be kept by them and their heirs forever. No freeman shall be taken, or imprisoned, or disseised, or outlawed, or exiled, or any way destroyed; nor will we go upon him nor send upon him, but by lawful judgment of his peers or by the law of the land. To no one will we sell, to no one will we deny or delay, right or justice..."
  },
  {
    "title": "Adam Smith: The Wealth of Nations (1776)",
    "label": "Economics",
    "passage": "The annual labor of every nation is the fund which originally supplies it with all the necessaries and conveniences of life... It is not from the benevolence of the butcher, the brewer, or the baker that we expect our dinner, but from their regard to their own interest. Every individual neither intends to promote the public interest, nor knows how much he is promoting it; he intends only his own gain, and he is led by an invisible hand to promote an end which was no part of his intention..."
  },
  {
    "title": "The Homestead Act (1862)",
    "label": "U.S. History",
    "passage": "An Act to secure homesteads to actual settlers on the public domain. Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, That any person who is the head of a family, or who has arrived at the age of twenty-one years, and is a citizen of the United States, shall, from and after the first day of January, eighteen hundred and sixty-three, be entitled to enter one quarter section, or a less quantity of unappropriated public lands..."
  },
  {
    "title": "Andrew Carnegie: The Gospel of Wealth (1889)",
    "label": "Economics",
    "passage": "This, then, is held to be the duty of the man of Wealth: to set an example of modest, unostentatious living, shunning display or extravagance; to provide moderately for the legitimate wants of those dependent upon him; and after doing so, to consider all surplus revenues which come to him simply as trust funds, which he is called upon to administer... The man who dies thus rich dies disgraced..."
  },
  {
    "title": "The Great Fire of London (1666)",
    "label": "Urban History",
    "passage": "It began in the house of one Farriner, a baker in Pudding Lane, and burned all down that way toward the bridge, and all Thames Street, and then the fire worked itself backward toward Cornhill, Cheapside, and St. Paul's... The streets were so full of goods and people, and the fire so hot, that no one could pass. Churches, public buildings, and thousands of homes perished; yet from this devastation came laws for rebuilding the city in brick and stone..."
  },
  {
    "title": "The Louisiana Purchase Treaty (1803)",
    "label": "Geography & Expansion",
    "passage": "The President of the United States and the First Consul of the French Republic, in the name of the French people, desiring to remove all source of misunderstanding relative to objects of discussion between the two countries, have agreed upon the following articles... The French Republic cedes to the United States, forever and in full sovereignty, the said territory, with all its rights and appurtenances..."
  },
  {
    "title": "The May 4th Movement Manifesto (1919, China)",
    "label": "World History",
    "passage": "China's territory may be conquered but it cannot be given away; China’s people may be massacred but they will not submit. We call upon our fellow students to rise up in national salvation. Our spirit of independence and our desire for liberty shall not perish. From this moment, the youth of China awaken to the need for science, democracy, and reform..."
  },
  {
    "title": "Susan B. Anthony’s Trial Statement (1873)",
    "label": "Women’s Rights",
    "passage": "Your denial of my citizen’s right to vote is the denial of my right of consent as one of the governed. I stand before you under indictment for the alleged crime of having voted at the last presidential election without having a lawful right to vote. It shall be my work, from this hour, to resist tyranny wherever I find it..."
  },
  {
    "title": "Chief Joseph’s Surrender Speech (1877)",
    "label": "Native American History",
    "passage": "I am tired of fighting. Our chiefs are killed; Looking Glass is dead, Ta Hool Hool Shute is dead. The old men are all dead. It is the young men who say yes or no. He who led on the young men is dead. It is cold and we have no blankets; the little children are freezing to death. Hear me, my chiefs! I am tired; my heart is sick and sad. From where the sun now stands I will fight no more forever..."
  },
  {
    "title": "The Atlantic Charter (1941)",
    "label": "World Civics",
    "passage": "The President of the United States and the Prime Minister of the United Kingdom have met and jointly declared certain common principles... They desire no aggrandizement, territorial or otherwise; they respect the right of all peoples to choose the form of government under which they will live; and they wish to see sovereign rights and self-government restored to those who have been forcibly deprived of them..."
  },
  {
    "title": "Woodrow Wilson: Fourteen Points (1918)",
    "label": "International Relations",
    "passage": "The world must be made safe for democracy. We have no selfish ends to serve. What we demand in this war is nothing peculiar to ourselves. We shall fight for the rights and liberties of small nations. Open covenants of peace, openly arrived at... Absolute freedom of navigation upon the seas, equality of trade conditions, and the removal of all economic barriers..."
  },
  {
    "title": "Harriet Beecher Stowe: Uncle Tom’s Cabin (1852, excerpt)",
    "label": "Abolition Movement",
    "passage": "The cabin stood just beyond the reach of the Mississippi floods. Uncle Tom was a man of humanity and faith; his cottage, though poor, was neat and full of warmth. Across the river lay plantations where men were bought and sold. Stowe’s words awakened the conscience of a nation and helped turn public sentiment against slavery..."
  },
  {
    "title": "The Truman Doctrine (1947)",
    "label": "Cold War Policy",
    "passage": "At the present moment in world history nearly every nation must choose between alternative ways of life. One way is based upon the will of the majority, distinguished by free institutions, representative government, free elections, guarantees of individual liberty. The second way is based upon the will of a minority forcibly imposed upon the majority. I believe it must be the policy of the United States to support free peoples who are resisting attempted subjugation..."
  },
  {
    "title": "Rachel Carson: Silent Spring (1962, opening)",
    "label": "Environmental Studies",
    "passage": "There was once a town in the heart of America where all life seemed to live in harmony with its surroundings. Then a strange blight crept over the area and everything began to change. The roadsides, once so attractive, were now lined with browned and withered vegetation. The birds, for example—where had they gone? This fable describes a true story: the reckless use of pesticides that threatened the balance of nature..."
  },
  {
    "title": "Nelson Mandela’s Rivonia Trial Speech (1964)",
    "label": "Global Justice",
    "passage": "During my lifetime I have dedicated myself to this struggle of the African people. I have fought against white domination, and I have fought against black domination. I have cherished the ideal of a democratic and free society in which all persons live together in harmony and with equal opportunities. It is an ideal for which I am prepared to die..."
  },
  {
    "title": "Dwight D. Eisenhower’s Farewell Address (1961)",
    "label": "Civic Literacy",
    "passage": "We must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military-industrial complex. The potential for the disastrous rise of misplaced power exists and will persist. We must never let the weight of this combination endanger our liberties or democratic processes..."
  },
  {
    "title": "The U.S. Bill of Rights (1791, excerpts)",
    "label": "Civic Principles",
    "passage": "Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof... The right of the people to keep and bear Arms shall not be infringed... The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated..."
  },
  {
    "title": "The United Nations Charter (1945, Preamble)",
    "label": "Global Civics",
    "passage": "We the peoples of the United Nations determined to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind, and to reaffirm faith in fundamental human rights, in the dignity and worth of the human person, and in the equal rights of men and women and of nations large and small..."
  },
  {
    "title": "The Marshall Plan (1948)",
    "label": "Economic History",
    "passage": "Our policy is directed not against any country or doctrine but against hunger, poverty, desperation, and chaos. Its purpose should be the revival of a working economy in the world so as to permit the emergence of political and social conditions in which free institutions can exist..."
  },
  {
    "title": "The Civil Rights Act of 1964 (excerpts)",
    "label": "Civil Rights",
    "passage": "An Act to enforce the constitutional right to vote, to confer jurisdiction upon the district courts of the United States... No person in the United States shall, on the ground of race, color, or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance..."
  }
]
[
  {
    "title": "Barack Obama: 2008 Victory Speech (Chicago, November 4, 2008)",
    "label": "Modern Civics",
    "passage": "If there is anyone out there who still doubts that America is a place where all things are possible, tonight is your answer. It’s the answer told by lines that stretched around schools and churches... by people who waited three hours and four hours, many for the first time in their lives, because they believed that this time must be different. Change has come to America. The road ahead will be long, our climb will be steep. But America, I have never been more hopeful than I am tonight that we will get there. I promise you—we as a people will get there."
  },
  {
    "title": "George W. Bush: Address to the Nation on September 11, 2001",
    "label": "National Crisis Response",
    "passage": "Good evening. Today, our fellow citizens, our way of life, our very freedom came under attack in a series of deliberate and deadly terrorist acts. Thousands of lives were suddenly ended by evil, despicable acts of terror. America was targeted because we’re the brightest beacon for freedom and opportunity in the world. Terrorist attacks can shake the foundations of our biggest buildings, but they cannot touch the foundation of America. These acts shattered steel, but they cannot dent the steel of American resolve."
  },
  {
    "title": "Donald J. Trump: Inaugural Address (January 20, 2017)",
    "label": "Political Rhetoric",
    "passage": "From this day forward, it’s going to be only America first. Every decision on trade, on taxes, on immigration, on foreign affairs will be made to benefit American workers and American families. We will seek friendship and goodwill with the nations of the world—but we do so with the understanding that it is the right of all nations to put their own interests first. We will shine for everyone to follow."
  },
  {
    "title": "Joe Biden: Inaugural Address (January 20, 2021)",
    "label": "Civic Unity",
    "passage": "This is America’s day. This is democracy’s day. A day of history and hope, of renewal and resolve. Through a crucible for the ages, America has been tested anew and America has risen to the challenge. Today we celebrate the triumph not of a candidate, but of a cause—the cause of democracy. We have learned again that democracy is precious. Democracy is fragile. And at this hour, my friends, democracy has prevailed."
  },
  {
    "title": "Hillary Clinton: Women’s Rights Are Human Rights (Beijing, 1995)",
    "label": "Global Civics",
    "passage": "If there is one message that echoes forth from this conference, let it be that human rights are women’s rights and women’s rights are human rights—once and for all. It is time to break the silence. It is time for the world to move beyond rhetoric and take concrete steps to protect and promote the rights of women everywhere."
  },
  {
    "title": "Colin Powell: U.N. Address on Iraq (February 2003)",
    "label": "Foreign Policy",
    "passage": "My colleagues, every statement I make today is backed up by sources, solid sources. These are not assertions. What we are giving you are facts and conclusions based on solid intelligence. The facts and Iraq’s behavior demonstrate that Saddam Hussein and his regime have made no effort to disarm as required by the international community. We must not shrink from whatever is ahead of us."
  },
  {
    "title": "Condoleezza Rice: Remarks on Democracy (2005)",
    "label": "International Relations",
    "passage": "For sixty years, my country, the United States, pursued stability at the expense of democracy in the Middle East—and we achieved neither. Now we are taking a different course. We are supporting the democratic aspirations of all people. Freedom and democracy are the most secure foundations for peace and human progress."
  },
  {
    "title": "Al Gore: Nobel Peace Prize Lecture (2007)",
    "label": "Environmental Policy",
    "passage": "We, the human species, are confronting a planetary emergency—a threat to the survival of our civilization that is gathering ominous and destructive potential. The earth has a fever, and the fever is rising. The climate crisis is not a political issue; it is a moral and spiritual challenge to all humanity."
  },
  {
    "title": "Malala Yousafzai: United Nations Youth Assembly (2013)",
    "label": "Global Justice",
    "passage": "One child, one teacher, one book, and one pen can change the world. Education is the only solution. Education first. Let us pick up our books and our pens; they are our most powerful weapons. Extremists are afraid of books and pens; the power of education frightens them."
  },
  {
    "title": "Nelson Mandela: Inaugural Address (1994)",
    "label": "World Leadership",
    "passage": "Today, all of us do, by our presence here, confer glory and hope to new liberty. The time for the healing of the wounds has come. We have, at last, achieved our political emancipation. The time to build is upon us. Let there be justice for all. Let there be peace for all. Never, never, and never again shall it be that this beautiful land will again experience the oppression of one by another."
  },
  {
    "title": "Pope Francis: Address to the U.S. Congress (2015)",
    "label": "Moral Leadership",
    "passage": "A nation can be considered great when it defends liberty as Lincoln did, when it fosters a culture that enables people to dream of full rights for all, as Martin Luther King sought to do, when it strives for justice for the oppressed as Dorothy Day did, and when it builds peace as Thomas Merton did. The challenges we face call for a renewal of that spirit of cooperation."
  },
  {
    "title": "Vladimir Putin: United Nations Address (2015)",
    "label": "Global Politics",
    "passage": "We all know that after the end of the Cold War a single center of domination emerged in the world. Those who thought they could reshape the world to suit their own interests have failed. Instead of democracy and progress, there has been aggression and coercion. We propose working together on the basis of equality and respect for international law."
  },
  {
    "title": "Xi Jinping: World Economic Forum (Davos, 2017)",
    "label": "Global Economics",
    "passage": "Whether you like it or not, the global economy is the big ocean that you cannot escape from. Any attempt to cut off the flow of capital, technologies, products, and people will simply not be possible. We should commit ourselves to growing an open global economy and share its benefits among all nations."
  },
  {
    "title": "Greta Thunberg: U.N. Climate Action Summit (2019)",
    "label": "Environmental Activism",
    "passage": "This is all wrong. I shouldn’t be up here; I should be back in school. You have stolen my dreams and my childhood with your empty words. People are suffering. People are dying. Entire ecosystems are collapsing. The eyes of all future generations are upon you. If you choose to fail us, we will never forgive you."
  },
  {
    "title": "Angela Merkel: European Unity Address (2020)",
    "label": "World Governance",
    "passage": "We must show that Europe can act jointly when confronted with great challenges. No nation, no matter how strong, can overcome a pandemic or climate change alone. Europe’s strength lies in its unity, in its commitment to democracy and human dignity. We will emerge stronger if we stand together."
  },
  {
    "title": "Jacinda Ardern: Christchurch Vigil Speech (2019)",
    "label": "Social Cohesion",
    "passage": "We represent a diverse range of faiths, ethnicities, and backgrounds. We are united in our grief, and we are united in our compassion. They are us. New Zealand mourns with you; we are one. We must reject hate, reject division, and speak for inclusion and kindness."
  },
  {
    "title": "Donald Trump: Address to the United Nations (2017)",
    "label": "Foreign Policy",
    "passage": "The United States will forever be a great friend to the world, and especially to its allies. But we will no longer enter into one-sided deals. We will defend our sovereignty and respect the sovereignty of others. We seek harmony and friendship, not conflict and strife, but we will always protect our nation’s interests above all."
  },
  {
    "title": "Barack Obama: Eulogy for John Lewis (2020)",
    "label": "Civil Rights Legacy",
    "passage": "John Lewis devoted his time on this earth to fighting the very same injustices that are still with us. He believed in us even when we didn’t believe in ourselves. He knew that non-violent protest could awaken a nation. If we want to honor him, then let’s revitalize the Voting Rights Act he was willing to die for. Let’s continue his march toward justice."
  },
  {
    "title": "Michelle Obama: 2016 DNC Speech",
    "label": "Civic Values",
    "passage": "When they go low, we go high. Our words and actions matter to our children. When we teach our daughters they can be anything in this country, that’s what moves America forward. I wake up every morning in a house built by slaves—and I watch my daughters, two beautiful, intelligent Black young women, playing with their dogs on the White House lawn. Because of those who fought and died and worked for a better life, this is America’s story."
  },
  {
    "title": "U.N. Secretary-General António Guterres: Climate Crisis Remarks (2021)",
    "label": "Global Cooperation",
    "passage": "We are on a code-red alert for humanity. The time for diplomacy is over; the time for action is now. Every country, city, financial institution, and company must plan to reach net-zero emissions by mid-century. The science is clear. The world’s future depends on our collective choice today."
  }
]
[
  {
    "title": "The Erie Canal and Westward Expansion (1825)",
    "label": "Geography & Infrastructure",
    "passage": "When the Erie Canal opened in 1825, it linked the Great Lakes with the Atlantic Ocean through the Hudson River. The 363-mile waterway transformed New York into a commercial powerhouse. Farmers in the Midwest could now send their crops to eastern markets faster and cheaper. Towns sprang up along the route, and commerce flourished. The canal’s success inspired other states to invest in public works and showed how geography and human ingenuity could unite regions into a single national economy."
  },
  {
    "title": "The Transcontinental Railroad (1869)",
    "label": "Economic Geography",
    "passage": "The completion of the Transcontinental Railroad at Promontory Summit, Utah, in 1869 symbolized the uniting of America. Before its completion, travel between the Atlantic and Pacific coasts could take months. With rail service, it took only a week. The railroad created new jobs, encouraged westward settlement, and increased trade. Yet it also displaced Native peoples and altered landscapes. Its story reminds us that economic growth often brings both opportunity and cost."
  },
  {
    "title": "The Dust Bowl (1930s)",
    "label": "Environmental Geography",
    "passage": "During the 1930s, severe drought and poor farming practices turned the Great Plains into a vast dust-covered wasteland. Winds carried soil hundreds of miles, darkening skies and destroying crops. Thousands of farm families migrated west, seeking work and relief. The Dust Bowl revealed how human activity and environmental neglect could combine to create disaster. In its aftermath, the government introduced soil conservation and sustainable farming programs that changed American agriculture."
  },
  {
    "title": "The Tennessee Valley Authority (1933)",
    "label": "Economic Development",
    "passage": "Created as part of Franklin D. Roosevelt’s New Deal, the Tennessee Valley Authority brought electricity, flood control, and jobs to one of the poorest regions in the United States. By building dams and hydroelectric plants, the TVA modernized the rural South, providing power for homes and industries. Critics argued it expanded federal power, but its long-term impact in transforming an entire region made it a landmark in planned economic development."
  },
  {
    "title": "The Panama Canal (1914)",
    "label": "World Geography",
    "passage": "The Panama Canal connected the Atlantic and Pacific Oceans, reducing travel distance for ships by thousands of miles. Built through jungles and mountains, the canal was one of the greatest engineering feats of its time. It changed world trade by allowing faster movement of goods and navies between oceans. It also represented the reach of U.S. influence in Latin America, blending geography, technology, and diplomacy."
  },
  {
    "title": "The New Deal and Economic Recovery (1930s)",
    "label": "Economic Policy",
    "passage": "In response to the Great Depression, President Roosevelt’s New Deal launched programs to provide relief, recovery, and reform. Agencies such as the WPA, CCC, and Social Security Administration created jobs, built infrastructure, and supported the elderly. The New Deal expanded the federal government’s role in the economy and redefined the relationship between citizens and their government, laying foundations for the modern welfare state."
  },
  {
    "title": "Bretton Woods Conference (1944)",
    "label": "Global Economics",
    "passage": "Representatives from forty-four nations met in Bretton Woods, New Hampshire, to establish a framework for postwar economic cooperation. The conference created the International Monetary Fund and the World Bank to promote stability and development. It anchored currencies to the U.S. dollar, fostering decades of trade growth. Though the system changed over time, Bretton Woods laid the foundation for today’s global financial order."
  },
  {
    "title": "The Marshall Islands and Rising Seas",
    "label": "Climate Geography",
    "passage": "The Marshall Islands, a Pacific nation of coral atolls, faces rising sea levels caused by global warming. Flooding threatens homes, freshwater supplies, and even national existence. Citizens have petitioned major nations to cut emissions and assist with adaptation. Their plight demonstrates the intersection of geography, climate, and international responsibility in the twenty-first century."
  },
  {
    "title": "The European Union Formation (1993)",
    "label": "Government Systems",
    "passage": "The Maastricht Treaty created the European Union, transforming a group of economic partners into a political and monetary union. Member states shared a common market, open borders, and eventually a single currency—the euro. The EU’s system of supranational governance was designed to prevent war in Europe through cooperation. Yet debates over sovereignty, migration, and inequality continue to test this bold experiment in shared government."
  },
  {
    "title": "The United Nations Sustainable Development Goals (2015)",
    "label": "Global Development",
    "passage": "In 2015, the United Nations adopted seventeen Sustainable Development Goals (SDGs) to end poverty, protect the planet, and ensure prosperity for all by 2030. The goals include quality education, gender equality, clean energy, and climate action. Each nation committed to measurable progress. The SDGs represent a global consensus that economic and social progress must respect environmental limits."
  },
  {
    "title": "The Great Migration (1916–1970)",
    "label": "Human Geography",
    "passage": "More than six million African Americans left the rural South for cities in the North and West, seeking jobs and freedom from racial oppression. This migration transformed American culture, politics, and demographics. Cities such as Chicago, Detroit, and New York gained new communities that shaped music, literature, and civil rights movements. The Great Migration reveals how geography and opportunity influence social change."
  },
  {
    "title": "NAFTA: North American Free Trade Agreement (1994)",
    "label": "Trade Policy",
    "passage": "NAFTA created a trilateral trade zone among the United States, Canada, and Mexico, eliminating most tariffs. Supporters claimed it would increase economic efficiency and lower consumer prices. Critics warned of job losses and weakened labor standards. The agreement reshaped industries and supply chains across North America, showing the benefits and controversies of globalization."
  },
  {
    "title": "OPEC and the Oil Crisis (1973)",
    "label": "Global Economics",
    "passage": "In 1973, members of the Organization of Petroleum Exporting Countries imposed an oil embargo on nations supporting Israel. Prices quadrupled, triggering inflation and recession in many Western countries. The crisis revealed how energy dependence could influence global politics and spurred investment in alternative energy and conservation."
  },
  {
    "title": "World Population Growth and Urbanization",
    "label": "Demographics",
    "passage": "In 1950, less than one-third of the world’s people lived in cities. By the 21st century, more than half did. Urbanization brings economic opportunity but also challenges—housing shortages, pollution, and strain on infrastructure. Cities from Lagos to Shanghai have become engines of growth and innovation, reflecting how geography and economics interact in shaping human settlement."
  },
  {
    "title": "Microfinance and Global Poverty",
    "label": "Economic Development",
    "passage": "Microfinance provides small loans to entrepreneurs in developing countries who lack access to traditional banks. Originating with initiatives such as the Grameen Bank in Bangladesh, microfinance empowers individuals—especially women—to start businesses and lift families out of poverty. Though not a cure-all, it has become a key tool in grassroots economic progress."
  },
  {
    "title": "Constitution of South Africa (1996)",
    "label": "Comparative Government",
    "passage": "Following the end of apartheid, South Africa adopted one of the world’s most progressive constitutions. It guarantees equality, dignity, and freedom of expression, and establishes institutions to protect human rights. The document symbolizes a transition from oppression to democracy, demonstrating how legal frameworks can promote national healing."
  },
  {
    "title": "Globalization and Technological Change",
    "label": "Economic Systems",
    "passage": "In the late twentieth and early twenty-first centuries, digital communication, container shipping, and instant financial transfers connected markets worldwide. Factories moved across borders, and information became as valuable as goods. Globalization increased wealth for many but also deepened inequality. Understanding it requires examining how economics, technology, and policy shape global interdependence."
  },
  {
    "title": "The World Trade Organization (1995)",
    "label": "Global Governance",
    "passage": "The WTO replaced the General Agreement on Tariffs and Trade to regulate international commerce. It provides a forum for negotiation, dispute resolution, and enforcement of trade rules. Supporters claim it promotes fairness and predictability; opponents argue it favors wealthy nations and corporations. The organization remains central to debates over globalization and economic justice."
  },
  {
    "title": "The Arctic and Resource Competition",
    "label": "Geopolitics & Environment",
    "passage": "As polar ice melts, new shipping lanes and oil fields emerge in the Arctic. Nations including the United States, Russia, and Canada assert territorial claims. The region has become a focal point for balancing environmental protection with economic interest. The Arctic exemplifies how geography and politics converge in the era of climate change."
  },
  {
    "title": "International Space Station (1998–Present)",
    "label": "Global Cooperation",
    "passage": "Orbiting Earth at 17,000 miles per hour, the International Space Station is a symbol of peaceful cooperation among nations. Built jointly by the United States, Russia, Europe, Japan, and Canada, it serves as a laboratory for science and engineering. Astronauts live and work together, showing that even amid earthly divisions, collaboration can extend beyond borders."
  }
]
Perfect — you want **only word problems**, not formula or abstract ones — realistic, contextual problems grounded in everyday GED-style scenarios (shopping, travel, work, data, measurement, etc.).

Here’s a clean, **40-item JSON set** — all genuine **Math Word Problems** (no isolated equations).
Each entry includes fields your platform can sort by: `subject`, `area`, `label`, `problem`, and `answer`.

```json
[
  {
    "id": "math_ratio_01",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Ratio and Proportion",
    "problem": "A classroom has 12 boys and 8 girls. What is the ratio of boys to girls in simplest form?",
    "answer": "3:2"
  },
  {
    "id": "math_percent_01",
    "subject": "math",
    "area": "Number Operations",
    "label": "Percent Discount",
    "problem": "A pair of shoes originally costs $60 and is on sale for 25% off. What is the sale price?",
    "answer": "$45"
  },
  {
    "id": "math_interest_01",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Simple Interest",
    "problem": "If $800 is invested at an annual rate of 5% for 4 years, how much total interest is earned?",
    "answer": "$160"
  },
  {
    "id": "math_distance_01",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Distance and Rate",
    "problem": "A car travels 300 miles in 5 hours at a constant speed. What is its average speed in miles per hour?",
    "answer": "60 miles per hour"
  },
  {
    "id": "math_money_01",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Unit Price",
    "problem": "If 6 bottles of water cost $4.20, what is the cost per bottle?",
    "answer": "$0.70 per bottle"
  },
  {
    "id": "math_geometry_01",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter",
    "problem": "A rectangular garden measures 20 feet long and 15 feet wide. What is the perimeter?",
    "answer": "70 feet"
  },
  {
    "id": "math_geometry_02",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Triangle",
    "problem": "A triangle has a base of 12 inches and a height of 8 inches. What is its area?",
    "answer": "48 square inches"
  },
  {
    "id": "math_time_01",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Elapsed Time",
    "problem": "A movie starts at 7:25 PM and ends at 9:05 PM. How long is the movie?",
    "answer": "1 hour 40 minutes"
  },
  {
    "id": "math_percent_02",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Percent Increase",
    "problem": "A worker’s hourly wage increases from $16 to $20. What is the percent increase?",
    "answer": "25%"
  },
  {
    "id": "math_algebra_01",
    "subject": "math",
    "area": "Algebraic Reasoning",
    "label": "Cost Equation",
    "problem": "A taxi company charges $3 plus $2 per mile. How much would a 6-mile trip cost?",
    "answer": "$15"
  },
  {
    "id": "math_ratio_02",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Cooking Ratio",
    "problem": "A recipe uses 2 cups of rice for every 3 cups of water. How much water is needed for 8 cups of rice?",
    "answer": "12 cups of water"
  },
  {
    "id": "math_geometry_03",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Box",
    "problem": "A shipping box measures 10 inches long, 6 inches wide, and 4 inches high. What is its volume?",
    "answer": "240 cubic inches"
  },
  {
    "id": "math_data_01",
    "subject": "math",
    "area": "Data Analysis",
    "label": "Average",
    "problem": "The scores on five tests are 70, 80, 85, 90, and 95. What is the average score?",
    "answer": "84"
  },
  {
    "id": "math_fractions_01",
    "subject": "math",
    "area": "Number Operations",
    "label": "Adding Fractions",
    "problem": "Maria ran 2/3 of a mile on Monday and 3/4 of a mile on Tuesday. How far did she run in total?",
    "answer": "1 5/12 miles"
  },
  {
    "id": "math_percent_03",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Tax and Total Cost",
    "problem": "A book costs $25 and the sales tax rate is 8%. What is the total cost of the book?",
    "answer": "$27"
  },
  {
    "id": "math_work_01",
    "subject": "math",
    "area": "Rates and Proportions",
    "label": "Work Rate",
    "problem": "It takes Alex 6 hours to paint a fence and Jordan 4 hours to paint it. How long will it take them together?",
    "answer": "2 hours 24 minutes"
  },
  {
    "id": "math_ratio_03",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Mixture Problem",
    "problem": "A juice mix uses 3 parts apple juice to 2 parts grape juice. How many cups of grape juice are needed for 15 cups of apple juice?",
    "answer": "10 cups of grape juice"
  },
  {
    "id": "math_geometry_04",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Circumference",
    "problem": "Find the circumference of a circular pond with a diameter of 20 meters. Use π = 3.14.",
    "answer": "62.8 meters"
  },
  {
    "id": "math_money_02",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Sales Commission",
    "problem": "A car salesperson earns a 6% commission on $12,000 in sales. How much does the salesperson earn?",
    "answer": "$720"
  },
  {
    "id": "math_time_02",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Travel Time",
    "problem": "A bus travels 180 miles at an average speed of 60 miles per hour. How long does the trip take?",
    "answer": "3 hours"
  },
  {
    "id": "math_geometry_05",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Painting Wall Area",
    "problem": "A wall is 12 feet wide and 8 feet tall. How many square feet must be painted?",
    "answer": "96 square feet"
  },
  {
    "id": "math_percent_04",
    "subject": "math",
    "area": "Number Operations",
    "label": "Markup",
    "problem": "A store buys a chair for $40 and sells it for $50. What is the percent markup?",
    "answer": "25%"
  },
  {
    "id": "math_algebra_02",
    "subject": "math",
    "area": "Algebraic Reasoning",
    "label": "Age Problem",
    "problem": "Sam is 5 years older than twice his sister’s age. If his sister is 7, how old is Sam?",
    "answer": "19 years old"
  },
  {
    "id": "math_geometry_06",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Flooring Area",
    "problem": "A kitchen floor is 10 feet long and 9 feet wide. How many square feet of tile are needed to cover it?",
    "answer": "90 square feet"
  },
  {
    "id": "math_fractions_02",
    "subject": "math",
    "area": "Number Operations",
    "label": "Subtracting Fractions",
    "problem": "A board is 5 1/2 feet long. If you cut off 2 3/4 feet, how much is left?",
    "answer": "2 3/4 feet"
  },
  {
    "id": "math_ratio_04",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Recipe Adjustment",
    "problem": "A recipe that serves 4 people uses 2 cups of flour. How much flour is needed to serve 10 people?",
    "answer": "5 cups of flour"
  },
  {
    "id": "math_money_03",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Budgeting",
    "problem": "If your monthly income is $2,400 and you spend $1,800, what percent of your income is saved?",
    "answer": "25%"
  },
  {
    "id": "math_percent_05",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Percent of a Whole",
    "problem": "In a survey of 200 people, 50 said they walk to work. What percent of people walk to work?",
    "answer": "25%"
  },
  {
    "id": "math_geometry_07",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of a Yard",
    "problem": "A rectangular yard is 30 meters long and 18 meters wide. How much fencing is needed to go around it?",
    "answer": "96 meters"
  },
  {
    "id": "math_work_02",
    "subject": "math",
    "area": "Rates and Proportions",
    "label": "Work Completion",
    "problem": "If a plumber can install 6 sinks in 3 hours, how many can he install in 8 hours at the same rate?",
    "answer": "16 sinks"
  },
  {
    "id": "math_percent_06",
    "subject": "math",
    "area": "Number Operations",
    "label": "Gratuity",
    "problem": "A restaurant bill is $48, and the customer leaves a 15% tip. How much is the tip?",
    "answer": "$7.20"
  },
  {
    "id": "math_geometry_08",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Circle",
    "problem": "A circular garden has a radius of 7 feet. What is its area? (Use π = 3.14)",
    "answer": "153.86 square feet"
  },
  {
    "id": "math_money_04",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Earnings",
    "problem": "If an employee earns $15.50 per hour and works 35 hours per week, how much is earned in one week?",
    "answer": "$542.50"
  },
  {
    "id": "math_ratio_05",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Scale Drawing",
    "problem": "On a map, 1 inch represents 20 miles. How many miles are represented by 3.5 inches?",
    "answer": "70 miles"
  },
  {
    "id": "math_time_03",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Hourly Pay",
    "problem": "Maya earns $18 per hour and works 7.5 hours a day. How much does she earn in one day?",
    "answer": "$135"
  },
  {
    "id": "math_geometry_09",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Carpentry",
    "problem": "A carpenter needs to cut a board into 5 equal pieces from a 12-foot board. How long is each piece?",
    "answer": "2.4 feet"
  },
  {
    "id": "math_money_05",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Bank Withdrawal",
    "problem": "If you start with $500 in a bank account and withdraw $125 each week, how much will remain after 3 weeks?",
    "answer": "$125"
  },
  {
    "id": "math_geometry_10",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Land Area",
    "problem": "A rectangular plot of land is 60 yards by 40 yards. What is the area of the land?",
    "answer": "2,400 square yards"
  },
  {
    "id": "math_percent_07",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Loan Interest",
    "problem": "If $2,000 is borrowed for 2 years at 6% simple interest, how much interest will be owed?",
    "answer": "$240"
  },
  {
    "id": "math_money_06",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Budget Allocation",
    "problem": "A family spends 35% of its $3,200 monthly income on rent. How much do they spend on rent?",
    "answer": "$1,120"
  },
  {
    "id": "math_ratio_06",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Cooking Conversion",
    "problem": "A recipe calls for 3 teaspoons of salt for 12 servings. How much salt is needed for 8 servings?",
    "answer": "2 teaspoons"
  }
]
```

[
  {
    "id": "math_percent_08",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Salary Raise",
    "problem": "Tanya earned $2,800 a month last year. Her new salary includes a 10% raise. What is her new monthly salary?",
    "answer": "$3,080"
  },
  {
    "id": "math_distance_02",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Travel Speed",
    "problem": "A cyclist travels 54 miles in 3 hours. What is the average speed in miles per hour?",
    "answer": "18 miles per hour"
  },
  {
    "id": "math_geometry_11",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of a Field",
    "problem": "A rectangular field measures 200 meters by 150 meters. What is its perimeter?",
    "answer": "700 meters"
  },
  {
    "id": "math_money_07",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Shopping Budget",
    "problem": "If Jasmine spends $45 on groceries, $25 on gas, and $30 on clothes, what percent of her $200 budget did she spend?",
    "answer": "50%"
  },
  {
    "id": "math_ratio_07",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Mixing Paint",
    "problem": "To create a certain shade, paint must be mixed in a 5:3 ratio of blue to white. If 20 liters of blue paint are used, how many liters of white paint are needed?",
    "answer": "12 liters"
  },
  {
    "id": "math_geometry_12",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Parallelogram",
    "problem": "A parallelogram has a base of 10 inches and a height of 7 inches. What is its area?",
    "answer": "70 square inches"
  },
  {
    "id": "math_percent_09",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Population Growth",
    "problem": "A town’s population was 12,000 and increased by 15% in one year. What is the new population?",
    "answer": "13,800"
  },
  {
    "id": "math_time_04",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Time and Distance",
    "problem": "A train travels 180 miles in 3 hours. How long will it take to travel 300 miles at the same speed?",
    "answer": "5 hours"
  },
  {
    "id": "math_money_08",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Meal Cost",
    "problem": "A meal costs $24, and the tip is 18%. What is the total cost of the meal?",
    "answer": "$28.32"
  },
  {
    "id": "math_geometry_13",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Surface Area of Cylinder",
    "problem": "Find the surface area of a closed cylinder with radius 4 cm and height 10 cm. Use π = 3.14.",
    "answer": "351.68 square cm"
  },
  {
    "id": "math_ratio_08",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Proportional Travel",
    "problem": "If 4 gallons of gas allow a car to travel 120 miles, how far can the car travel with 10 gallons?",
    "answer": "300 miles"
  },
  {
    "id": "math_percent_10",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Tax Deduction",
    "problem": "A phone costs $600 and is discounted by 15%. What is the discounted price?",
    "answer": "$510"
  },
  {
    "id": "math_geometry_14",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Diagonal of Rectangle",
    "problem": "A rectangular TV screen measures 16 inches high and 12 inches wide. Find the diagonal length.",
    "answer": "20 inches"
  },
  {
    "id": "math_money_09",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Commission",
    "problem": "A real estate agent earns 4% commission on a $250,000 sale. How much commission does the agent earn?",
    "answer": "$10,000"
  },
  {
    "id": "math_ratio_09",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Cooking Conversion",
    "problem": "A recipe uses 3 tablespoons of sugar for every 2 cups of flour. How many tablespoons are needed for 10 cups of flour?",
    "answer": "15 tablespoons"
  },
  {
    "id": "math_percent_11",
    "subject": "math",
    "area": "Number Operations",
    "label": "Test Score",
    "problem": "A student answered 42 out of 50 questions correctly. What percent did the student get right?",
    "answer": "84%"
  },
  {
    "id": "math_geometry_15",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Triangle",
    "problem": "A triangle has sides of 8 cm, 10 cm, and 12 cm. What is its perimeter?",
    "answer": "30 cm"
  },
  {
    "id": "math_work_03",
    "subject": "math",
    "area": "Rates and Proportions",
    "label": "Work Rate",
    "problem": "A printing press can print 2,000 pages in 4 hours. How many pages can it print in 10 hours?",
    "answer": "5,000 pages"
  },
  {
    "id": "math_geometry_16",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Cylinder",
    "problem": "A cylindrical can has a radius of 3 cm and a height of 10 cm. What is the volume? (Use π = 3.14)",
    "answer": "282.6 cubic cm"
  },
  {
    "id": "math_money_10",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Budget Balance",
    "problem": "Carlos earned $2,100 and spent $1,750. What percent of his income did he save?",
    "answer": "16.7%"
  },
  {
    "id": "math_geometry_17",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area Comparison",
    "problem": "A rectangle has an area of 36 square feet. If its length is 9 feet, what is its width?",
    "answer": "4 feet"
  },
  {
    "id": "math_ratio_10",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Cooking Scale-Up",
    "problem": "A recipe for 8 cookies requires 2 cups of flour. How much flour is needed for 20 cookies?",
    "answer": "5 cups of flour"
  },
  {
    "id": "math_money_11",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Monthly Expenses",
    "problem": "Rent is $900, groceries $250, and utilities $150. What percent of a $1,800 income do these expenses represent?",
    "answer": "72%"
  },
  {
    "id": "math_percent_12",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Tip Calculation",
    "problem": "A dinner costs $46. If the customer leaves a 20% tip, what is the total bill?",
    "answer": "$55.20"
  },
  {
    "id": "math_geometry_18",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Tile Problem",
    "problem": "Each square tile covers 1 square foot. How many tiles are needed to cover a floor that is 12 feet by 9 feet?",
    "answer": "108 tiles"
  },
  {
    "id": "math_ratio_11",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Fuel Efficiency",
    "problem": "A car travels 360 miles using 12 gallons of fuel. How many miles can it travel on 8 gallons?",
    "answer": "240 miles"
  },
  {
    "id": "math_money_12",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Utility Bill",
    "problem": "A water bill includes a base charge of $20 plus $2 per 100 gallons. If 1,200 gallons are used, what is the total bill?",
    "answer": "$44"
  },
  {
    "id": "math_geometry_19",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Garden Perimeter",
    "problem": "A rectangular garden is 14 meters by 9 meters. How many meters of fencing are needed to enclose it?",
    "answer": "46 meters"
  },
  {
    "id": "math_percent_13",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Price Markup",
    "problem": "A store buys an item for $80 and sells it for $100. What is the percent markup?",
    "answer": "25%"
  },
  {
    "id": "math_geometry_20",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Land Plot Area",
    "problem": "A rectangular plot of land is 75 meters long and 50 meters wide. What is its area?",
    "answer": "3,750 square meters"
  },
  {
    "id": "math_ratio_12",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Recipe Scale",
    "problem": "A soup recipe calls for 4 cups of broth to serve 6 people. How much broth is needed for 15 people?",
    "answer": "10 cups of broth"
  },
  {
    "id": "math_money_13",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Car Loan",
    "problem": "A car loan of $12,000 has to be repaid over 4 years with equal yearly payments. How much is paid each year before interest?",
    "answer": "$3,000 per year"
  },
  {
    "id": "math_percent_14",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Percent Error",
    "problem": "A predicted rainfall was 2 inches, but 2.4 inches actually fell. What is the percent error?",
    "answer": "20%"
  },
  {
    "id": "math_time_05",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Trip Duration",
    "problem": "A bus leaves at 10:20 AM and arrives at 1:50 PM. How long was the trip?",
    "answer": "3 hours 30 minutes"
  },
  {
    "id": "math_money_14",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Weekly Income",
    "problem": "A worker earns $16.50 an hour and works 40 hours per week. What is the weekly income?",
    "answer": "$660"
  },
  {
    "id": "math_geometry_21",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Fence Cost",
    "problem": "A rectangular yard is 20 meters by 15 meters. If fencing costs $10 per meter, what is the total cost?",
    "answer": "$700"
  },
  {
    "id": "math_ratio_13",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Carpentry Mix",
    "problem": "To make concrete, 5 parts of sand are mixed with 2 parts of cement. How many parts of sand are needed for 14 parts of cement?",
    "answer": "35 parts of sand"
  },
  {
    "id": "math_percent_15",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Savings Interest",
    "problem": "If $1,500 earns 4% interest each year, how much interest is earned after 2 years?",
    "answer": "$120"
  },
  {
    "id": "math_geometry_22",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Parking Lot Area",
    "problem": "A parking lot is 50 yards long and 40 yards wide. What is its area?",
    "answer": "2,000 square yards"
  },
  {
    "id": "math_money_15",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Savings Plan",
    "problem": "If you save $120 each month, how much will you have saved after 18 months?",
    "answer": "$2,160"
  },
  {
    "id": "math_time_06",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Cooking Time",
    "problem": "A roast needs to cook for 25 minutes per pound. How long should you cook a 6-pound roast?",
    "answer": "150 minutes or 2 hours 30 minutes"
  }
]
[
  {
    "id": "math_percent_16",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Sales Tax",
    "problem": "A computer costs $850 and the sales tax rate is 7%. What is the total cost of the computer?",
    "answer": "$909.50"
  },
  {
    "id": "math_ratio_14",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Fuel Efficiency",
    "problem": "A car travels 390 miles using 13 gallons of gas. How many miles per gallon does it get?",
    "answer": "30 miles per gallon"
  },
  {
    "id": "math_geometry_23",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Rectangle",
    "problem": "A rug is 12 feet long and 9 feet wide. What is its area?",
    "answer": "108 square feet"
  },
  {
    "id": "math_money_16",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Pay Raise",
    "problem": "Carlos earned $18 per hour last year. This year he earns $19.80 per hour. What is the percent increase in his hourly rate?",
    "answer": "10%"
  },
  {
    "id": "math_ratio_15",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Scale Drawing",
    "problem": "On a map, 1 inch represents 25 miles. If two cities are 3.5 inches apart, how far apart are they in real distance?",
    "answer": "87.5 miles"
  },
  {
    "id": "math_geometry_24",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Square",
    "problem": "A square has sides 14 centimeters long. What is its perimeter?",
    "answer": "56 centimeters"
  },
  {
    "id": "math_percent_17",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Percent Decrease",
    "problem": "A store reduces the price of a jacket from $120 to $96. What is the percent decrease?",
    "answer": "20%"
  },
  {
    "id": "math_money_17",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Hourly Pay",
    "problem": "Maya works 37 hours a week at $14.75 per hour. How much does she earn per week?",
    "answer": "$545.75"
  },
  {
    "id": "math_geometry_25",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Rectangular Prism",
    "problem": "A storage box measures 15 inches long, 10 inches wide, and 8 inches high. What is its volume?",
    "answer": "1,200 cubic inches"
  },
  {
    "id": "math_time_07",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Travel Time",
    "problem": "A car travels 240 miles at 60 miles per hour. How long does the trip take?",
    "answer": "4 hours"
  },
  {
    "id": "math_money_18",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Commission Earnings",
    "problem": "A salesperson earns a 5% commission on $8,400 in sales. How much commission is earned?",
    "answer": "$420"
  },
  {
    "id": "math_percent_18",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Percent of Quantity",
    "problem": "What is 35% of 240?",
    "answer": "84"
  },
  {
    "id": "math_geometry_26",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Circumference",
    "problem": "Find the circumference of a circle with a diameter of 9 inches. Use π = 3.14.",
    "answer": "28.26 inches"
  },
  {
    "id": "math_ratio_16",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Cooking Ratio",
    "problem": "A recipe uses 4 cups of flour for every 3 cups of sugar. How many cups of sugar are needed for 12 cups of flour?",
    "answer": "9 cups of sugar"
  },
  {
    "id": "math_geometry_27",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Triangle Perimeter",
    "problem": "A triangle has sides measuring 7 cm, 8 cm, and 9 cm. What is its perimeter?",
    "answer": "24 cm"
  },
  {
    "id": "math_money_19",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Weekly Salary",
    "problem": "An employee earns $725 per week and receives a 4% raise. What is the new weekly salary?",
    "answer": "$754"
  },
  {
    "id": "math_percent_19",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Discounted Item",
    "problem": "A bicycle is originally priced at $320 and is discounted by 15%. What is the sale price?",
    "answer": "$272"
  },
  {
    "id": "math_geometry_28",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Trapezoid",
    "problem": "A trapezoid has bases 10 cm and 14 cm and a height of 6 cm. Find its area.",
    "answer": "72 square cm"
  },
  {
    "id": "math_time_08",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Elapsed Time",
    "problem": "A train departs at 9:15 AM and arrives at 2:45 PM. How long is the trip?",
    "answer": "5 hours 30 minutes"
  },
  {
    "id": "math_money_20",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Budget",
    "problem": "Angela earns $2,600 monthly. She spends $975 on rent, $250 on food, and $375 on other expenses. How much money does she have left?",
    "answer": "$1,000"
  }
]
[
  {
    "id": "math_geometry_29",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Circle",
    "problem": "A circular pool has a radius of 10 feet. What is its area? Use π = 3.14.",
    "answer": "314 square feet"
  },
  {
    "id": "math_percent_20",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Population Change",
    "problem": "A town’s population of 8,000 increases by 12% in one year. What is the new population?",
    "answer": "8,960"
  },
  {
    "id": "math_money_21",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Tip Calculation",
    "problem": "A restaurant bill is $52. If a 15% tip is added, what is the total cost?",
    "answer": "$59.80"
  },
  {
    "id": "math_ratio_17",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Map Scale",
    "problem": "On a map, 2 centimeters represent 50 kilometers. How many kilometers do 7 centimeters represent?",
    "answer": "175 kilometers"
  },
  {
    "id": "math_geometry_30",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Rectangle",
    "problem": "A rectangle measures 18 meters long and 12 meters wide. What is its perimeter?",
    "answer": "60 meters"
  },
  {
    "id": "math_money_22",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Overtime Pay",
    "problem": "Mason earns $20 per hour for the first 40 hours and time-and-a-half after that. If he works 45 hours, what is his total pay?",
    "answer": "$950"
  },
  {
    "id": "math_percent_21",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Sales Discount",
    "problem": "A television originally costs $600 and is on sale for 25% off. What is the sale price?",
    "answer": "$450"
  },
  {
    "id": "math_geometry_31",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Cube",
    "problem": "A cube has edges of 5 inches. What is its volume?",
    "answer": "125 cubic inches"
  },
  {
    "id": "math_time_09",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Work Duration",
    "problem": "If a job takes 8 hours to complete and two workers share it equally, how long will each need to work?",
    "answer": "4 hours each"
  },
  {
    "id": "math_money_23",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Simple Interest",
    "problem": "If $900 is invested at 6% simple interest for 3 years, how much interest is earned?",
    "answer": "$162"
  },
  {
    "id": "math_ratio_18",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Recipe Adjustment",
    "problem": "A recipe makes 8 servings with 4 cups of milk. How much milk is needed for 12 servings?",
    "answer": "6 cups of milk"
  },
  {
    "id": "math_geometry_32",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Surface Area of Box",
    "problem": "Find the surface area of a box that is 6 inches long, 4 inches wide, and 2 inches tall.",
    "answer": "88 square inches"
  },
  {
    "id": "math_percent_22",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Price Increase",
    "problem": "A bus fare increased from $1.25 to $1.50. What is the percent increase?",
    "answer": "20%"
  },
  {
    "id": "math_money_24",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Annual Salary",
    "problem": "If an employee earns $950 per week, what is the approximate annual salary?",
    "answer": "$49,400"
  },
  {
    "id": "math_geometry_33",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Triangle",
    "problem": "A triangle has sides 6 cm, 10 cm, and 8 cm long. What is its perimeter?",
    "answer": "24 cm"
  },
  {
    "id": "math_ratio_19",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Fuel Ratio",
    "problem": "A car travels 150 miles on 5 gallons of gas. How many gallons are needed to travel 420 miles?",
    "answer": "14 gallons"
  },
  {
    "id": "math_geometry_34",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Garden Fence",
    "problem": "A rectangular garden is 25 feet long and 15 feet wide. How many feet of fencing are needed to go around it?",
    "answer": "80 feet"
  },
  {
    "id": "math_percent_23",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Tax Refund",
    "problem": "If a person earns $40,000 and pays $4,800 in taxes, what percent of income is paid in taxes?",
    "answer": "12%"
  },
  {
    "id": "math_money_25",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Rent Increase",
    "problem": "Rent for an apartment was $1,200 per month and increased by 8%. What is the new rent?",
    "answer": "$1,296"
  },
  {
    "id": "math_geometry_35",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Floor Area",
    "problem": "A rectangular room is 16 feet long and 12 feet wide. How much carpet is needed to cover the floor?",
    "answer": "192 square feet"
  }
]
[
  {
    "id": "math_ratio_20",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Cooking Ratio",
    "problem": "A recipe uses 3 cups of flour for every 5 cups of sugar. How many cups of sugar are needed for 9 cups of flour?",
    "answer": "15 cups of sugar"
  },
  {
    "id": "math_money_26",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Savings",
    "problem": "Emma saves $75 every week. How much will she save in 10 weeks?",
    "answer": "$750"
  },
  {
    "id": "math_geometry_36",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Square",
    "problem": "Each side of a square park measures 25 meters. What is the perimeter?",
    "answer": "100 meters"
  },
  {
    "id": "math_percent_24",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Loan Interest",
    "problem": "A $2,500 loan earns 5% simple interest per year. How much interest will it earn after 4 years?",
    "answer": "$500"
  },
  {
    "id": "math_geometry_37",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Cylinder",
    "problem": "Find the volume of a cylinder with radius 7 cm and height 10 cm. Use π = 3.14.",
    "answer": "1,538.6 cubic cm"
  },
  {
    "id": "math_money_27",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Utility Bill",
    "problem": "A customer pays a $35 base charge and $0.12 per kilowatt-hour for 300 kWh. What is the total bill?",
    "answer": "$71"
  },
  {
    "id": "math_ratio_21",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Fuel Ratio",
    "problem": "A motorcycle uses 2 gallons of gas to travel 90 miles. How many miles can it travel with 8 gallons?",
    "answer": "360 miles"
  },
  {
    "id": "math_geometry_38",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Triangle",
    "problem": "A triangle has a base of 20 feet and a height of 12 feet. What is its area?",
    "answer": "120 square feet"
  },
  {
    "id": "math_money_28",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Grocery Cost",
    "problem": "A bag of apples costs $3.20 per pound. How much do 4.5 pounds of apples cost?",
    "answer": "$14.40"
  },
  {
    "id": "math_percent_25",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Percent Increase",
    "problem": "A book’s price rises from $12 to $15. What is the percent increase?",
    "answer": "25%"
  },
  {
    "id": "math_geometry_39",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Garden Area",
    "problem": "A rectangular garden measures 24 feet by 10 feet. What is its area?",
    "answer": "240 square feet"
  },
  {
    "id": "math_ratio_22",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Mixing Solution",
    "problem": "A cleaning solution is mixed in a ratio of 2 parts soap to 5 parts water. How much soap is needed for 35 parts of water?",
    "answer": "14 parts soap"
  },
  {
    "id": "math_money_29",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Tip and Total",
    "problem": "A restaurant bill is $84 and the customer leaves a 20% tip. What is the total cost?",
    "answer": "$100.80"
  },
  {
    "id": "math_geometry_40",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Parallelogram",
    "problem": "A parallelogram has a base of 15 cm and a height of 8 cm. What is its area?",
    "answer": "120 square cm"
  },
  {
    "id": "math_time_10",
    "subject": "math",
    "area": "Measurement and Units",
    "label": "Commute Time",
    "problem": "If it takes 25 minutes to travel 15 miles, how long will it take to travel 36 miles at the same speed?",
    "answer": "60 minutes"
  },
  {
    "id": "math_money_30",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Monthly Expenses",
    "problem": "Jordan earns $3,000 per month and spends $2,250. What percent of income is spent?",
    "answer": "75%"
  },
  {
    "id": "math_ratio_23",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Scale Model",
    "problem": "A model train is built to a scale of 1 inch to 4 feet. How long is the model if the actual train is 60 feet long?",
    "answer": "15 inches"
  },
  {
    "id": "math_geometry_41",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Circumference",
    "problem": "Find the circumference of a circle with radius 6 cm. Use π = 3.14.",
    "answer": "37.68 cm"
  },
  {
    "id": "math_money_31",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Salary and Bonus",
    "problem": "An employee earns $2,800 monthly plus a $600 annual bonus. What is the total annual income?",
    "answer": "$34,200"
  },
  {
    "id": "math_geometry_42",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Land Area",
    "problem": "A farmer’s field is 120 meters long and 80 meters wide. What is the total area?",
    "answer": "9,600 square meters"
  }
]
[
  {
    "id": "math_money_32",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Loan Payment",
    "problem": "A $4,800 loan is to be repaid in 12 equal monthly payments. How much is each payment before interest?",
    "answer": "$400"
  },
  {
    "id": "math_ratio_24",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Mixture Problem",
    "problem": "A punch recipe calls for 2 liters of juice for every 3 liters of soda. How much soda is needed for 8 liters of juice?",
    "answer": "12 liters of soda"
  },
  {
    "id": "math_geometry_43",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Rectangle",
    "problem": "A window is 4 feet wide and 5 feet tall. What is the area of the window?",
    "answer": "20 square feet"
  },
  {
    "id": "math_percent_26",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Price Reduction",
    "problem": "A jacket originally costs $90 and is reduced by 30%. What is the new price?",
    "answer": "$63"
  },
  {
    "id": "math_money_33",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Wages and Overtime",
    "problem": "Emily earns $16 per hour for 40 hours and $24 per hour for 5 hours of overtime. What is her total weekly pay?",
    "answer": "$760 + $120 = $880"
  },
  {
    "id": "math_geometry_44",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Cube",
    "problem": "Find the volume of a cube with side length 9 cm.",
    "answer": "729 cubic cm"
  },
  {
    "id": "math_ratio_25",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Speed Ratio",
    "problem": "A train travels 120 miles in 2 hours. How far will it travel in 5 hours at the same speed?",
    "answer": "300 miles"
  },
  {
    "id": "math_geometry_45",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Surface Area of Cube",
    "problem": "A cube has sides of 8 cm. What is its surface area?",
    "answer": "384 square cm"
  },
  {
    "id": "math_percent_27",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Pay Raise",
    "problem": "Marcus earns $20 per hour and receives a 5% raise. What is his new hourly rate?",
    "answer": "$21"
  },
  {
    "id": "math_money_34",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Monthly Savings",
    "problem": "If Sarah saves $150 a month, how much will she save in 2 years?",
    "answer": "$3,600"
  },
  {
    "id": "math_geometry_46",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Polygon",
    "problem": "A pentagon has equal sides of 9 meters each. What is its perimeter?",
    "answer": "45 meters"
  },
  {
    "id": "math_ratio_26",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Class Ratio",
    "problem": "In a class of 24 students, the ratio of boys to girls is 3:5. How many girls are there?",
    "answer": "15 girls"
  },
  {
    "id": "math_money_35",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Vacation Budget",
    "problem": "A family has a $1,500 vacation budget. If they spend $1,275, what percent of the budget remains?",
    "answer": "15%"
  },
  {
    "id": "math_geometry_47",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Square",
    "problem": "A square tile measures 9 inches on each side. What is its area?",
    "answer": "81 square inches"
  },
  {
    "id": "math_percent_28",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Interest Earned",
    "problem": "If $1,200 earns 3% simple interest each year, how much interest will it earn in 5 years?",
    "answer": "$180"
  },
  {
    "id": "math_money_36",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Weekly Expenses",
    "problem": "Liam earns $480 per week and spends $390. What percent of his income does he save?",
    "answer": "18.75%"
  },
  {
    "id": "math_geometry_48",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of Cone",
    "problem": "A cone has a radius of 3 cm and a height of 9 cm. Find its volume using π = 3.14.",
    "answer": "84.78 cubic cm"
  },
  {
    "id": "math_ratio_27",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Study Ratio",
    "problem": "For every 2 hours of reading, a student spends 3 hours practicing math. If she studies math for 9 hours, how long did she spend reading?",
    "answer": "6 hours"
  },
  {
    "id": "math_money_37",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Total Pay",
    "problem": "Jenna earns $18 per hour and works 38 hours. How much does she earn for the week?",
    "answer": "$684"
  },
  {
    "id": "math_geometry_49",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Perimeter of Rectangle",
    "problem": "A rectangle is 15 feet long and 9 feet wide. What is its perimeter?",
    "answer": "48 feet"
  }
]
[
  {
    "id": "math_money_38",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Combined Income",
    "problem": "Alex earns $15 per hour and works 32 hours a week. Jamie earns $12 per hour and works 40 hours a week. How much do they earn together in one week?",
    "answer": "$960"
  },
  {
    "id": "math_ratio_28",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Map Distance",
    "problem": "On a map, 1 inch represents 12 miles. If two cities are 5.25 inches apart, what is the actual distance between them?",
    "answer": "63 miles"
  },
  {
    "id": "math_geometry_50",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Composite Area",
    "problem": "A rectangular garden is 12 ft by 8 ft with a 4 ft by 4 ft shed taking up space inside. What is the remaining area to plant?",
    "answer": "80 square feet"
  },
  {
    "id": "math_percent_29",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Discount and Tax",
    "problem": "A laptop costs $1,000. It is discounted by 20% and then taxed at 8%. What is the final price?",
    "answer": "$864"
  },
  {
    "id": "math_money_39",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Commission and Base Pay",
    "problem": "A salesperson earns a $500 base salary plus 4% commission on $7,500 in sales. What is the total pay?",
    "answer": "$800"
  },
  {
    "id": "math_geometry_51",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Volume of a Box",
    "problem": "A rectangular box measures 20 inches long, 12 inches wide, and 10 inches tall. What is its volume in cubic inches?",
    "answer": "2,400 cubic inches"
  },
  {
    "id": "math_ratio_29",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Mixture Strength",
    "problem": "A cleaner is made by mixing 2 liters of concentrate with 8 liters of water. What percent of the mixture is concentrate?",
    "answer": "20%"
  },
  {
    "id": "math_geometry_52",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Diagonal of Rectangle",
    "problem": "Find the diagonal of a rectangle that is 9 inches long and 12 inches wide.",
    "answer": "15 inches"
  },
  {
    "id": "math_percent_30",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Salary Increase",
    "problem": "An employee’s annual salary increases from $42,000 to $47,250. What is the percent increase?",
    "answer": "12.5%"
  },
  {
    "id": "math_money_40",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Car Payment",
    "problem": "A $9,000 car loan is repaid in 36 equal monthly payments. What is each payment before interest?",
    "answer": "$250"
  },
  {
    "id": "math_geometry_53",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Irregular Shape Area",
    "problem": "A rectangular patio is 20 ft by 12 ft with a semicircular flower bed of radius 6 ft attached to one side. What is the total area? (Use π = 3.14)",
    "answer": "Approximately 314 + 113 = 427 square feet"
  },
  {
    "id": "math_ratio_30",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Recipe Scaling",
    "problem": "A recipe uses 2/3 cup of sugar to make 8 cookies. How much sugar is needed for 24 cookies?",
    "answer": "2 cups"
  },
  {
    "id": "math_percent_31",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Compound Percent",
    "problem": "An item’s price increases by 10% one year and then by another 10% the next year. If the original price was $100, what is the new price?",
    "answer": "$121"
  },
  {
    "id": "math_geometry_54",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Area of Circle Segment",
    "problem": "A circular pizza has a radius of 8 inches. What is the area of a quarter slice? (Use π = 3.14)",
    "answer": "50.24 square inches"
  },
  {
    "id": "math_money_41",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Savings Goal",
    "problem": "If you save $150 each month, how long will it take to save $4,500 for a car down payment?",
    "answer": "30 months"
  },
  {
    "id": "math_geometry_55",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Pool Volume",
    "problem": "A rectangular pool is 25 feet long, 15 feet wide, and 4 feet deep. What is the volume of the pool in cubic feet?",
    "answer": "1,500 cubic feet"
  },
  {
    "id": "math_ratio_31",
    "subject": "math",
    "area": "Ratios and Proportions",
    "label": "Scale Conversion",
    "problem": "A blueprint has a scale of 1 inch to 5 feet. If a wall is 18 feet long, how many inches long is it on the blueprint?",
    "answer": "3.6 inches"
  },
  {
    "id": "math_percent_32",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Two-Step Percent",
    "problem": "An item is discounted by 30% and then taxed at 8%. If the original price was $200, what is the final cost?",
    "answer": "$151.20"
  },
  {
    "id": "math_geometry_56",
    "subject": "math",
    "area": "Geometry and Measurement",
    "label": "Pythagorean Application",
    "problem": "A ladder rests against a wall reaching 15 feet high. If the ladder’s base is 9 feet from the wall, how long is the ladder?",
    "answer": "17.5 feet"
  },
  {
    "id": "math_money_42",
    "subject": "math",
    "area": "Quantitative Reasoning",
    "label": "Earnings and Expenses",
    "problem": "Jordan earns $3,800 per month and spends $2,985. What percent of income does he save?",
    "answer": "21.4%"
  }
]


