[
  {
    "id": "rla_gift_of_magi",
    "subject": "rla",
    "topic": "Narrative",
    "title": "The Gift of the Magi (Excerpt)",
    "author": "O. Henry",
    "year": 1905,
    "text": "One dollar and eighty-seven cents. That was all. And sixty cents of it was in pennies. Pennies saved one and two at a time by bulldozing the grocer and the vegetable man and the butcher until one's cheeks burned with silent imputation of parsimony that such close dealing implied. Three times Della counted it...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Narrative",
    "label": "General"
  },
  {
    "id": "rla_story_of_an_hour",
    "subject": "rla",
    "topic": "Narrative",
    "title": "The Story of an Hour",
    "author": "Kate Chopin",
    "year": 1894,
    "text": "Knowing that Mrs. Mallard was afflicted with heart trouble, great care was taken to break to her as gently as possible the news of her husband's death. She wept at once, with sudden, wild abandonment, in her sister’s arms. When the storm of grief had spent itself she went away to her room alone. There stood, facing the open window, a comfortable, roomy armchair...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Narrative",
    "label": "General"
  },
  {
    "id": "rla_tell_tale_heart",
    "subject": "rla",
    "topic": "Narrative",
    "title": "The Tell-Tale Heart (Excerpt)",
    "author": "Edgar Allan Poe",
    "year": 1843,
    "text": "True!—nervous—very, very dreadfully nervous I had been and am; but why will you say that I am mad? The disease had sharpened my senses—not destroyed—not dulled them. Above all was the sense of hearing acute. I heard all things in the heaven and in the earth. I heard many things in hell. How, then, am I mad?...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Narrative",
    "label": "General"
  },
  {
    "id": "rla_road_not_taken",
    "subject": "rla",
    "topic": "Poetry",
    "title": "The Road Not Taken",
    "author": "Robert Frost",
    "year": 1916,
    "text": "Two roads diverged in a yellow wood, And sorry I could not travel both And be one traveler, long I stood And looked down one as far as I could To where it bent in the undergrowth...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_hughes_dreams",
    "subject": "rla",
    "topic": "Poetry",
    "title": "Dreams",
    "author": "Langston Hughes",
    "year": 1922,
    "text": "Hold fast to dreams For if dreams die Life is a broken-winged bird That cannot fly. Hold fast to dreams For when dreams go Life is a barren field Frozen with snow.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_dickinson_death",
    "subject": "rla",
    "topic": "Poetry",
    "title": "Because I Could Not Stop for Death",
    "author": "Emily Dickinson",
    "year": 1863,
    "text": "Because I could not stop for Death – He kindly stopped for me – The Carriage held but just Ourselves – And Immortality. We slowly drove – He knew no haste And I had put away My labor and my leisure too, For His Civility –",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_whitman_singing",
    "subject": "rla",
    "topic": "Poetry",
    "title": "I Hear America Singing",
    "author": "Walt Whitman",
    "year": 1860,
    "text": "I hear America singing, the varied carols I hear; Those of mechanics, each one singing his as it should be blithe and strong; The carpenter singing his as he measures his plank or beam, The mason singing his as he makes ready for work, or leaves off work...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_dunbar_mask",
    "subject": "rla",
    "topic": "Poetry",
    "title": "We Wear the Mask",
    "author": "Paul Laurence Dunbar",
    "year": 1896,
    "text": "We wear the mask that grins and lies, It hides our cheeks and shades our eyes,— This debt we pay to human guile; With torn and bleeding hearts we smile, And mouth with myriad subtleties.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_o_henry_gift_of_magi",
    "subject": "rla",
    "topic": "Fiction",
    "title": "The Gift of the Magi (Excerpt)",
    "author": "O. Henry",
    "year": 1905,
    "text": "One dollar and eighty-seven cents. That was all. And sixty cents of it was in pennies. The next day would be Christmas, and Della had nothing to buy a gift for her Jim. There was clearly nothing to do but flop down on the couch and howl. So Della did it.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction",
    "label": "General"
  },
  {
    "id": "rla_kate_chopin_story_of_hour",
    "subject": "rla",
    "topic": "Fiction",
    "title": "The Story of an Hour",
    "author": "Kate Chopin",
    "year": 1894,
    "text": "When she heard the news of her husband’s death, Mrs. Mallard wept with sudden, wild abandonment. But when she was alone, a strange new feeling came creeping out of the sky—freedom. She whispered, 'Free, free, free!'",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction",
    "label": "General"
  },
  {
    "id": "rla_walt_whitman_america_singing",
    "subject": "rla",
    "topic": "Poetry",
    "title": "I Hear America Singing",
    "author": "Walt Whitman",
    "year": 1860,
    "text": "I hear America singing, the varied carols I hear, those of mechanics, each one singing his as it should be blithe and strong, the carpenter singing his as he measures his plank or beam, the mason singing his as he makes ready for work.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_langston_hughes_dreams",
    "subject": "rla",
    "topic": "Poetry",
    "title": "Dreams",
    "author": "Langston Hughes",
    "year": 1922,
    "text": "Hold fast to dreams, for if dreams die, life is a broken-winged bird that cannot fly. Hold fast to dreams, for when dreams go, life is a barren field frozen with snow.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Poetry",
    "label": "General"
  },
  {
    "id": "rla_hawthorne_ambitious_guest",
    "subject": "rla",
    "topic": "Short Story",
    "title": "The Ambitious Guest (Excerpt)",
    "author": "Nathaniel Hawthorne",
    "year": 1835,
    "text": "One night in autumn, a family sat around their cottage hearth, with the wind roaring without and the mountain stream rushing loudly beside them. They were cheerful, yet every sound from the forest made them draw closer together. Presently there came a knock at the door, and a young stranger entered, weary and travel-stained. He spoke of his plans, his hopes, and his ambition to make a name that would outlast him. The family listened, warmed by his enthusiasm. But even as they talked, a sound more terrible than the wind filled the valley—a mountain had fallen. In an instant the cottage was buried, and all within perished. In the morning, no trace of them was found, and none knew that among the stones lay the young man who had dreamed of fame.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Short Story",
    "label": "General"
  },
  {
    "id": "rla_edgar_allan_poe_raven",
    "subject": "rla",
    "topic": "Poetry / Gothic",
    "title": "The Raven (Long Excerpt)",
    "author": "Edgar Allan Poe",
    "year": 1845,
    "text": "Once upon a midnight dreary, while I pondered, weak and weary, over many a quaint and curious volume of forgotten lore—while I nodded, nearly napping, suddenly there came a tapping, as of some one gently rapping, rapping at my chamber door. \"’Tis some visitor,\" I muttered, \"tapping at my chamber door—only this and nothing more.\" Ah, distinctly I remember it was in the bleak December, and each separate dying ember wrought its ghost upon the floor. Eagerly I wished the morrow;—vainly I had sought to borrow from my books surcease of sorrow—sorrow for the lost Lenore. For the rare and radiant maiden whom the angels name Lenore—nameless here for evermore. And the silken, sad, uncertain rustling of each purple curtain thrilled me—filled me with fantastic terrors never felt before; so that now, to still the beating of my heart, I stood repeating, \"’Tis some visitor entreating entrance at my chamber door—some late visitor entreating entrance at my chamber door;—this it is and nothing more.\"",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Poetry / Gothic",
    "label": "General"
  },
  {
    "id": "rla_kate_chopin_cadian_ball",
    "subject": "rla",
    "topic": "Fiction",
    "title": "At the ’Cadian Ball (Excerpt)",
    "author": "Kate Chopin",
    "year": 1892,
    "text": "Bobinôt, that serious and steady young Acadian, had long cherished a quiet admiration for Calixta. She was the most daring of the village girls, quick of speech, and with eyes that seemed always to laugh at him. When news spread of the ’Cadian ball, the whole countryside was stirred, for such gatherings were rare chances to forget toil and worry. Calixta, though poor, determined to go, and her spirits were so high that those around her caught the contagion. At the ball she moved with easy grace, her laughter rippling over the music, and young men pressed close, hoping for a dance. Bobinôt watched, torn between pride in her brightness and fear that she would be won by someone wealthier or bolder. The night, warm and damp, was full of music, perfume, and unspoken wishes.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction",
    "label": "General"
  },
  {
    "id": "rla_walt_whitman_song_of_myself",
    "subject": "rla",
    "topic": "Poetry / American Voice",
    "title": "Song of Myself (Excerpt)",
    "author": "Walt Whitman",
    "year": 1855,
    "text": "I celebrate myself, and sing myself, and what I assume you shall assume, for every atom belonging to me as good belongs to you. I loafe and invite my soul, I lean and loafe at my ease observing a spear of summer grass. My tongue, every atom of my blood, formed from this soil, this air, born here of parents born here from parents the same, and their parents the same. I, now thirty-seven years old in perfect health begin, hoping to cease not till death. Creeds and schools in abeyance, retiring back a while sufficed at what they are, but never forgotten, I harbor for good or bad, I permit to speak at every hazard, nature without check with original energy.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Poetry / American Voice",
    "label": "General"
  },
  {
    "id": "rla_edgar_allan_poe_tell_tale_heart",
    "subject": "rla",
    "topic": "Short Story / Gothic",
    "title": "The Tell-Tale Heart (Excerpt)",
    "author": "Edgar Allan Poe",
    "year": 1843,
    "text": "True!—nervous—very, very dreadfully nervous I had been and am; but why will you say that I am mad? The disease had sharpened my senses, not destroyed, not dulled them. Above all was the sense of hearing acute. I heard all things in the heaven and in the earth. I heard many things in hell. How, then, am I mad? Listen! and observe how healthily—how calmly I can tell you the whole story. It was the old man’s eye! A pale blue eye, with a film over it. Whenever it fell upon me, my blood ran cold; and so, by degrees—very gradually—I made up my mind to take the life of the old man, and thus rid myself of the eye forever. Night after night I opened his door, oh so gently, to look upon him as he slept, and still the eye would not be upon me, for it was closed. It was not the old man who vexed me, but his Evil Eye.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Short Story / Gothic",
    "label": "General"
  },
  {
    "id": "rla_jack_london_to_build_a_fire",
    "subject": "rla",
    "topic": "Adventure / Naturalism",
    "title": "To Build a Fire (Excerpt)",
    "author": "Jack London",
    "year": 1908,
    "text": "The man was a newcomer in the land, a chechaquo, and this was his first winter. The cold did not lead him to meditate upon its significance. Fifty degrees below zero was to him merely fifty degrees below zero. He was quick and alert in the things of life, but only in the things, and not in their meanings. The Yukon lay a mile wide and hidden under three feet of ice. The man walked along the trail with a local dog at his heels. The dog knew it was no time for traveling. Its instinct told it that it was colder than sixty below, that no man should be abroad. Yet the man pressed on. He was bound for the boys, waiting at camp, and he had a plan to lunch at the forks, where he would build a fire. He did not know that in the North, to build a fire at such temperatures is not comfort but survival.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Adventure / Naturalism",
    "label": "General"
  },
  {
    "id": "rla_kate_chopin_desirees_baby",
    "subject": "rla",
    "topic": "Fiction / Social Themes",
    "title": "Désirée’s Baby (Excerpt)",
    "author": "Kate Chopin",
    "year": 1893,
    "text": "Désirée had been found, when a baby, asleep in the shadow of the big stone pillar. The Valmondés, childless and kind, had taken her to their hearts. She grew to be beautiful and gentle, and when Armand Aubigny saw her, he fell in love as if struck by a flame. Their marriage was happy, and when the child was born Armand’s pride was fierce and sweet. But as the weeks passed, Madame Valmondé, visiting, looked closely at the baby and then at Désirée. There was a subtle change, a tint, impossible to deny. Rumors in the quarters grew. Armand’s face hardened; he avoided his wife. At last he told her coldly that she was not white, that it was in her blood. Heartbroken, Désirée took the baby and walked out into the bayou’s reeds, leaving only a letter behind. Later, searching old papers, Armand discovered the truth: it was not Désirée but his own mother who had belonged to the race he despised.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction / Social Themes",
    "label": "General"
  },
  {
    "id": "rla_william_cullen_bryant_thanatopsis",
    "subject": "rla",
    "topic": "Poetry / Nature",
    "title": "Thanatopsis (Excerpt)",
    "author": "William Cullen Bryant",
    "year": 1817,
    "text": "To him who in the love of Nature holds communion with her visible forms, she speaks a various language. When thoughts of the last bitter hour come like a blight over thy spirit, and sad images of the stern agony, and shroud, and pall, and breathless darkness, and the narrow house make thee to shudder and grow sick at heart, go forth under the open sky, and list to Nature’s teachings. Earth and her waters, and the depths of air, shall soothe thee. Thou shalt lie down with patriarchs of the infant world—with kings, the powerful of the earth—the wise, the good, fair forms, and hoary seers of ages past, all in one mighty sepulchre. The hills, rock-ribbed and ancient as the sun, the vales stretching in pensive quietness between, the rivers that move in majesty, shall be thy burial-place.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Poetry / Nature",
    "label": "General"
  },
  {
    "id": "rla_sarah_orne_jewett_white_heron",
    "subject": "rla",
    "topic": "Regional Fiction / Nature",
    "title": "A White Heron (Excerpt)",
    "author": "Sarah Orne Jewett",
    "year": 1886,
    "text": "The woods were already filled with shadows one June evening, just before eight o’clock, though a bright sunset still glimmered faintly among the trunks of the trees. A little girl was driving home her cow, a plodding, dilatory, provoking creature, but a valued companion. The child, Sylvia, had come from the city to live with her grandmother in the country, and she loved the stillness. One day a young hunter appeared, eager and pleasant, carrying a gun, and he spoke of a rare white heron he wished to shoot. He offered money if Sylvia would tell where it nested. That night, Sylvia climbed the great pine tree to see the world, and there, in the dawn, she saw the heron’s secret place. But when she came down, with the knowledge shining in her eyes, she could not speak. The wild bird’s life was dearer to her than the hunter’s praise.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Regional Fiction / Nature",
    "label": "General"
  },
  {
    "id": "rla_herman_melville_bartleby",
    "subject": "rla",
    "topic": "Fiction / Character Study",
    "title": "Bartleby, the Scrivener (Excerpt)",
    "author": "Herman Melville",
    "year": 1853,
    "text": "I am a rather elderly man. The nature of my avocations has brought me into more than ordinary contact with what would seem an interesting and somewhat singular set of men of whom, as yet, nothing that I know of has ever been written—I mean the law-copyists or scriveners. It was a small affair of business that first brought Bartleby to my office. At first he did an extraordinary quantity of writing. As days passed, something unusual appeared in him. Upon my asking him to help examine a document, he replied calmly, \"I would prefer not to.\" This he repeated on many subsequent occasions, until at length he preferred not to do any copying at all. His passive resistance, so quiet yet so immovable, perplexed me more than anger or violence could have done. He was a man who had decided to withdraw from the world without leaving it.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction / Character Study",
    "label": "General"
  },
  {
    "id": "rla_charlotte_perkins_gilman_yellow_wallpaper",
    "subject": "rla",
    "topic": "Fiction / Social Critique",
    "title": "The Yellow Wallpaper (Excerpt)",
    "author": "Charlotte Perkins Gilman",
    "year": 1892,
    "text": "It is very seldom that mere ordinary people like John and myself secure ancestral halls for the summer. Still, the place is quite alone, standing well back from the road, quite three miles from the village. There is something strange about the house—perhaps it is only the wallpaper in the nursery. It is dull enough to confuse the eye, pronounced enough to irritate, and it has a kind of sprawling flamboyant pattern committing every artistic sin. I am told to rest and not to write, but the more I am forbidden, the more my mind dwells on that pattern. At night it seems to move; by day I fancy I see a woman behind it, shaking the bars to get out. If a woman is shut up long enough and denied her own work, she begins to creep in her mind, even as the figure behind the wallpaper creeps.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction / Social Critique",
    "label": "General"
  },
  {
    "id": "rla_paul_laurence_dunbar_symphathy",
    "subject": "rla",
    "topic": "Poetry / African American Voice",
    "title": "Sympathy",
    "author": "Paul Laurence Dunbar",
    "year": 1899,
    "text": "I know what the caged bird feels, alas! When the sun is bright on the upland slopes; when the wind stirs soft through the springing grass, and the river flows like a stream of glass; when the first bird sings and the first bud opes, and the faint perfume from its chalice steals—I know what the caged bird feels. I know why the caged bird beats his wing till its blood is red on the cruel bars; for he must fly back to his perch and cling when he fain would be on the bough a-swing. And a pain still throbs in the old, old scars and they pulse again with a keener sting—I know why he beats his wing. I know why the caged bird sings, ah me, when his wing is bruised and his bosom sore—when he beats his bars and would be free; it is not a carol of joy or glee, but a prayer that he sends from his heart’s deep core, but a plea, that upward to Heaven he flings—I know why the caged bird sings.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Poetry / African American Voice",
    "label": "General"
  },
  {
    "id": "rla_stephen_crane_open_boat",
    "subject": "rla",
    "topic": "Realism / Survival",
    "title": "The Open Boat (Excerpt)",
    "author": "Stephen Crane",
    "year": 1897,
    "text": "None of them knew the color of the sky. Their eyes glanced level, and were fastened upon the waves that swept toward them. These waves were of the hue of slate, save for the tops, which were of foaming white, and all of the men knew the colors of the sea. The correspondent, the oiler, the cook, and the injured captain lay in a ten-foot dinghy that seemed but a grain upon the great sea. It was a weary business rowing, for the surf forever threatened to fling them over, and yet they persisted because there was nothing else to do. Often the correspondent wished to cry out to the universe, “Do you not see, we are here?” But the universe was indifferent. It neither raged nor pitied. And in that indifference the men found a strange comradeship, each man helping the other to live in a world that did not know they existed.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Realism / Survival",
    "label": "General"
  },
  {
    "id": "rla_kate_chopin_pair_of_silk_stockings",
    "subject": "rla",
    "topic": "Fiction / Choice",
    "title": "A Pair of Silk Stockings",
    "author": "Kate Chopin",
    "year": 1897,
    "text": "Little Mrs. Sommers one day found herself the unexpected possessor of fifteen dollars. It seemed to her a very large amount of money, and she had planned to spend it wholly for the children—shoes for Janie, material for new waists, perhaps some stockings. She had the careful pride of a mother who makes a little do for many. But at the store, her hand rested on a pair of silk stockings, soft, smooth, and of a shade that pleased her. An impulse seized her. She had never indulged herself so. She bought them, and with that act the day changed. She dined at a restaurant, ordered better food than she was used to, and sat among well-dressed people as if she belonged there. For a few hours she stepped out of duty into desire. The money was gone at the end, but the memory of being, for once, only herself remained.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Fiction / Choice",
    "label": "General"
  },
  {
    "id": "rla_mark_twain_jumping_frog",
    "subject": "rla",
    "topic": "Humor / American Voice",
    "title": "The Celebrated Jumping Frog of Calaveras County (Excerpt)",
    "author": "Mark Twain",
    "year": 1865,
    "text": "There was a feller here once by the name of Jim Smiley, in the winter of ’49—or may be it was the spring of ’50—I don’t recollect exactly, somehow, though what makes me think it was one or the other is because I remember the big flume wasn’t finished when he first come to the camp. Anyway, this Jim Smiley was the curiousest man about betting you ever did see. If there was a dog-fight, he’d bet on it; if there was a cat-fight, he’d bet on it; if there was two birds settin’ on a fence, he’d bet which one would fly first. By and by he got him a frog, and he set in to educate him; and he did educate him, too. He gave him a little punch behind, and the frog would spring straight up higher than any frog in Calaveras County. Smiley was proud of him till a stranger filled the frog with quail-shot and beat him fair and square. That was Smiley all over—always willin’ to bet, and sometimes learnin’ the hard way.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Humor / American Voice",
    "label": "General"
  },
  {
    "id": "rla_bret_harte_luck_of_roaring_camp",
    "subject": "rla",
    "topic": "Western Fiction / Redemption",
    "title": "The Luck of Roaring Camp (Excerpt)",
    "author": "Bret Harte",
    "year": 1868,
    "text": "It was a name given to her by Kentuck in a burst of admiration of the baby’s small red hand, which, in trying to reach his finger, clasped it tightly. The men of Roaring Camp were not used to babies. They were miners, rough, unshaven, accustomed to oaths rather than lullabies. Yet when the mother died and the child remained, a strange change came over the camp. They built a better cabin, they planted flowers, they washed their faces more often. The presence of innocence made vice ashamed. Men stopped quarreling so loud, and the place grew almost respectable. They called the child “the Luck,” for since she came the claims seemed richer and the days more hopeful. In the midst of a rough frontier, the miners discovered that tenderness was still possible, and that even in a camp of outcasts a child could make a home.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Western Fiction / Redemption",
    "label": "General"
  },
  {
    "id": "rla_frontier_train_journey",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Train Through the Frontier",
    "author": "Public Domain Style",
    "year": 1890,
    "text": "When the westbound train pulled out of St. Louis, Clara Hayes pressed her gloved hand to the windowpane and watched the city fall away. She was twenty-three, traveling alone to teach school in the Dakota Territory. The conductor tipped his cap, and the cars rattled like tin toys across the prairie. For days, she watched endless grass bend beneath the wind, broken only by distant herds and the black dots of buffalo birds. Each evening, as the sun spilled copper light over the plains, she wrote in her small journal that the land felt both young and ancient. On the third night, a storm rose from the north. Thunder cracked against the iron of the train, and passengers huddled in silence. Clara felt fear but also wonder. Here was the continent’s heartbeat, wild and untamed, echoing against the rails. When morning broke, the air smelled of rain and lilac. In that freshness she understood her purpose—not merely to teach letters and sums, but to show children how to read the story written in the wind itself.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Narrative"
  },
  {
    "id": "rla_invention_of_printing",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "How the Printing Press Changed Learning",
    "author": "Public Domain Style",
    "year": 1885,
    "text": "Before Gutenberg’s press turned in Mainz, books were copied by hand, line by patient line, upon parchment. A single volume might occupy a monk for months or even years. When movable type arrived, words could be cast and pressed upon paper with astonishing speed. The new art spread across Europe like dawn across a darkened sky. Knowledge, once guarded by monasteries, spilled into the streets, the shops, and the minds of merchants and sailors. Cheap pamphlets debated theology and science; plays and poems reached readers who had never held a book. The press became a kind of second discovery of fire—less visible but equally transformative. It warmed intellect instead of hearths. With it came confusion as well as enlightenment: errors multiplied, heresies circulated, and rulers feared the power of printed dissent. Yet the written word could no longer be contained. From the clatter of wooden letters emerged an age of questioning that shaped the modern world.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Informational"
  },
  {
    "id": "rla_lighthouse_keeper",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Lighthouse Keeper’s Vigil",
    "author": "Public Domain Style",
    "year": 1902,
    "text": "At the edge of the Atlantic, Elias Ward tended the lantern that kept sailors from ruin. For twenty years he had wound the clockwork and polished the glass, though few remembered his name. The sea was both his companion and his adversary. In calm weather it glittered like hammered silver; in storm it roared with voices older than scripture. One winter night the fog thickened until even the horn was swallowed. He climbed the spiral stairs again and again, checking the wick, the oil, the flame. Below, the tide battered the rocks in blind fury. Near dawn, through the gray veil, he glimpsed a shadow of a schooner listing toward the reef. Without hesitation he rang the bell and swung the great beam toward the danger. When daylight came, wreckage drifted but the men were saved. In their gratitude, they asked his name. He simply smiled and said, 'The light knew what to do.'",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Narrative"
  },
  {
    "id": "rla_art_of_listening",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "On the Lost Art of Listening",
    "author": "Public Domain Style",
    "year": 1910,
    "text": "In every conversation there is a race between the tongue and the ear, and too often the tongue wins. We praise eloquence, but we neglect the discipline of listening. To listen is not to wait for one’s turn to speak; it is to open the mind as a harbor opens to ships. The quiet man gathers more wisdom in a minute of attention than the talker does in an hour of display. Our age, filled with telegraphs and clamoring presses, confuses noise with knowledge. If each citizen would learn to hear before he answers, councils would last shorter and hearts would heal faster. The philosopher listens for truth, the poet for music, and the friend for pain unspoken. Let us recover the nobility of the attentive ear, for words deserve a dwelling as well as an echo.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Argumentative"
  },
  {
    "id": "rla_factory_children",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "Children of the Factory Age",
    "author": "Public Domain Style",
    "year": 1858,
    "text": "When the clatter of looms filled the towns of England, children were among the first drawn into the mills. Small hands could dart between the spinning frames where a grown man’s arm could not reach. They worked before dawn and after dusk, their faces powdered with cotton dust. Reformers wrote pamphlets describing their pale cheeks and hollow eyes. Outrage rose slowly, like light through fog, until Parliament passed laws to guard the young. Yet even when hours were shortened, poverty drove families to send their sons and daughters back to the humming machines. The Industrial Revolution forged progress, but its iron shone with tears as well as triumph. To study those days is to see that civilization’s advance must always be measured by the care it shows to its smallest citizens.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Informational"
  },
  {
    "id": "rla_tavern_of_voices",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Tavern of Voices",
    "author": "Public Domain Style",
    "year": 1877,
    "text": "Rain hammered the shingles of the King’s Rest Inn while travelers crowded around the hearth. Each had a tale: the sailor spoke of storms, the merchant of markets, the soldier of battles half-won. Yet the loudest voice belonged to a poet with no audience beyond the walls. He declared that every man’s story was a stanza in a single, endless song. The others laughed, but he went on: 'When you boast, you rhyme with pride; when you mourn, you rhyme with loss.' At midnight the fire sank, and one by one the guests drifted to silence. In that hush, the poet’s words seemed to hover in the smoke. The innkeeper, sweeping embers into a pail, muttered that perhaps the fellow was right—that life itself was a poem none of us could finish before dawn.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Narrative"
  },
  {
    "id": "rla_language_of_flowers",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "The Secret Language of Flowers",
    "author": "Public Domain Style",
    "year": 1894,
    "text": "Long before telegraphs or postcards, people spoke through petals. In the Victorian age, each blossom carried a message. A red rose meant love, a violet modesty, a sprig of rosemary remembrance. Suitors who dared not speak aloud composed bouquets with trembling care, and recipients answered in kind. The fashion may seem quaint now, yet it reveals the human hunger for symbols. When words are forbidden or insufficient, we turn to color, scent, and shape to express the heart’s ungoverned speech. Even today, a florist’s window is a small library of emotion—its pages soft, fragrant, and brief.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Informational"
  },
  {
    "id": "rla_on_courage",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "The Measure of Courage",
    "author": "Public Domain Style",
    "year": 1900,
    "text": "Men commonly mistake boldness for bravery. To shout, to strike, to defy—these are but gestures. True courage is quieter. It is the strength to do what conscience dictates when applause is absent and failure almost certain. The nurse who tends the fevered poor, the clerk who refuses a dishonest order, the child who speaks truth to an angry parent—each possesses a valor greater than the soldier’s drumbeat. A nation is free only while its citizens are brave in private. Let us, then, honor not merely the heroes in marble but those whose courage leaves no monument except the peace of their own hearts.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Argumentative"
  },
  {
    "id": "rla_poem_riverbend",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Poetry",
    "title": "Winter at the River Bend",
    "author": "Public Domain Style",
    "year": 1880,
    "text": "The river bends beneath a sheet of glass, / the reeds stand frozen like a prayer. / No song of lark, no whispering grass, / only the hush of crystal air. / A single skater carves his line, / bright sparks of frost beneath his heel, / and where he passes, faintly shine / the echoes time alone can feel. / I watch until his figure fades, / the curve dissolves, the rhythm ends; / and think how swiftly beauty trades / its hour for silence, ice for bends. / The river sleeps, yet underneath / its dreaming heart the waters run; / so does the soul, though bound in sheath, / still murmur softly to the sun.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Poetry"
  },
  {
    "id": "rla_inventors_daughter",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Inventor’s Daughter",
    "author": "Public Domain Style",
    "year": 1915,
    "text": "When Lydia’s father died, he left behind a room filled with blueprints and silence. The neighbors said he had wasted his years chasing impossible machines. Lydia thought otherwise. Each evening she wound the brass gears of his unfinished clockwork bird. At first it only trembled; then one night it fluttered and gave a thin, metallic chirp. Tears blurred her eyes as she realized the design required music, not power. She placed her own small tune within its heart—an echo from her childhood—and the bird sang clear and true. People came from miles to see it, marveling at invention, but Lydia knew it was love that had completed the machine.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Narrative"
  },
  {
    "id": "rla_on_silence",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "In Praise of Silence",
    "author": "Public Domain Style",
    "year": 1869,
    "text": "Silence is not emptiness; it is the mother of thought. In cities we drown beneath the rumble of wheels and the clatter of tongues, until the mind grows thin from noise. To be silent is not to withdraw from life but to listen to it. The sage who sits by a still pond hears more of the universe than the orator upon his stage. Silence refines anger, distills sorrow, and makes joy audible. Those who cannot bear it are often those who fear the company of their own souls. In an age of endless declaration, silence remains the most radical speech of all.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Argumentative"
  },
  {
    "id": "rla_letter_from_frontier",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Historical Fiction",
    "title": "Letter from the Frontier, 1850",
    "author": "Public Domain Style",
    "year": 1850,
    "text": "Dearest Mother, I write by candlelight while the wind moans around the cabin like some lonesome violin. We have planted corn and hope both will rise by spring. The nearest neighbor is ten miles distant, yet the prairie is not empty; it hums with life unseen. Yesterday a band of elk crossed the horizon like moving clouds. The children thrive, though they miss your stories by the fire. Tell Father that the soil here is black as ink and just as ready to receive words if one only had the courage to write them. Should fortune favor us, we will carve a town from this silence. Until then, think of me when the kettle sings, for that sound is the same even at the edge of the world.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Historical Fiction"
  },
  {
    "id": "rla_poem_morning_forge",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Poetry",
    "title": "The Blacksmith’s Morning",
    "author": "Public Domain Style",
    "year": 1870,
    "text": "Before the town awakes, the forge already burns; / the anvil waits, patient as stone. / Sparks fly like prayers the hammer learns, / shaping steel into muscle and bone. / He swings for bread, for pride, for art, / his rhythm steady as a psalm. / The world he tempers with his heart / is both his burden and his balm. / When daylight pours through the open door, / he wipes his brow yet does not rest— / for labor is the creed he swore, / the hymn that beats within his chest.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Poetry"
  },
  {
    "id": "rla_on_books",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "The Companionship of Books",
    "author": "Public Domain Style",
    "year": 1888,
    "text": "There are friendships that never betray us, and among them are books. They wait upon the shelf without complaint, asking only that we open their hearts. A man may travel from youth to age, from poverty to honor, and still find his earliest volumes faithful. Unlike conversation, which dies upon the air, the written page preserves the better part of humanity. To read is to walk beside the greatest minds and to borrow their courage. Yet books demand courtesy: one must read not for vanity but for growth. The true reader seeks not to conquer a library but to commune with it. When we understand this, we discover that a single well-loved volume may contain more adventure than a thousand careless voyages.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Argumentative"
  },
  {
    "id": "rla_experiment_with_light",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Informational",
    "title": "An Experiment with Light",
    "author": "Public Domain Style",
    "year": 1908,
    "text": "In a darkened room, a simple beam of sunlight revealed to young scientists the secret colors hidden within white. Passing through a prism, the light unfolded into a ribbon of fire—violet, indigo, blue, green, yellow, orange, red. Each hue bent at a slightly different angle, proving that light was not a single substance but a harmony of many. From that discovery flowed the age of optics: microscopes to view the small, telescopes to explore the far. The experiment required no expensive tools, only curiosity and patience. Thus does science remind us that wonder often begins not in laboratories but in humble rooms where someone dares to ask, 'What if?'",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Informational"
  },
  {
    "id": "rla_poem_dream_of_city",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Poetry",
    "title": "Dream of the City",
    "author": "Public Domain Style",
    "year": 1911,
    "text": "I dreamed a city built of bells, / where every street was tuned to chime; / each hour sang, and silence fell / only at the edge of time. / The workers forged their hopes in brass, / the children played in notes of gold; / and when the evening shadows passed, / the towers hummed with stories told. / Yet one small bell refused the song, / it kept a deeper, gentler tone; / and when I woke, its echo long / still whispered, 'You are not alone.'",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Poetry"
  },
  {
    "id": "rla_watchmaker",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Narrative",
    "title": "The Watchmaker’s Apprentice",
    "author": "Public Domain Style",
    "year": 1899,
    "text": "In a narrow shop that smelled of oil and patience, Tobias learned the art of time. His master, old Herr Klein, could mend any watch brought to him, from a sailor’s dented pocket piece to a duke’s jeweled heirloom. 'A clock,' he said, 'is a small universe, and the balance wheel its sun.' Tobias listened, but one day he dropped a customer’s watch and shattered its crystal. Expecting fury, he found only a smile. 'Then you will learn how to replace what you have broken,' said the master. Years later, Tobias owned the shop, and when an apprentice made the same mistake, he gave the same answer. Thus does craft become tradition, and forgiveness keep better time than anger.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Narrative"
  },
  {
    "id": "rla_on_kindness",
    "subject": "rla",
    "topic": "Reading Comprehension",
    "type": "Argumentative",
    "title": "The Quiet Strength of Kindness",
    "author": "Public Domain Style",
    "year": 1905,
    "text": "Kindness has no trumpet, yet it moves the world. Empires are founded by conquest but held together by simple decency. A kindly word has turned away wars, though the chronicles forget to mention it. Kindness asks no return; it is content with its own work. In commerce it softens greed, in science it humanizes truth, and in homes it is the unseen architect of peace. Some call it weakness, but it endures where strength crumbles. The hardest hearts, when met with steady mercy, begin to thaw. In the end, history may prove that civilization advanced not by machines or laws, but by the quiet persistence of the gentle.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reading Comprehension",
    "label": "Argumentative"
  }
]