[
  {
    "id": "science_galileo_moons",
    "subject": "science",
    "topic": "Astronomy",
    "title": "Galileo Observes Jupiter's Moons",
    "author": "Galileo Galilei",
    "year": 1610,
    "text": "In January of 1610, I discovered four stars wandering around Jupiter, invisible before my observations. They moved as companions of the great planet, never departing far from it. Night after night, their changes confirmed that not all heavenly bodies revolve about the Earth. This discovery gave support to the Copernican idea that the planets circle the Sun.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Astronomy",
    "label": "Astronomy"
  },
  {
    "id": "science_newton_gravity",
    "subject": "science",
    "topic": "Physics",
    "title": "Newton on Universal Gravitation",
    "author": "Isaac Newton",
    "year": 1687,
    "text": "Every particle of matter in the universe attracts every other particle with a force that varies directly with the product of their masses and inversely with the square of the distance between their centers. This simple law, though invisible to our senses, binds the planets in their courses and holds the Moon in her path about the Earth.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Physics",
    "label": "General"
  },
  {
    "id": "science_pasteur_germs",
    "subject": "science",
    "topic": "Biology",
    "title": "Pasteur’s Experiments on Germs",
    "author": "Louis Pasteur",
    "year": 1864,
    "text": "In experiments with flasks containing broth, I boiled the liquid and left some flasks open to the air while others remained sealed with curved necks. Those open to the air soon teemed with microscopic life, while the sealed ones stayed clear. From this I concluded that microbes come only from other microbes, not by spontaneous generation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Biology",
    "label": "General"
  },
  {
    "id": "science_rachel_carson_sea",
    "subject": "science",
    "topic": "Environmental Science",
    "title": "The Sea Around Us (Excerpt)",
    "author": "Rachel Carson",
    "year": 1951,
    "text": "To stand at the shore is to witness eternity. The sea has shaped the land, governed the climate, and sustained the web of life. The rhythm of tides, the endless rising and falling, tells us that change and balance are the essence of the Earth. Man has begun to understand that he is linked to the sea, not above it.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Environmental Science",
    "label": "General"
  },
  {
    "id": "science_darwin_origin_species",
    "subject": "science",
    "topic": "Evolution / Biology",
    "title": "On the Origin of Species (Excerpt)",
    "author": "Charles Darwin",
    "year": 1859,
    "text": "As many more individuals of each species are born than can possibly survive; and as, consequently, there is a recurring struggle for existence, it follows that any being, if it vary in any manner profitable to itself, will have a better chance of surviving, and thus be naturally selected.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Evolution / Biology",
    "label": "Evolution"
  },
  {
    "id": "science_newton_opticks",
    "subject": "science",
    "topic": "Physics / Light",
    "title": "Opticks (Excerpt)",
    "author": "Isaac Newton",
    "year": 1704,
    "text": "The rays of light are not colored. Colors are the sensations of the observer. When light is refracted or reflected, it may be separated into rays that excite different colors, but the light itself remains uncolored.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Physics / Light",
    "label": "General"
  },
  {
    "id": "science_faraday_electricity",
    "subject": "science",
    "topic": "Electricity",
    "title": "Experimental Researches in Electricity (Excerpt)",
    "author": "Michael Faraday",
    "year": 1831,
    "text": "Electricity is capable of being evolved by ordinary mechanical means, and by magnetic influence. The relation between magnetism and electricity is of the deepest importance in physical science.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Electricity",
    "label": "General"
  },
  {
    "id": "science_pasteur_germ_theory",
    "subject": "science",
    "topic": "Microbiology",
    "title": "The Germ Theory of Disease (Excerpt)",
    "author": "Louis Pasteur",
    "year": 1864,
    "text": "The air is full of the germs of microscopic organisms. These germs are the cause of fermentation and disease. By excluding germs, one can prevent both processes from occurring.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Microbiology",
    "label": "General"
  },
  {
    "id": "science_galileo_star_message",
    "subject": "science",
    "topic": "Astronomy",
    "title": "The Starry Messenger (Excerpt)",
    "author": "Galileo Galilei",
    "year": 1610,
    "text": "Through my telescope I have observed four planets revolving about Jupiter, invisible without the aid of a glass. These observations prove that not all heavenly bodies revolve around the Earth, as was formerly believed.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Astronomy",
    "label": "Astronomy"
  },
  {
    "id": "science_curie_radioactivity",
    "subject": "science",
    "topic": "Chemistry / Physics",
    "title": "Research on Radioactive Substances (Excerpt)",
    "author": "Marie Curie",
    "year": 1898,
    "text": "The new substance emits rays which are capable of discharging electrified bodies and of penetrating various substances. I propose to call this new element 'radium.' Its remarkable activity suggests it may reveal new laws of matter.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Chemistry / Physics",
    "label": "General"
  },
  {
    "id": "sci_passage_01",
    "subject": "science",
    "topic": "Ecology",
    "title": "The Sea Around Us (Excerpt)",
    "author": "Rachel Carson",
    "year": 1951,
    "text": "The sea lies all about us. The continents themselves dissolve and pass to the sea, in grain after grain of eroded land. In its mysterious past, the sea has shaped the Earth; today it continues to influence climate and sustain life.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Ecology",
    "label": "General"
  },
  {
    "id": "science_einstein_relativity",
    "subject": "science",
    "topic": "Physics / Relativity",
    "title": "Relativity: The Special and General Theory (Excerpt)",
    "author": "Albert Einstein",
    "year": 1916,
    "text": "The laws of physics are the same for all observers in uniform motion. Time and space are not absolute, but depend on the motion of the observer. This simple idea leads to consequences that change our understanding of the universe.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Physics / Relativity",
    "label": "General"
  },
  {
    "id": "science_darwin_descent_of_man",
    "subject": "science",
    "topic": "Evolution / Anthropology",
    "title": "The Descent of Man (Excerpt)",
    "author": "Charles Darwin",
    "year": 1871,
    "text": "Man still bears in his bodily frame the indelible stamp of his lowly origin. His body is plainly related to that of the lower animals, but his moral sense and social instincts are what distinguish him most. These instincts lead him to sympathize with others, to aid the weak, and to repress his own selfish impulses. As man advances in civilization, and small tribes unite into larger communities, the simplest reason would tell each individual that he ought to extend his social instincts and sympathies to all members of the same nation, even to all nations and races. Thus the social instincts, the prime principle of man’s moral constitution, would gradually extend and be strengthened, till they became the ruling power.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Evolution / Anthropology",
    "label": "General"
  },
  {
    "id": "science_newton_principia",
    "subject": "science",
    "topic": "Physics / Motion",
    "title": "Principia Mathematica (Excerpt)",
    "author": "Isaac Newton",
    "year": 1687,
    "text": "Every body continues in its state of rest, or of uniform motion in a straight line, unless compelled to change that state by forces impressed upon it. The change of motion is proportional to the motive force impressed and is made in the direction of the straight line in which the force is impressed. To every action there is always opposed an equal reaction. In the philosophy of nature, it is by these laws that the harmony of motion and the predictability of the universe are secured. The same principle that guides the fall of an apple governs the motion of the Moon. This discovery has opened the door to a mechanical understanding of the heavens, uniting the terrestrial and celestial into one grand design of order and simplicity.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Physics / Motion",
    "label": "General"
  },
  {
    "id": "science_darwin_origin_long",
    "subject": "science",
    "topic": "Natural Selection",
    "title": "On the Origin of Species (Long Excerpt)",
    "author": "Charles Darwin",
    "year": 1859,
    "text": "As many more individuals of each species are born than can possibly survive, and as there is consequently a frequent struggle for existence, it follows that any being, if it vary in any manner profitable to itself, will have a better chance of surviving, and thus be naturally selected. It is the preservation of favorable variations and the rejection of injurious variations. From the strong principle of inheritance, any selected variety will tend to propagate its new and modified form. The theory of natural selection, though simple in statement, carries profound consequences: it unites all forms of life in one long, unbroken chain of descent. No longer can we consider species as fixed creations; rather, they are the results of a gradual process, acting silently but surely over vast ages. The grandeur of this view of life lies in the unity of its origin and the endless forms most beautiful that have been, and are being, evolved.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Natural Selection",
    "label": "Evolution"
  },
  {
    "id": "science_galileo_letter_to_grand_duchess",
    "subject": "science",
    "topic": "Astronomy / Church Conflict",
    "title": "Letter to the Grand Duchess Christina (Excerpt)",
    "author": "Galileo Galilei",
    "year": 1615,
    "text": "It is surely harmful to souls to make it a heresy to believe what is proved. The intention of the Holy Spirit is to teach us how one goes to heaven, not how the heavens go. The discoveries of the telescope are not contrary to Scripture, for Scripture cannot err, though its interpreters may. The motion of the Earth is supported by evidence and reason; to reject it is to reject the works of God Himself, for nature is written in the language of mathematics. The more we study that language, the more deeply we see into His creation. Let us not fear to use our senses and reason, for these too are divine gifts meant to lead us to truth.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Astronomy / Church Conflict",
    "label": "Astronomy"
  },
  {
    "id": "science_faraday_field_concept",
    "subject": "science",
    "topic": "Electromagnetism",
    "title": "On the Physical Lines of Force (Excerpt)",
    "author": "Michael Faraday",
    "year": 1852,
    "text": "Before I began my experiments on magnetism and electricity, I was deeply impressed by the idea that the forces of nature are not independent, but connected. The concept of a 'field' was not yet established; yet I believed that space itself is filled with lines of force. These lines are not imaginary but real—capable of transmitting energy and producing motion at a distance. It seemed to me that a magnet acts upon another, not by an invisible hand, but by a real medium existing between them. I have found that the same lines which pass through the magnet also influence light, heat, and electricity. It is a grand and beautiful idea that all forces are manifestations of one universal power.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Electromagnetism",
    "label": "Electricity & Magnetism"
  },
  {
    "id": "sci_passage_02",
    "subject": "science",
    "topic": "Microbiology",
    "title": "On the Germ Theory (Expanded)",
    "author": "Louis Pasteur",
    "year": 1864,
    "text": "Gentlemen, I have shown that the air contains the germs of microscopic organisms which cause fermentation and putrefaction. If a liquid is protected from these germs, it remains pure. If exposed, it becomes teeming with life. The idea that life can arise spontaneously from lifeless matter has no foundation in experiment. Life comes only from life. This simple truth has immense consequences for medicine and hygiene. If we can prevent germs from entering wounds, we can prevent disease. If we can sterilize instruments and bandages, we can save lives. Thus a scientific fact becomes a moral duty: to use knowledge to lessen suffering and preserve health.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Microbiology",
    "label": "General"
  },
  {
    "id": "science_rutherford_atom",
    "subject": "science",
    "topic": "Atomic Theory",
    "title": "Structure of the Atom (Excerpt)",
    "author": "Ernest Rutherford",
    "year": 1911,
    "text": "When we fired alpha particles at thin gold foil, we expected them to pass straight through, but some were deflected backward. It was as if a cannonball had struck a piece of tissue paper and rebounded. This unexpected result led us to the conclusion that most of the atom is empty space, with a tiny dense nucleus at its center. Around this nucleus, electrons move at great speed. Thus the atom is not a solid sphere but a miniature solar system. The discovery changed our conception of matter and laid the foundation for the structure of the modern atom. It showed that the physical world is both more fragile and more wondrous than we had imagined.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Atomic Theory",
    "label": "Atomic Theory"
  },
  {
    "id": "science_curie_radioactivity_long",
    "subject": "science",
    "topic": "Chemistry / Physics",
    "title": "The Discovery of Radium (Excerpt)",
    "author": "Marie Curie",
    "year": 1898,
    "text": "During my studies with my husband Pierre, we examined a mineral called pitchblende, which was far more active than uranium itself. After long and patient work, dissolving and crystallizing tons of the mineral, we obtained a small amount of a new substance—a salt of a new element. It emitted rays far stronger than those of uranium or thorium. We named it 'radium.' Its light seemed to come from within itself, requiring no fuel or air. Day and night, it glowed faintly in the dark laboratory. The discovery of radium opened new paths in physics and chemistry. It showed that atoms were not indivisible but contained immense stores of energy. Yet, even then, we did not foresee all the uses and dangers that would follow.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Chemistry / Physics",
    "label": "General"
  },
  {
    "id": "science_charles_lyell_principles_geology",
    "subject": "science",
    "topic": "Earth Science / Geology",
    "title": "Principles of Geology (Excerpt)",
    "author": "Charles Lyell",
    "year": 1830,
    "text": "The present is the key to the past. This is the doctrine I have endeavored to illustrate: that the forces now operating upon the Earth’s surface—rivers wearing down mountains, oceans depositing sediments, volcanoes building up land—are the very same forces that have acted for countless ages. We need not imagine sudden, violent catastrophes to account for the great changes recorded in the rocks. Slow, observable processes, given sufficient time, can raise continents and hollow seas. This uniformity of causes gives geology a firm foundation, for we can study nature as it is today and infer the history of our planet. Thus the Earth is far older than many have supposed, and its features are the result of long, continuous action.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Earth Science / Geology",
    "label": "Astronomy"
  },
  {
    "id": "science_antoine_lavoisier_elements_chemistry",
    "subject": "science",
    "topic": "Chemistry",
    "title": "Elements of Chemistry (Excerpt)",
    "author": "Antoine Lavoisier",
    "year": 1789,
    "text": "Nothing is created and nothing is lost in the operations of chemistry; there is only a change, a combination, a separation of particles. When a metal is burned in air, it increases in weight because it has combined with a portion of the air. When a gas is produced, the weight of the substances before and after remains the same. This is the law of conservation of mass. To understand chemical reactions, we must name the substances correctly, measure them exactly, and record the results clearly. Chemistry thus becomes not a mysterious art practiced by a few, but a science resting on observation and calculation. By adopting a rational nomenclature and by using the balance, we have laid the foundations for all future discoveries.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Chemistry",
    "label": "Ecology"
  },
  {
    "id": "science_robert_hooke_micrographia",
    "subject": "science",
    "topic": "Biology / Microscopy",
    "title": "Micrographia (Excerpt)",
    "author": "Robert Hooke",
    "year": 1665,
    "text": "By the help of microscopes, there is nothing so small as to escape our inquiry; hence there is a new visible world discovered to the understanding. A slice of cork, which to the naked eye appears solid, is seen to be composed of many little boxes or cells, like a honeycomb. Insects that seemed but tiny specks are revealed to be elaborately jointed machines, furnished with hairs, eyes, and claws. The edge of a razor, thought to be smooth, is found ragged and uneven. These observations teach us humility, for they show that our senses do not reveal the whole of nature. They also teach us curiosity, for who can tell what other wonders lie hidden beyond the reach of our present instruments?",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Biology / Microscopy",
    "label": "General"
  },
  {
    "id": "science_gregor_mendel_hybridization",
    "subject": "science",
    "topic": "Genetics",
    "title": "Experiments on Plant Hybridization (Excerpt)",
    "author": "Gregor Mendel",
    "year": 1866,
    "text": "In cultivating varieties of the garden pea, I observed that certain traits appeared in regular numerical proportions. When I crossed a plant with round seeds and one with wrinkled seeds, the first generation showed only round seeds. But when these offspring were allowed to self-fertilize, the next generation produced round and wrinkled seeds in the ratio of about three to one. Similar results were obtained for flower color, pod color, and plant height. From these experiments I concluded that traits are determined by discrete factors, which are passed from parents to offspring. These factors do not blend but remain distinct, and some are dominant over others. Thus heredity follows laws that can be stated mathematically, and variation in living things is not chaotic but ordered.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Genetics",
    "label": "General"
  },
  {
    "id": "science_james_clerk_maxwell_electromagnetic_field",
    "subject": "science",
    "topic": "Physics / Electromagnetism",
    "title": "A Dynamical Theory of the Electromagnetic Field (Excerpt)",
    "author": "James Clerk Maxwell",
    "year": 1865,
    "text": "The experiments of Faraday have shown that electric and magnetic phenomena are closely related. I have endeavored to express this relation in mathematical form. The result is that light itself appears to be an electromagnetic disturbance propagated through the field according to electromagnetic laws. Electric and magnetic forces are not instantaneous actions at a distance, but conditions of a medium filling space. When these conditions change, waves are set up which travel with a finite velocity. That velocity, as determined from the experiments, is the same as that of light. Hence we are led to the remarkable conclusion that light and magnetism are affections of the same substance, and that light is an electromagnetic wave. Thus two great departments of physics are united.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Physics / Electromagnetism",
    "label": "Electricity & Magnetism"
  },
  {
    "id": "science_nikola_tesla_alternating_current",
    "subject": "science",
    "topic": "Electric Power",
    "title": "On the Use of Alternating Currents (Excerpt)",
    "author": "Nikola Tesla",
    "year": 1892,
    "text": "In considering the transmission of electric power, it became evident to me that direct current systems would always suffer great losses over distance. Alternating current, on the other hand, can be transformed to higher voltages, transmitted over long lines, and then reduced again for practical use. By employing rotating magnetic fields and polyphase systems, we can construct motors that are both efficient and reliable, with few parts to wear. The spread of such systems will make it possible to harness waterfalls and distant sources of energy for the service of cities. Electricity, so managed, will become not a curiosity but a universal servant, lighting homes, driving machinery, and improving daily life.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Electric Power",
    "label": "Electricity & Magnetism"
  },
  {
    "id": "science_alfred_russel_wallace_varieties",
    "subject": "science",
    "topic": "Evolution / Biogeography",
    "title": "On the Tendency of Varieties to Depart Indefinitely from the Original Type (Excerpt)",
    "author": "Alfred Russel Wallace",
    "year": 1858,
    "text": "Every species is constantly exposed to conditions which destroy many of its individuals. Those which happen to be born with a slight advantage—greater swiftness, better color for concealment, stronger beak—are more likely to live and to reproduce. Their favorable traits are thus preserved, while the less favored die out. In regions where the conditions differ, different traits will be favored, and so varieties may arise. If the differences continue to accumulate, these varieties may become distinct species. Thus the origin of species can be explained by natural causes acting slowly over long periods, without calling upon sudden acts of creation. This view is supported by the geographical distribution of animals, which shows clearly that closely allied forms inhabit neighboring regions.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Evolution / Biogeography",
    "label": "Evolution"
  },
  {
    "id": "science_faraday_chemical_history_candle",
    "subject": "science",
    "topic": "Chemistry / Energy",
    "title": "The Chemical History of a Candle (Excerpt)",
    "author": "Michael Faraday",
    "year": 1861,
    "text": "There is not a law under which any part of this universe is governed which does not come into play in the phenomena of a candle. Consider the flame: fed by the melted wax, supplied with oxygen from the air, it gives light and heat while producing water and carbonic acid. The wax, though solid, is first turned into a vapor, and it is this vapor that truly burns. The current of hot gases rises, drawing in fresh air below, so that the process continues. If we enclose the candle and cut off the air, the flame is extinguished; if we supply pure oxygen, it burns brighter. Thus from so simple an object as a candle we may learn the nature of combustion, the properties of gases, and the conservation of matter.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Chemistry / Energy",
    "label": "Ecology"
  },
  {
    "id": "science_humboldt_personal_narrative_tropics",
    "subject": "science",
    "topic": "Natural History / Ecology",
    "title": "Personal Narrative of Travels to the Equinoctial Regions (Excerpt)",
    "author": "Alexander von Humboldt",
    "year": 1814,
    "text": "In the tropics, nature displays a magnificence unknown in temperate zones. The forests are not composed of a few species of trees, but of multitudes, each with its own form of leaf and flower. Lianas hang like festoons from the branches; orchids bloom upon the trunks; birds of brilliant plumage dart among the foliage. Yet this profusion is not disorder. The same laws that govern the distribution of plants upon the mountains of Europe govern them here, but under conditions of greater heat and moisture. By comparing distant regions, we perceive the unity of nature. The Earth is not a collection of separate kingdoms but a single great organism, in which climate, soil, plants, and animals act and react upon one another.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Natural History / Ecology",
    "label": "Evolution"
  },
  {
    "id": "science_carl_linnaeus_systema_naturae",
    "subject": "science",
    "topic": "Classification / Biology",
    "title": "Systema Naturae (Excerpt)",
    "author": "Carl Linnaeus",
    "year": 1735,
    "text": "The diversity of living things is vast, yet it is not confused. Nature is orderly. To make sense of this order, I have proposed that every plant and animal be given two names: a generic name and a specific name. By this binomial system, all naturalists in every land may speak the same language. Creatures that resemble each other in structure and reproduction are placed in the same genus; related genera are grouped into higher ranks. The purpose is not merely to label, but to reveal the plan of the Creator as shown in the forms of life. By careful observation of parts—the petals of flowers, the teeth of animals, the number of limbs—we can place each organism in a natural system. Thus classification becomes the key to understanding the richness of the natural world.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Classification / Biology",
    "label": "General"
  },
  {
    "id": "science_william_harvey_motion_of_heart",
    "subject": "science",
    "topic": "Human Body / Circulation",
    "title": "On the Motion of the Heart and Blood (Excerpt)",
    "author": "William Harvey",
    "year": 1628,
    "text": "When I considered the various opinions of anatomists about the movement of the blood, I found none that satisfied reason. By repeated dissections and observations on living animals, I discovered that the heart acts as a pump, contracting and relaxing in regular order, driving blood into the arteries. The blood does not ebb and flow in the veins like a tide; rather, it is sent out from the heart and returns to it in a circle, which I call the circulation of the blood. The valves of the veins permit blood to move in one direction only, toward the heart. This perpetual circular motion supplies all parts of the body with nourishment and life. Thus the body is not a static structure but a dynamic system, maintained by constant movement.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Human Body / Circulation",
    "label": "General"
  },
  {
    "id": "science_john_snow_cholera",
    "subject": "science",
    "topic": "Public Health / Epidemiology",
    "title": "On the Mode of Communication of Cholera (Excerpt)",
    "author": "John Snow",
    "year": 1855,
    "text": "During the late outbreaks of cholera in London, I was struck by the fact that the disease clustered in certain streets and houses. By mapping the cases, I found that nearly all were supplied with water from a particular pump in Broad Street. I concluded that cholera is not borne by foul air alone, as was generally believed, but by something in the water—an agent too small to be seen, yet capable of producing violent illness when swallowed. When the handle of the Broad Street pump was removed, the number of new cases fell off rapidly. This fact strongly supports the waterborne theory. If we can secure pure water and proper disposal of waste, we may prevent such epidemics. Thus careful observation and statistics can guide public health.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Public Health / Epidemiology",
    "label": "General"
  },
  {
    "id": "science_florence_nightingale_notes_on_nursing",
    "subject": "science",
    "topic": "Health / Nursing",
    "title": "Notes on Nursing (Excerpt)",
    "author": "Florence Nightingale",
    "year": 1859,
    "text": "The very first requirement in a hospital is that it should do the sick no harm. Yet many patients perish not from their original disease but from foul air, bad drainage, and want of cleanliness. The nurse’s duty is to place the patient in the best possible condition for nature to act upon him. This means pure air, pure water, efficient drainage, cleanliness, and light. The sick should not breathe the air they have just exhaled. Windows must be opened, beds aired, and rooms kept free of needless noise. What is called trained nursing is the knowledge of how to manage the patient’s environment. It is no small thing, for on it often depends whether life or death shall prevail.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Health / Nursing",
    "label": "Ecology"
  },
  {
    "id": "science_james_hutton_theory_of_earth",
    "subject": "science",
    "topic": "Geology / Deep Time",
    "title": "Theory of the Earth (Excerpt)",
    "author": "James Hutton",
    "year": 1795,
    "text": "In examining the surface of the Earth, we find layers of rock lying horizontally, but often tilted, broken, and uplifted. These rocks contain the remains of marine animals, which shows they were formed at the bottom of the sea. Yet now we find them high on mountains. How can this be? The answer is that the Earth is not in a state of rest but of perpetual circulation. Land is worn down by weathering and rivers; its materials are carried to the sea, where they form new strata; these strata are later raised again by subterranean heat. No trace of a beginning, no prospect of an end, is to be found. The present is the key to the past, and the processes we see today have been shaping the Earth for immeasurable ages.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Geology / Deep Time",
    "label": "Geology"
  },
  {
    "id": "science_benjamin_franklin_electricity",
    "subject": "science",
    "topic": "Electricity",
    "title": "Experiments and Observations on Electricity (Excerpt)",
    "author": "Benjamin Franklin",
    "year": 1751,
    "text": "It appears from many experiments that lightning is an electrical fire. When a pointed rod is elevated toward a thundercloud, sparks may be drawn from it; and if the rod be conducted to the earth, the lightning will often follow it rather than strike a building. Thus we may protect houses, ships, and magazines of powder by affixing to them metal rods which rise above the highest point and pass into the moist earth below. Electricity is not created by our machines, but collected and transferred. It may be positive or negative, and bodies become charged when these quantities are uneven. By understanding this fluid, we may turn a fearful natural phenomenon into a thing partially under human control.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Electricity",
    "label": "General"
  },
  {
    "id": "science_mary_somerville_physical_sciences",
    "subject": "science",
    "topic": "Scientific Synthesis",
    "title": "On the Connexion of the Physical Sciences (Excerpt)",
    "author": "Mary Somerville",
    "year": 1834,
    "text": "The various branches of science, though often studied apart, are in truth closely interwoven. Astronomy depends on mathematics; chemistry is aided by heat and electricity; geology borrows from astronomy when it considers the age and formation of the Earth. It is the object of this work to show that the laws discovered in one field frequently illuminate another. The perturbations of the planets, the tides of the ocean, the form of the Earth, the properties of light—all obey general principles. The more we compare, the more we perceive a unity of design and operation. Such a view not only enlarges the mind but encourages further inquiry, for it suggests that nature is intelligible and harmonious.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Scientific Synthesis",
    "label": "Astronomy"
  },
  {
    "id": "science_john_tyndall_scientific_imagination",
    "subject": "science",
    "topic": "Nature of Science",
    "title": "The Scientific Use of the Imagination (Excerpt)",
    "author": "John Tyndall",
    "year": 1870,
    "text": "The imagination, when disciplined by facts, is the architect of physical theory. We cannot see the waves of the ether, nor the atoms of chemistry, yet by imagining them in accordance with experiment we bridge the gulf between the visible and the invisible. This is not license to dream wildly; it is a trained and chastened imagination, checked at every step by observation. In this way, science advances: we form a mental picture, we test it, we correct it. Thus the mind grows in power, and nature yields her secrets. The scientist is not a mere collector of facts; he is a thinker who discerns the principles that bind the facts together.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Nature of Science",
    "label": "General"
  },
  {
    "id": "science_huxley_piece_of_chalk",
    "subject": "science",
    "topic": "Geology / Deep Time",
    "title": "On a Piece of Chalk (Excerpt)",
    "author": "Thomas H. Huxley",
    "year": 1868,
    "text": "If I take a piece of common chalk and ask what it is, the answer will lead us far back into the history of our planet. Chalk is composed almost entirely of the microscopic shells of minute sea-creatures which lived in an ocean that once covered a great part of Europe. Layer upon layer of these tiny organisms fell to the sea floor, forming beds thousands of feet thick. In time, these beds were uplifted, hardened, and now form the cliffs of Dover and the chalk downs of England. In that humble piece of chalk, therefore, we have the record of an ancient sea full of life, of slow deposit, of geological change. The world we see today is but the latest page of a very long book, and even the simplest substance may tell us of uncounted ages.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Geology / Deep Time",
    "label": "Astronomy"
  },
  {
    "id": "science_darwin_voyage_of_beagle",
    "subject": "science",
    "topic": "Natural History / Observation",
    "title": "Voyage of the Beagle (Galápagos Excerpt)",
    "author": "Charles Darwin",
    "year": 1839,
    "text": "The natural history of this archipelago is very remarkable: it seems to be a little world within itself. Most of the organic productions are aboriginal creations, found nowhere else. The birds, though closely allied to those of the American continent, are in many cases peculiar species. So it is with the reptiles and the plants. Seeing this, I was deeply impressed with the idea that species may not be immutable. Why should the Galápagos mockingbirds, for example, differ slightly from island to island, though all resemble the mainland form? Why should the tortoises bear marks by which an inhabitant can tell from which island they came? These facts seemed explicable if species had been modified by their conditions of life. The voyage thus planted in my mind the seeds of that later theory which I called natural selection.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Natural History / Observation",
    "label": "Evolution"
  },
  {
    "id": "science_muir_mountains_of_california",
    "subject": "science",
    "topic": "Ecology / Conservation",
    "title": "The Mountains of California (Excerpt)",
    "author": "John Muir",
    "year": 1894,
    "text": "When we try to pick out anything by itself, we find it hitched to everything else in the universe. Nowhere is this more visible than in the Sierra Nevada, where glacier-meadows, forests, and streams are bound together in one harmonious whole. The pines draw their life from the soil made by ancient ice; the waterfalls feed the ferns and lilies; the animals in their turn scatter seeds and keep the balance. To destroy the forests is to dry the fountains that feed the valleys. Nature’s beauty is not mere decoration, but a sign of health. I would have people go to the mountains not only for recreation but for instruction, to learn that man is only one of the Creator’s creatures and must live in sympathy with all the rest.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Ecology / Conservation",
    "label": "General"
  },
  {
    "id": "science_lamarck_zoological_philosophy",
    "subject": "science",
    "topic": "Early Evolutionary Thought",
    "title": "Zoological Philosophy (Excerpt)",
    "author": "Jean-Baptiste Lamarck",
    "year": 1809,
    "text": "No species has been formed all at once. Nature never makes leaps. From the simplest forms of life, produced by spontaneous generation in the earliest ages, there has been a slow and continual progress toward more complex organization. This progress is guided by two great laws: first, that the frequent use of any organ strengthens and develops it, while the disuse of it weakens and diminishes it; and second, that these acquired developments are transmitted to offspring. Thus, in a race of animals that has long been obliged to wade in water, the toes may spread and a membrane may form; in others, the neck may lengthen to reach leaves. Environment, need, and habit act together. Though later naturalists may improve upon this theory, I submit that it explains the great variety of living forms by natural causes rather than by separate acts of creation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Early Evolutionary Thought",
    "label": "Evolution"
  },
  {
    "id": "science_jj_thomson_corpuscles_of_electricity",
    "subject": "science",
    "topic": "Physics / Atomic Theory",
    "title": "Cathode Rays and the Corpuscle (Excerpt)",
    "author": "J. J. Thomson",
    "year": 1897,
    "text": "In studying the discharge of electricity through gases at low pressure, I observed that the rays coming from the cathode could be deflected by electric and magnetic fields. From these deflections I calculated the ratio of their mass to their charge and found it to be far smaller than that of the lightest atom known. The only reasonable inference was that these rays consist of particles, which I have called corpuscles, much smaller than atoms, and common to all kinds of matter. This discovery shows that the atom is not indivisible, as once supposed, but contains constituent parts. Electricity itself appears to be carried by these corpuscles. We are thus admitted, as it were, into the inner structure of matter, and we see that the differences between substances may be due to the arrangement of particles which are themselves identical.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Physics / Atomic Theory",
    "label": "Atomic Theory"
  },
  {
    "id": "science_asa_gray_structural_botany",
    "subject": "science",
    "topic": "Botany / Classification",
    "title": "Introduction to Structural Botany (Excerpt)",
    "author": "Asa Gray",
    "year": 1879,
    "text": "Plants, though fixed to the soil and silent, are not beyond the reach of orderly study. By examining the root, stem, leaf, flower, and fruit, we find constant patterns. The flower, which seems to be a mere ornament, is in fact an apparatus for reproduction. Its sepals, petals, stamens, and pistils are leaves transformed for special ends. By attending to these parts, we can distinguish families and genera as certainly as a zoologist distinguishes mammals from birds. This knowledge is not only for scholars; it enables the farmer and gardener to understand the habits of their crops and to improve them. The Creator has used few ideas in many combinations, and the botanist’s task is to trace these plans through the living green world.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Botany / Classification",
    "label": "General"
  },
  {
    "id": "science_powell_colorado_river_exploration",
    "subject": "science",
    "topic": "Geography / Exploration",
    "title": "Exploration of the Colorado River (Excerpt)",
    "author": "John Wesley Powell",
    "year": 1875,
    "text": "We pushed our boats into a region of the Earth that few had seen. The river, confined between walls of solid rock, ran with a force that seemed irresistible. On either side, cliffs rose in terraces of red, brown, and purple, telling the story of ages carved by water. Here the geologist reads a book whose leaves are miles thick. The canyons show that arid lands are shaped not only by wind and sun, but by sudden floods that cut deep trenches. I perceived that the American West could not be settled as the humid East had been. Its water is limited and must be measured, conserved, and shared with care. Thus exploration led not only to scientific knowledge but to a new policy for lands of scant rainfall.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Geography / Exploration",
    "label": "Geology"
  },
  {
    "id": "science_gifford_pinchot_conservation",
    "subject": "science",
    "topic": "Conservation / Public Lands",
    "title": "The Fight for Conservation (Excerpt)",
    "author": "Gifford Pinchot",
    "year": 1910,
    "text": "Conservation means the greatest good to the greatest number for the longest time. The forests, rivers, and minerals of the United States are not to be wasted for the profit of a few, but managed so that our children and our children’s children may have their share. Waste is not only a private fault; it is a public crime. Forests prevent floods, regulate streams, and furnish lumber. If they are cut recklessly, the soil washes away and whole valleys are ruined. The government, as trustee for the people, must see that these resources are used wisely. Conservation does not mean locking everything up; it means use without abuse—development joined to foresight.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Conservation / Public Lands",
    "label": "Ecology"
  },
  {
    "id": "science_herschel_outlines_of_astronomy",
    "subject": "science",
    "topic": "Astronomy",
    "title": "Outlines of Astronomy (Excerpt)",
    "author": "John F. W. Herschel",
    "year": 1849,
    "text": "When we lift our eyes to the heavens, we see not a mere scattering of lights but a system of bodies moving under precise laws. The planets describe ellipses about the sun; the satellites attend upon their primaries; comets sweep in from outer darkness and return at long intervals. By measuring angles and applying mathematics, we can predict eclipses, the return of comets, and the positions of the stars. Yet beyond the stars we see clouds of light, nebulae, which the telescope resolves in some cases into clusters of suns. Space thus appears to be peopled to an extent beyond the reach of imagination. The same law of gravitation binds all together. Astronomy teaches us at once the vastness of creation and the power of human reason, which, though dwelling on a small planet, can comprehend in part the architecture of the universe.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Astronomy",
    "label": "Astronomy"
  }
]