[
  {
    "id": "ss_lincoln_gettysburg",
    "subject": "social_studies",
    "topic": "Civil War",
    "title": "Gettysburg Address",
    "author": "Abraham Lincoln",
    "year": 1863,
    "text": "Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal. Now we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battlefield of that war. We have come to dedicate a portion of that field as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Civil War",
    "label": "General"
  },
  {
    "id": "ss_douglass_fourth_of_july",
    "subject": "social_studies",
    "topic": "Abolition and Freedom",
    "title": "What to the Slave Is the Fourth of July?",
    "author": "Frederick Douglass",
    "year": 1852,
    "text": "Fellow-citizens, pardon me, allow me to ask, why am I called upon to speak here today? What, to the American slave, is your Fourth of July? I answer; a day that reveals to him, more than all other days in the year, the gross injustice and cruelty to which he is the constant victim. Your celebration is a sham; your boasted liberty, an unholy license...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Abolition and Freedom",
    "label": "General"
  },
  {
    "id": "ss_washington_farewell",
    "subject": "social_studies",
    "topic": "Founding Era",
    "title": "Farewell Address (Excerpt)",
    "author": "George Washington",
    "year": 1796,
    "text": "Observe good faith and justice toward all nations; cultivate peace and harmony with all. Religion and morality enjoin this conduct, and can it be that good policy does not equally enjoin it? It will be worthy of a free, enlightened, and, at no distant period, a great nation to give to mankind the magnanimous and too novel example of a people always guided by an exalted justice and benevolence...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Founding Era",
    "label": "General"
  },
  {
    "id": "ss_jefferson_danbury",
    "subject": "social_studies",
    "topic": "Religious Freedom",
    "title": "Letter to the Danbury Baptists",
    "author": "Thomas Jefferson",
    "year": 1802,
    "text": "Believing with you that religion is a matter which lies solely between Man & his God, that he owes account to none other for his faith or his worship, that the legitimate powers of government reach actions only, & not opinions, I contemplate with sovereign reverence that act of the whole American people which declared that their legislature should 'make no law respecting an establishment of religion, or prohibiting the free exercise thereof,' thus building a wall of separation between Church & State.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Religious Freedom",
    "label": "General"
  },
  {
    "id": "ss_fdr_four_freedoms",
    "subject": "social_studies",
    "topic": "World War II",
    "title": "The Four Freedoms (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1941,
    "text": "In the future days, which we seek to make secure, we look forward to a world founded upon four essential human freedoms. The first is freedom of speech and expression—everywhere in the world. The second is freedom of every person to worship God in his own way—everywhere in the world. The third is freedom from want, which means economic understandings which will secure to every nation a healthy peacetime life for its inhabitants. The fourth is freedom from fear...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "World War II",
    "label": "General"
  },
  {
    "id": "ss_susanb_trial",
    "subject": "social_studies",
    "topic": "Women's Rights",
    "title": "Speech After Her Trial for Voting",
    "author": "Susan B. Anthony",
    "year": 1873,
    "text": "Friends and fellow citizens: I stand before you tonight under indictment for the alleged crime of having voted at the last presidential election, without having a lawful right to vote. It shall be my work this evening to prove to you that in thus voting, I not only committed no crime, but, instead, simply exercised my citizen’s rights, guaranteed to me and all United States citizens by the National Constitution...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Women's Rights",
    "label": "Constitution"
  },
  {
    "id": "ss_declaration_excerpt",
    "subject": "social_studies",
    "topic": "Independence",
    "title": "Declaration of Independence (Excerpt)",
    "author": "Thomas Jefferson et al.",
    "year": 1776,
    "text": "We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Independence",
    "label": "General"
  },
  {
    "id": "ss_sojourner_aint_i",
    "subject": "social_studies",
    "topic": "Women's Rights and Abolition",
    "title": "Ain’t I a Woman?",
    "author": "Sojourner Truth",
    "year": 1851,
    "text": "That man over there says that women need to be helped into carriages, and lifted over ditches, and to have the best place everywhere. Nobody ever helps me into carriages, or over mud-puddles, or gives me any best place! And ain’t I a woman? Look at me! Look at my arm! I have ploughed and planted, and gathered into barns, and no man could head me...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Women's Rights and Abolition",
    "label": "General"
  },
  {
    "id": "ss_franklin_constitution",
    "subject": "social_studies",
    "topic": "Constitutional Convention",
    "title": "Speech at the Constitutional Convention (Excerpt)",
    "author": "Benjamin Franklin",
    "year": 1787,
    "text": "I confess that I do not entirely approve of this Constitution at present; but, Sir, I am not sure I shall never approve it. For having lived long, I have experienced many instances of being obliged, by better information or fuller consideration, to change opinions even on important subjects, which I once thought right, but found to be otherwise...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Constitutional Convention",
    "label": "Constitution"
  },
  {
    "id": "ss_mlk_dream_excerpt",
    "subject": "social_studies",
    "topic": "Civil Rights Movement",
    "title": "I Have a Dream (Excerpt)",
    "author": "Martin Luther King Jr.",
    "year": 1963,
    "text": "I have a dream that one day this nation will rise up and live out the true meaning of its creed: 'We hold these truths to be self-evident, that all men are created equal.' I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character...",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "ged_passages.json",
    "area": "Civil Rights Movement",
    "label": "General"
  },
  {
    "id": "ss_passage_01",
    "subject": "social_studies",
    "topic": "Civil War",
    "title": "Gettysburg Address",
    "author": "Abraham Lincoln",
    "year": 1863,
    "text": "Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal. Now we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battlefield of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this. But, in a larger sense, we cannot dedicate—we cannot consecrate—we cannot hallow—this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Civil War",
    "label": "General"
  },
  {
    "id": "ss_lincoln_second_inaugural",
    "subject": "social_studies",
    "topic": "Civil War / Reconstruction",
    "title": "Second Inaugural Address (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1865,
    "text": "With malice toward none; with charity for all; with firmness in the right, as God gives us to see the right, let us strive on to finish the work we are in; to bind up the nation's wounds; to care for him who shall have borne the battle, and for his widow, and his orphan—to do all which may achieve and cherish a just and lasting peace among ourselves, and with all nations.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Civil War / Reconstruction",
    "label": "General"
  },
  {
    "id": "ss_frederick_douglass_what_to_the_slave",
    "subject": "social_studies",
    "topic": "Abolition",
    "title": "What to the Slave Is the Fourth of July? (Excerpt)",
    "author": "Frederick Douglass",
    "year": 1852,
    "text": "What, to the American slave, is your Fourth of July? I answer; a day that reveals to him, more than all other days in the year, the gross injustice and cruelty to which he is the constant victim. To him, your celebration is a sham; your boasted liberty, an unholy license; your national greatness, swelling vanity; your sounds of rejoicing are empty and heartless; your denunciation of tyrants, brass fronted impudence.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Abolition",
    "label": "General"
  },
  {
    "id": "ss_elizabeth_cady_stanton_seneca_falls",
    "subject": "social_studies",
    "topic": "Women's Rights",
    "title": "Declaration of Sentiments (Excerpt)",
    "author": "Elizabeth Cady Stanton",
    "year": 1848,
    "text": "We hold these truths to be self-evident: that all men and women are created equal; that they are endowed by their Creator with certain inalienable rights; that among these are life, liberty, and the pursuit of happiness; that to secure these rights governments are instituted, deriving their just powers from the consent of the governed.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Women's Rights",
    "label": "General"
  },
  {
    "id": "ss_chief_joseph_surrender",
    "subject": "social_studies",
    "topic": "Native American History",
    "title": "I Will Fight No More Forever",
    "author": "Chief Joseph",
    "year": 1877,
    "text": "Hear me, my chiefs! I am tired; my heart is sick and sad. From where the sun now stands, I will fight no more forever.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Native American History",
    "label": "General"
  },
  {
    "id": "ss_ida_b_wells_lynching",
    "subject": "social_studies",
    "topic": "Civil Rights / Anti-Lynching",
    "title": "Lynch Law in America (Excerpt)",
    "author": "Ida B. Wells-Barnett",
    "year": 1900,
    "text": "Our country’s national crime is lynching. It represents the cool, deliberate killing of human beings by mobs, often with the consent of the community. No nation can call itself civilized that allows such deeds to go unpunished.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Civil Rights / Anti-Lynching",
    "label": "General"
  },
  {
    "id": "ss_fdr_first_inaugural",
    "subject": "social_studies",
    "topic": "Great Depression",
    "title": "First Inaugural Address (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1933,
    "text": "So, first of all, let me assert my firm belief that the only thing we have to fear is fear itself—nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Great Depression",
    "label": "General"
  },
  {
    "id": "ss_booker_t_washington_atlanta",
    "subject": "social_studies",
    "topic": "Post–Civil War Era",
    "title": "Atlanta Exposition Address (Excerpt)",
    "author": "Booker T. Washington",
    "year": 1895,
    "text": "In all things that are purely social we can be as separate as the fingers, yet one as the hand in all things essential to mutual progress.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Post–Civil War Era",
    "label": "General"
  },
  {
    "id": "ss_thomas_jefferson_declaration_independence",
    "subject": "social_studies",
    "topic": "Founding Documents",
    "title": "Declaration of Independence (Excerpt)",
    "author": "Thomas Jefferson",
    "year": 1776,
    "text": "When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature’s God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed. Whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Founding Documents",
    "label": "General"
  },
  {
    "id": "ss_thomas_paine_common_sense",
    "subject": "social_studies",
    "topic": "American Revolution",
    "title": "Common Sense (Excerpt)",
    "author": "Thomas Paine",
    "year": 1776,
    "text": "Society in every state is a blessing, but government, even in its best state, is but a necessary evil; in its worst state an intolerable one. For when we suffer, or are exposed to the same miseries by a government which we might expect in a country without government, our calamity is heightened by reflecting that we furnish the means by which we suffer. Men do not change from good to bad merely by crossing the sea, yet kings claim dominion over others as though they were of a superior order of beings. It is not in numbers, but in unity, that our great strength lies. The cause of America is in a great measure the cause of all mankind. The sun never shone on a cause of greater worth. It is not the concern of a city, a county, or a province, but of a continent—of at least one-eighth part of the habitable globe.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "American Revolution",
    "label": "General"
  },
  {
    "id": "ss_frederick_douglass_autobiography",
    "subject": "social_studies",
    "topic": "Abolition / Slavery",
    "title": "Narrative of the Life of Frederick Douglass (Excerpt)",
    "author": "Frederick Douglass",
    "year": 1845,
    "text": "I have often been awakened at the dawn of day by the most heart-rending shrieks of an own aunt of mine, whom he used to tie up to a joist and whip upon her naked back till she was literally covered with blood. No words, no tears, no prayers, from his gory victim seemed to move his iron heart from its bloody purpose. The louder she screamed, the harder he whipped; and where the blood ran fastest, there he whipped longest. He would whip her to make her scream, and whip her to make her hush; and not until overcome by fatigue, would he cease to swing the blood-clotted cowskin. It struck me with awful force the power of slavery to brutalize both slave and master. I was often filled with unutterable loathing when I beheld him in the field, standing over the prostrate form of my aunt, and shouting in savage delight, as he lashed her quivering flesh.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Abolition / Slavery",
    "label": "Civil Rights"
  },
  {
    "id": "ss_sojourner_truth_womens_convention",
    "subject": "social_studies",
    "topic": "Women's Rights / Abolition",
    "title": "Ain’t I a Woman? (Full Speech)",
    "author": "Sojourner Truth",
    "year": 1851,
    "text": "Well, children, where there is so much racket there must be something out of kilter. I think that ’twixt the Negroes of the South and the women at the North, all talking about rights, the white men will be in a fix pretty soon. But what’s all this here talking about? That man over there says that women need to be helped into carriages and lifted over ditches and to have the best place everywhere. Nobody ever helps me into carriages, or over mud puddles, or gives me any best place! And ain’t I a woman? Look at me! I have ploughed and planted and gathered into barns, and no man could head me—and ain’t I a woman? I have borne thirteen children, and seen most all sold off to slavery, and when I cried out with my mother’s grief, none but Jesus heard me—and ain’t I a woman? Then they talk about this thing in the head; what’s that they call it? Intellect! That’s it. What’s that got to do with women’s rights or black folks’ rights? If my cup won’t hold but a pint, and yours holds a quart, wouldn’t you be mean not to let me have my little half measure full?",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Women's Rights / Abolition",
    "label": "Civil Rights"
  },
  {
    "id": "ss_booker_washington_up_from_slavery",
    "subject": "social_studies",
    "topic": "Post–Civil War Education",
    "title": "Up from Slavery (Excerpt)",
    "author": "Booker T. Washington",
    "year": 1901,
    "text": "I have begun everything with the idea that I was to make myself useful to others. The happiest people are those who do the most for others; the most miserable are those who do the least. In our work at Tuskegee we wanted to show that a race could rise, not by seeking favors, but by the performance of service that would make itself indispensable. No race that has anything to contribute to the markets of the world is long in any degree ostracized. I have found that if one makes himself useful to the world, people will find it hard to shut him out. We have a saying at Tuskegee that we must make ourselves so valuable that the world cannot get along without us. Industry, intelligence, and moral character are the keys to success. These are the tools that uplift a people far more than the clamor of political agitation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Post–Civil War Education",
    "label": "General"
  },
  {
    "id": "ss_washington_farewell_address",
    "subject": "social_studies",
    "topic": "Early Republic",
    "title": "Farewell Address (Excerpt)",
    "author": "George Washington",
    "year": 1796,
    "text": "The unity of government which constitutes you one people is also now dear to you. It is a main pillar in the edifice of your real independence, the support of your tranquillity at home, your peace abroad, your safety, your prosperity, and that very liberty which you so highly prize. But as it is easy to foresee that, from different causes and from different quarters, much pains will be taken to weaken in your minds the conviction of this truth, it is of infinite moment that you should properly estimate the immense value of your national union. You should cherish a cordial, habitual, and immovable attachment to it. Watch for its preservation with jealous anxiety; discountenance whatever may suggest even a suspicion that it can in any event be abandoned; and indignantly frown upon the first dawning of every attempt to alienate any portion of our country from the rest.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Early Republic",
    "label": "American Revolution"
  },
  {
    "id": "ss_jane_addams_hull_house",
    "subject": "social_studies",
    "topic": "Progressive Era / Social Reform",
    "title": "Twenty Years at Hull-House (Excerpt)",
    "author": "Jane Addams",
    "year": 1910,
    "text": "The Settlement idea was born of the conviction that the social relation is the basis of the social order. It rests upon the simple belief that by living among the poor and sharing in their daily life, one can understand and help to remedy the causes of poverty. When we opened Hull-House, we were criticized by those who said that the poor prefer money to sympathy. Yet experience showed that human fellowship itself is the beginning of reform. We discovered that the needs of our neighbors were not only material but moral and spiritual. Their sense of powerlessness was often greater than their hunger. The Settlement is, at bottom, a protest against the notion that charity can be measured in alms. It insists that the only real help must come from a deep sense of equality and cooperation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Progressive Era / Social Reform",
    "label": "General"
  },
  {
    "id": "ss_w_e_b_du_bois_souls_black_folk",
    "subject": "social_studies",
    "topic": "Civil Rights / Sociology",
    "title": "The Souls of Black Folk (Excerpt)",
    "author": "W. E. B. Du Bois",
    "year": 1903,
    "text": "Between me and the other world there is ever an unasked question: how does it feel to be a problem? Being a problem is a strange experience for one born in a land that prides itself on liberty. It is a peculiar sensation, this double-consciousness, this sense of always looking at one’s self through the eyes of others. One ever feels his two-ness—an American, a Negro; two souls, two thoughts, two unreconciled strivings; two warring ideals in one dark body. The history of the American Negro is the history of this strife—of longing to merge his double self into a better and truer self. He wishes to make it possible for a man to be both a Negro and an American, without having the doors of opportunity closed roughly in his face.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Civil Rights / Sociology",
    "label": "General"
  },
  {
    "id": "ss_lincoln_house_divided",
    "subject": "social_studies",
    "topic": "Pre–Civil War Politics",
    "title": "A House Divided (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1858,
    "text": "A house divided against itself cannot stand. I believe this government cannot endure permanently half slave and half free. I do not expect the Union to be dissolved—I do not expect the house to fall—but I do expect it will cease to be divided. It will become all one thing or all the other. Either the opponents of slavery will arrest the further spread of it, and place it where the public mind shall rest in the belief that it is in course of ultimate extinction; or its advocates will push it forward, till it shall become alike lawful in all the States, old as well as new, North as well as South. This is the real issue that now overshadows all others. It is not merely a political difference but a moral one, for it concerns the rights of men and the meaning of liberty in a republic.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Pre–Civil War Politics",
    "label": "Civil Rights"
  },
  {
    "id": "ss_thoreau_civil_disobedience",
    "subject": "social_studies",
    "topic": "Reform / Citizenship",
    "title": "Civil Disobedience (Excerpt)",
    "author": "Henry David Thoreau",
    "year": 1849,
    "text": "I heartily accept the motto, \"That government is best which governs least\"; and I should like to see it acted up to more rapidly and systematically. Yet government itself, never of itself, furthers any enterprise, but sometimes hinders it. The authority of government, even when well intentioned, becomes unjust when it requires a man to be the agent of injustice to another. When the State imprisons a man for refusing to support slavery or an unjust war, it is the State that has lost its claim to obedience. Under a government which imprisons any unjustly, the true place for a just man is also a prison. I do not ask for no government, but for a better government. And when people are prepared for it, that will be the kind of government they will have, for government is only the expression of the will of the people.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reform / Citizenship",
    "label": "Civil Rights"
  },
  {
    "id": "ss_andrew_carnegie_wealth",
    "subject": "social_studies",
    "topic": "Industrialization / Gilded Age",
    "title": "Wealth (Gospel of Wealth Excerpt)",
    "author": "Andrew Carnegie",
    "year": 1889,
    "text": "The problem of our age is the proper administration of wealth, so that the ties of brotherhood may still bind together the rich and poor in harmonious relationship. The modern industrial system has made possible fortunes of a size never before known in human history. Such fortunes cannot be used for mere personal satisfaction without injury to the society from which they came. I hold that the man who dies rich dies disgraced. The duty of the man of wealth is threefold: first, to live modestly; second, to provide for the legitimate wants of those dependent upon him; and third, to consider all surplus revenues as a trust fund to be administered for the good of the community. Public libraries, schools, parks, and institutions for research are proper channels for such benefactions. In this way, wealth is returned to the people in forms that uplift and educate.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Industrialization / Gilded Age",
    "label": "General"
  },
  {
    "id": "ss_john_osullivan_manifest_destiny",
    "subject": "social_studies",
    "topic": "Westward Expansion",
    "title": "Annexation (Manifest Destiny Excerpt)",
    "author": "John L. O'Sullivan",
    "year": 1845,
    "text": "It is our manifest destiny to overspread the continent allotted by Providence for the free development of our yearly multiplying millions. The truth is not that we are seeking to escape from duty to other nations, but that we are fulfilling a duty to civilization itself. The American system is one of liberty and equality, and it is our belief that such a system must eventually embrace the whole continent. When we extend our institutions westward, we are not merely acquiring territory; we are advancing the cause of self-government. Opposition to this movement is often the work of jealous European powers who do not understand the vigor and youthful strength of our republic. Our claim does not rest upon conquest alone, but upon the higher ground of spreading the blessings of freedom.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Westward Expansion",
    "label": "General"
  },
  {
    "id": "ss_theodore_roosevelt_muckrake",
    "subject": "social_studies",
    "topic": "Progressive Era",
    "title": "The Man with the Muck-Rake (Excerpt)",
    "author": "Theodore Roosevelt",
    "year": 1906,
    "text": "In every community there are evils which must be exposed and corrected. The man who points out these wrongs is often a public benefactor. But there is another type of critic who never sees anything but what is foul. He is like the man in Bunyan's allegory who could look no way but downward with the muck-rake in his hand. Such a man misses the things of higher worth. The reformer must not become so enamored of denunciation that he forgets to build. To attack corruption is good; to create honest government is better. The nation needs fearless criticism, but it also needs the spirit of justice which recognizes achievement and supports constructive effort. Progress cannot be made by tearing down alone; it requires the patient work of setting up what is better.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Progressive Era",
    "label": "General"
  },
  {
    "id": "ss_woodrow_wilson_war_message",
    "subject": "social_studies",
    "topic": "World War I",
    "title": "War Message to Congress (Excerpt)",
    "author": "Woodrow Wilson",
    "year": 1917,
    "text": "The present German submarine warfare against commerce is a warfare against mankind. It is a war against all nations. American ships have been sunk, American lives taken, in ways that have stirred us very deeply. We are accepting this challenge of hostile purpose because we know that in such a government, following such methods, there can be no assured security. The world must be made safe for democracy. Its peace must be planted upon the tested foundations of political liberty. We have no selfish ends to serve. We desire no conquest, no dominion. We seek no indemnities for ourselves, no material compensation for the sacrifices we shall freely make. It is a fearful thing to lead this great peaceful people into war, but the right is more precious than peace, and we shall fight for the rights of nations great and small.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "World War I",
    "label": "General"
  },
  {
    "id": "ss_federalist_10_madison",
    "subject": "social_studies",
    "topic": "Constitution / Government",
    "title": "Federalist No. 10 (Excerpt)",
    "author": "James Madison",
    "year": 1787,
    "text": "Among the numerous advantages promised by a well-constructed union, none deserves to be more accurately developed than its tendency to break and control the violence of faction. By a faction, I mean a number of citizens, whether amounting to a majority or minority of the whole, who are united by some common impulse of passion or of interest adverse to the rights of other citizens or to the permanent and aggregate interests of the community. The latent causes of faction are sown in the nature of man. The inference to which we are brought is, that the causes of faction cannot be removed; and that relief is only to be sought in the means of controlling its effects. A large republic, composed of many interests and opinions, makes it harder for a single faction to oppress the rest, and thus better secures liberty.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Constitution / Government",
    "label": "General"
  },
  {
    "id": "ss_mary_church_terrell_colored_american_woman",
    "subject": "social_studies",
    "topic": "African American History / Women's Rights",
    "title": "What It Means to Be Colored in the Capital of the United States (Excerpt)",
    "author": "Mary Church Terrell",
    "year": 1898,
    "text": "In Washington, which ought to be the freest and most enlightened city in the country, a colored woman finds herself restricted at every turn. She may be educated, refined, and upright in character; yet there are public places from which she is excluded solely because of her race. She may be compelled to ride in a certain car, to eat in a certain place, to accept discourtesy where others receive welcome. The humiliation of this treatment is not easily described. Nevertheless, colored women, by patient effort and unshaken faith, have built schools, churches, and clubs. They have worked for the uplift of their homes and for the protection of their children. They have proven that character is not a matter of color. The time must come when the nation will measure its citizens by their worth, not by the shade of their skin.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "African American History / Women's Rights",
    "label": "General"
  },
  {
    "id": "ss_patrick_henry_liberty_or_death",
    "subject": "social_studies",
    "topic": "American Revolution / Persuasive Speech",
    "title": "Speech in the Virginia Convention (Give Me Liberty)",
    "author": "Patrick Henry",
    "year": 1775,
    "text": "Mr. President, it is natural to man to indulge in the illusions of hope. We are apt to shut our eyes against a painful truth and listen to the song of that siren till she transforms us into beasts. Is this the part of wise men, engaged in a great and arduous struggle for liberty? Are we disposed to be numbered among those who, having eyes, see not, and having ears, hear not the things which so nearly concern their temporal salvation? For my part, whatever anguish of spirit it may cost, I am willing to know the whole truth; to know the worst, and to provide for it. We have petitioned, we have remonstrated, we have supplicated; our petitions have been slighted, our remonstrances have produced additional violence and insult. There is no longer any room for hope. The war is actually begun! Our brethren are already in the field! The next gale that sweeps from the north will bring to our ears the clash of resounding arms! I know not what course others may take; but as for me, give me liberty or give me death!",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "American Revolution / Persuasive Speech",
    "label": "General"
  },
  {
    "id": "ss_samuel_adams_rights_of_colonists",
    "subject": "social_studies",
    "topic": "Colonial Rights / Natural Rights",
    "title": "The Rights of the Colonists (Excerpt)",
    "author": "Samuel Adams",
    "year": 1772,
    "text": "Among the natural rights of the colonists are these: First, a right to life; secondly, to liberty; thirdly, to property; together with the right to support and defend them in the best manner they can. These are evident branches of, rather than deductions from, the duty of self-preservation, commonly called the first law of nature. All men have a right to remain in a state of nature as long as they please; and in case of intolerable oppression, civil or religious, to leave the society they belong to, and enter into another. The right to freedom being the gift of God Almighty, it is not in the power of any man or body of men to honestly give away or take away this right. Government was designed for the happiness of the people, and whenever it becomes destructive of that end, it is the unquestionable right of the people to alter or abolish it and to institute new government.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Colonial Rights / Natural Rights",
    "label": "General"
  },
  {
    "id": "ss_susan_b_anthony_is_it_a_crime",
    "subject": "social_studies",
    "topic": "Women's Suffrage",
    "title": "Is It a Crime for a U.S. Citizen to Vote? (Excerpt)",
    "author": "Susan B. Anthony",
    "year": 1873,
    "text": "Friends and fellow citizens, I stand before you tonight under indictment for the alleged crime of having voted at the last presidential election, without having a lawful right to vote. It shall be my work this evening to prove to you that in thus voting, I not only committed no crime, but, instead, simply exercised my citizen’s right, guaranteed to me and all United States citizens by the National Constitution. The preamble of the Constitution says, “We, the people,” not we, the white male citizens, nor we, the male citizens, but we, the whole people. And being one of the people, I am a citizen; and as a citizen, I am entitled to vote. If the government can deny one half of the people this fundamental right, then no liberty is secure. The law should not make criminals of women for doing what would be praised in men.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Women's Suffrage",
    "label": "Constitution"
  },
  {
    "id": "ss_lincoln_lyceum_address",
    "subject": "social_studies",
    "topic": "Rule of Law / Early Lincoln",
    "title": "The Perpetuation of Our Political Institutions (Lyceum Address Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1838,
    "text": "At what point shall we expect the approach of danger? By what means shall we fortify against it? Shall we expect some transatlantic military giant to step the ocean and crush us at a blow? Never! All the armies of Europe, Asia and Africa combined could not by force take a drink from the Ohio, or make a track on the Blue Ridge, in a trial of a thousand years. At what point then is the approach of danger to be expected? I answer, if it ever reach us, it must spring up amongst us. If destruction be our lot, we must ourselves be its author and finisher. As a nation of freemen we must live through all time, or die by suicide. Let reverence for the laws be breathed by every American mother to the lisping babe, taught in schools, and enforced in courts, so that no man shall set himself above the law.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Rule of Law / Early Lincoln",
    "label": "General"
  },
  {
    "id": "ss_theodore_roosevelt_new_nationalism",
    "subject": "social_studies",
    "topic": "Progressive Reform",
    "title": "The New Nationalism (Excerpt)",
    "author": "Theodore Roosevelt",
    "year": 1910,
    "text": "The New Nationalism puts the national need before sectional or personal advantage. It demands of the government a positive role in promoting social justice. The object of government is the welfare of the people. The citizens of the United States must effectively control the mighty commercial forces which they have themselves called into being. Whenever these forces become so great that they dominate instead of serving the people, the people have the right and duty to regulate them. We must protect the working man, we must protect women and children, and we must insist that property shall be the servant and not the master of the commonwealth. This is not hostility to wealth, but insistence that the common good stands above private profit.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Progressive Reform",
    "label": "General"
  },
  {
    "id": "ss_wilson_fourteen_points",
    "subject": "social_studies",
    "topic": "World War I / Internationalism",
    "title": "Fourteen Points (Excerpt)",
    "author": "Woodrow Wilson",
    "year": 1918,
    "text": "What we demand in this war is nothing peculiar to ourselves. It is that the world be made fit and safe to live in; and particularly that it be made safe for every peace-loving nation which, like our own, wishes to live its own life. Open covenants of peace, freedom of navigation, the removal of economic barriers, and the reduction of armaments—these are the foundations of a just peace. Peoples must be allowed to determine their own political future. An association of nations must be formed under specific covenants for the purpose of affording mutual guarantees of political independence and territorial integrity to great and small states alike. Only on such a basis can the sacrifices of war be justified.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "World War I / Internationalism",
    "label": "American Revolution"
  },
  {
    "id": "ss_henry_grady_new_south",
    "subject": "social_studies",
    "topic": "Reconstruction / New South",
    "title": "The New South (Excerpt)",
    "author": "Henry W. Grady",
    "year": 1886,
    "text": "We have let economy take root in our soil and peace brood over our homes. The Old South rested everything on slavery and agriculture, unconscious that these could neither give nor maintain healthy growth. The New South presents a perfect democracy; a social system compact and closely knitted, less splendid on the surface, but stronger at the core. The New South is building cotton mills beside the fields where the cotton grows; it is diversifying crops, educating its children, and inviting capital, not by servility, but by showing that it can stand on its own. We are not surrendering the memories of the past, but we are determined to make the future more glorious than the past by industry, education, and reconciliation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reconstruction / New South",
    "label": "Civil Rights"
  },
  {
    "id": "ss_niagara_movement_declaration",
    "subject": "social_studies",
    "topic": "Early Civil Rights",
    "title": "Declaration of Principles of the Niagara Movement (Excerpt)",
    "author": "Niagara Movement Members (incl. W. E. B. Du Bois)",
    "year": 1905,
    "text": "We believe that this country is ours, not by gracious favor, but by sheer hard-earned right. We claim for ourselves every single right that belongs to a freeborn American—political, civil, and social—and until we get these rights we will never cease to protest. We want full manhood suffrage, and we want it now. We want the abolition of all caste distinctions based simply on race and color. We want the right to labor and the right to learn. We protest against common school systems separate and unequal; against the curtailment of our civil rights by intimidation and violence. We especially complain against the denial of justice in the courts and the frequent lynching of our brothers. America must be American for all her citizens.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Early Civil Rights",
    "label": "Civil Rights"
  },
  {
    "id": "ss_hamilton_report_on_manufactures",
    "subject": "social_studies",
    "topic": "Early Republic / Economic Policy",
    "title": "Report on Manufactures (Excerpt)",
    "author": "Alexander Hamilton",
    "year": 1791,
    "text": "The wealth, independence, and security of a nation are materially connected with the prosperity of manufactures. Agriculture may indeed be the most necessary and primary of pursuits, but to rely on it alone is to leave the nation exposed to the fluctuations of foreign markets and the caprice of other powers. A broad and well-planned encouragement of manufactures will draw into useful employment those classes of people who are not profitably engaged, will create a home market for the produce of our farmers, and will diversify the industry of the United States. It is not true that agriculture and manufactures are rivals; they are, rather, mutual aids. Where there is a thriving manufacturing class, farmers find steady purchasers; where there is only agriculture, periods of glut and want of demand must occur. Therefore, it is the proper task of government to remove obstacles, to foster inventions, to encourage skill, and in some cases to protect young industries until they are able to stand by their own strength.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Early Republic / Economic Policy",
    "label": "American Revolution"
  },
  {
    "id": "ss_angelina_grimke_appeal_to_christian_women",
    "subject": "social_studies",
    "topic": "Abolition / Women's Reform",
    "title": "An Appeal to the Christian Women of the South (Excerpt)",
    "author": "Angelina Grimké",
    "year": 1836,
    "text": "Sisters in Christ, you live in the midst of a people who hold in bondage more than two millions of human beings, men and women created in the image of the same God who made you. You have been taught that this system is sanctioned by Scripture and approved by heaven, but I beseech you to search the Scriptures for yourselves. You will find that the God of the Bible hears the cry of the oppressed and condemns the hands that shed innocent blood. You feel that as women you can do little, but it is not so. You can read, you can pray, you can teach your children that slavery is a sin; you can refuse to be silent. Influence is not measured by loudness, but by faithfulness. If Southern Christian women were to rise up and declare, in the name of the gospel of love, that they will no longer be parties to the wrong, slavery would totter. Duty is ours, results are God’s.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Abolition / Women's Reform",
    "label": "Civil Rights"
  },
  {
    "id": "ss_olaudah_equiano_narrative_middle_passage",
    "subject": "social_studies",
    "topic": "Slavery / Atlantic World",
    "title": "The Interesting Narrative (Middle Passage Excerpt)",
    "author": "Olaudah Equiano",
    "year": 1789,
    "text": "I now saw myself confined in a world of wonders. The stench of the hold was so intolerably loathsome that it was dangerous to remain there for any time, and some of the Africans were permitted to stay on deck for the air. The closeness of the place, and the heat of the climate, added to the number of our companions, almost suffocated us. The shrieks of the women and the groans of the dying rendered the whole a scene of horror almost inconceivable. I was soon put down under the decks, and there I received such a salutation in my nostrils as I had never experienced in my life: the air soon became unfit for respiration, from a variety of loathsome smells, and brought on a sickness among the slaves, of which many died. It was then I first saw the sign of despair among my countrymen, chained and crowded, kept alive only for the profit of their captors.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Slavery / Atlantic World",
    "label": "General"
  },
  {
    "id": "ss_red_jacket_religion_of_the_white_men",
    "subject": "social_studies",
    "topic": "Native American Diplomacy",
    "title": "Religion for the White Man and the Red (Speech Excerpt)",
    "author": "Red Jacket (Sagoyewatha)",
    "year": 1805,
    "text": "Brother, you say there is but one way to worship and serve the Great Spirit. If there is but one religion, why do you white people differ so much about it? Why not all agree, as you can all read the same book? We are told that your religion was given to your forefathers, and has been handed down from father to son. We also have a religion, which was given to our forefathers, and has been handed down to us, their children. We worship that way. It teaches us to be thankful for all the gifts we receive, to love each other, and to live in peace. We never quarrel about religion. We do not want to destroy your religion or take it from you. We only want to enjoy our own. The Great Spirit made us all, but he gave us different ways. Since he has made so many paths, we will walk in the one he gave to our nation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Native American Diplomacy",
    "label": "General"
  },
  {
    "id": "ss_henry_clay_american_system",
    "subject": "social_studies",
    "topic": "Economic Development / Internal Improvements",
    "title": "On the American System (Excerpt)",
    "author": "Henry Clay",
    "year": 1824,
    "text": "The object of the American System is not to build up one part of the country at the expense of another, but to bind all sections together in a web of mutual interest. By protecting our manufactures, we give employment to our citizens, increase the home market for our farmers, and lessen our dependence on foreign nations. By constructing roads, canals, and other internal improvements, we open channels through which the products of the West may flow to the East, and the goods of the East may reach the West. A nation so extended as ours cannot rely on chance for its union; it must knit itself with works of art and policy. Let us, then, cherish domestic industry, encourage enterprise, and make the government the handmaid of national prosperity.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Economic Development / Internal Improvements",
    "label": "General"
  },
  {
    "id": "ss_thaddeus_stevens_reconstruction",
    "subject": "social_studies",
    "topic": "Reconstruction",
    "title": "Speech on Reconstruction (Excerpt)",
    "author": "Thaddeus Stevens",
    "year": 1867,
    "text": "The foundation of every government is the consent of the governed, and that consent is a mockery if given only by the triumphant race while the men who have borne the heaviest burdens of war are denied a voice. The freedmen of the South have been loyal to the Union; they have tilled the fields, guided our armies, and suffered violence for our sake. To restore the late rebel States without securing the rights of these men is to betray justice. We must remake Southern society on the basis of equal civil and political rights. Land, education, and the ballot—these are the safeguards of liberty. Until the old ruling class is restrained and loyal governments are established, Congress must exercise its constitutional power and protect the weak from the oppression of the strong.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Reconstruction",
    "label": "General"
  },
  {
    "id": "ss_carl_schurz_american_imperialism",
    "subject": "social_studies",
    "topic": "Foreign Policy / Imperialism",
    "title": "American Imperialism (Speech Excerpt)",
    "author": "Carl Schurz",
    "year": 1899,
    "text": "I am opposed to an American colonial policy because I am an American. Our nation was born of the declaration that governments derive their just powers from the consent of the governed. If we hold subject peoples in distant islands without their consent, we deny in practice the principle that is our pride in theory. Empire abroad will corrupt liberty at home. Armies and navies maintained to subdue others will sooner or later be used to overawe our own citizens. Our glory has lain in presenting to the world the example of a great republic, peaceful, prosperous, and free. Let us not tarnish it by imitating the old powers of Europe. Our best expansion is the expansion of our ideals.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Foreign Policy / Imperialism",
    "label": "American Revolution"
  },
  {
    "id": "ss_frances_willard_home_protection",
    "subject": "social_studies",
    "topic": "Temperance / Women's Activism",
    "title": "Home Protection and Temperance (Excerpt)",
    "author": "Frances E. Willard",
    "year": 1883,
    "text": "There is no spot on Earth so sacred to a woman as the home, and there is no enemy so cruel to that home as the traffic in strong drink. It is the mother who must look into the eyes of hungry children when the father’s wages have been spent at the saloon. It is the wife who must bear the violence and neglect which follow in the train of drunkenness. Yet the law which licenses this evil is made without her consent. We therefore demand the ballot, not to unsex ourselves, but to protect the home. Temperance is not merely a private virtue; it is a public necessity. If the State will legalize a business that destroys men’s bodies and souls, then women, who suffer most from it, must have a voice in saying whether it shall continue.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "New ged passages.json",
    "area": "Temperance / Women's Activism",
    "label": "General"
  },
  {
    "id": "ss_jfk_inaugural_1961",
    "subject": "social_studies",
    "topic": "Government / Democracy",
    "title": "Inaugural Address (1961 Excerpt)",
    "author": "John F. Kennedy",
    "year": 1961,
    "text": "Let every nation know, whether it wishes us well or ill, that we shall pay any price, bear any burden, meet any hardship, support any friend, oppose any foe to assure the survival and the success of liberty. Ask not what your country can do for you; ask what you can do for your country.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Government / Democracy",
    "label": "Constitution"
  },
  {
    "id": "ss_lbj_voting_rights_1965",
    "subject": "social_studies",
    "topic": "Civil Rights / Government",
    "title": "Special Message to Congress: Voting Rights (Excerpt)",
    "author": "Lyndon B. Johnson",
    "year": 1965,
    "text": "Their cause must be our cause too. Because it is not just Negroes, but really it is all of us, who must overcome the crippling legacy of bigotry and injustice. And we shall overcome.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Civil Rights / Government",
    "label": "Civil Rights"
  },
  {
    "id": "ss_reagan_first_inaugural_1981",
    "subject": "social_studies",
    "topic": "Government / Economy",
    "title": "First Inaugural Address (1981 Excerpt)",
    "author": "Ronald Reagan",
    "year": 1981,
    "text": "In this present crisis, government is not the solution to our problem; government is the problem. It is time to check and reverse the growth of government which shows signs of having grown beyond the consent of the governed.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Government / Economy",
    "label": "Constitution"
  },
  {
    "id": "ss_obama_inaugural_2009",
    "subject": "social_studies",
    "topic": "Government / Citizenship",
    "title": "First Inaugural Address (2009 Excerpt)",
    "author": "Barack Obama",
    "year": 2009,
    "text": "Starting today, we must pick ourselves up, dust ourselves off, and begin again the work of remaking America. What is required of us now is a new era of responsibility, a recognition, on the part of every American, that we have duties to ourselves, our nation, and the world.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "Government / Citizenship",
    "label": "General"
  },
  {
    "id": "ss_trump_inaugural_2017",
    "subject": "social_studies",
    "topic": "Government / Federal Power",
    "title": "Inaugural Address (2017 Excerpt)",
    "author": "Donald J. Trump",
    "year": 2017,
    "text": "Today we are not merely transferring power from one administration to another, or from one party to another, but we are transferring power from Washington, D.C., and giving it back to you, the people.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "Government / Federal Power",
    "label": "General"
  },
  {
    "id": "ss_lincoln_cooper_union_1860",
    "subject": "social_studies",
    "topic": "Government / Constitution",
    "title": "Cooper Union Address (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1860,
    "text": "Let us have faith that right makes might, and in that faith, let us, to the end, dare to do our duty as we understand it.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Government / Constitution",
    "label": "Constitution"
  },
  {
    "id": "ss_fdr_second_bill_of_rights_1944",
    "subject": "social_studies",
    "topic": "Rights / Government / Economy",
    "title": "State of the Union: Second Bill of Rights (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1944,
    "text": "True individual freedom cannot exist without economic security and independence. Necessitous men are not free men. We have accepted, so to speak, a second Bill of Rights under which a new basis of security and prosperity can be established for all.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Rights / Government / Economy",
    "label": "Constitution"
  },
  {
    "id": "ss_dwight_eisenhower_farewell_1961",
    "subject": "social_studies",
    "topic": "Government / Defense Policy",
    "title": "Farewell Address (Military-Industrial Complex Excerpt)",
    "author": "Dwight D. Eisenhower",
    "year": 1961,
    "text": "In the councils of government, we must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military-industrial complex.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Government / Defense Policy",
    "label": "General"
  },
  {
    "id": "ss_fdr_commonwealth_club_1932",
    "subject": "social_studies",
    "topic": "Government / Democracy",
    "title": "Commonwealth Club Address (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1932,
    "text": "The task of statesmanship has always been the redefinition of rights in terms of a changing and growing social order. Government has an obligation to make possible a wider freedom for the average man.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Government / Democracy",
    "label": "General"
  },
  {
    "id": "ss_fdr_quarantine_speech_1937",
    "subject": "social_studies",
    "topic": "Foreign Policy / International",
    "title": "Quarantine Speech (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1937,
    "text": "When an epidemic of physical disease starts to spread, the community approves and joins in a quarantine of the patients in order to protect the health of the community against the spread of the disease.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Foreign Policy / International",
    "label": "General"
  },
  {
    "id": "ss_fdr_day_of_infamy_1941",
    "subject": "social_studies",
    "topic": "World War / U.S. History",
    "title": "Day of Infamy Address (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1941,
    "text": "Yesterday, December 7, 1941—a date which will live in infamy—the United States of America was suddenly and deliberately attacked by naval and air forces of the Empire of Japan.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "World War / U.S. History",
    "label": "General"
  },
  {
    "id": "ss_truman_march_1947",
    "subject": "social_studies",
    "topic": "Foreign Policy / International",
    "title": "Address to Congress on Greece and Turkey (Excerpt)",
    "author": "Harry S. Truman",
    "year": 1947,
    "text": "I believe that it must be the policy of the United States to support free peoples who are resisting attempted subjugation by armed minorities or by outside pressures.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Foreign Policy / International",
    "label": "General"
  },
  {
    "id": "ss_james_monroe_1823",
    "subject": "social_studies",
    "topic": "Foreign Policy / Hemisphere",
    "title": "Seventh Annual Message (Monroe Doctrine Excerpt)",
    "author": "James Monroe",
    "year": 1823,
    "text": "The American continents, by the free and independent condition which they have assumed and maintain, are henceforth not to be considered as subjects for future colonization by any European powers.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Foreign Policy / Hemisphere",
    "label": "General"
  },
  {
    "id": "ss_washington_neutrality_1793",
    "subject": "social_studies",
    "topic": "Foreign Policy / Government",
    "title": "Neutrality Proclamation (Excerpt)",
    "author": "George Washington",
    "year": 1793,
    "text": "It appears that a state of war exists between certain powers with whom the United States are in amity; and the duty and interest of the United States require that they should with sincerity and good faith adopt and pursue a conduct friendly and impartial toward the belligerent powers.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Foreign Policy / Government",
    "label": "General"
  },
  {
    "id": "ss_lincoln_greeley_1862",
    "subject": "social_studies",
    "topic": "Civil War / Executive Power",
    "title": "Letter to Horace Greeley (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1862,
    "text": "My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Civil War / Executive Power",
    "label": "General"
  },
  {
    "id": "ss_emancipation_proclamation_1863",
    "subject": "social_studies",
    "topic": "Civil Rights / Civil War",
    "title": "Emancipation Proclamation (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1863,
    "text": "All persons held as slaves within said designated States, and parts of States, are, and henceforward shall be free.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Civil Rights / Civil War",
    "label": "Civil Rights"
  },
  {
    "id": "ss_frederick_douglass_west_india_1857",
    "subject": "social_studies",
    "topic": "Abolition / Citizenship",
    "title": "Emancipation in the West Indies (Excerpt)",
    "author": "Frederick Douglass",
    "year": 1857,
    "text": "If there is no struggle there is no progress. Those who profess to favor freedom and yet deprecate agitation are men who want crops without plowing up the ground.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Abolition / Citizenship",
    "label": "Civil Rights"
  },
  {
    "id": "ss_mlk_birmingham_1963",
    "subject": "social_studies",
    "topic": "Civil Rights / Law",
    "title": "Letter from Birmingham Jail (Excerpt)",
    "author": "Martin Luther King Jr.",
    "year": 1963,
    "text": "Injustice anywhere is a threat to justice everywhere. We are caught in an inescapable network of mutuality, tied in a single garment of destiny.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "Civil Rights / Law",
    "label": "Civil Rights"
  },
  {
    "id": "ss_womens_rights_lucy_stone_1855",
    "subject": "social_studies",
    "topic": "Rights / Citizenship",
    "title": "Speech at the National Women's Rights Convention (Excerpt)",
    "author": "Lucy Stone",
    "year": 1855,
    "text": "We seek no special favor, no special privilege. We ask justice, we ask equality, we ask that all the civil and political rights that belong to citizens belong to women also.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Rights / Citizenship",
    "label": "Constitution"
  },
  {
    "id": "ss_grimke_equality_1838",
    "subject": "social_studies",
    "topic": "Civil Rights / Equality",
    "title": "Letters on the Equality of the Sexes (Excerpt)",
    "author": "Sarah M. Grimké",
    "year": 1838,
    "text": "I ask no favors for my sex. All I ask of our brethren is that they take their feet off our necks and permit us to stand upright on that ground which God designed us to occupy.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Civil Rights / Equality",
    "label": "Civil Rights"
  },
  {
    "id": "ss_jane_addams_peace_1915",
    "subject": "social_studies",
    "topic": "International / Peace",
    "title": "Address on Peace and International Cooperation (Excerpt)",
    "author": "Jane Addams",
    "year": 1915,
    "text": "The world cannot be brought to enduring peace by military methods alone. Lasting security must rest upon justice between nations and cooperation among peoples.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "International / Peace",
    "label": "General"
  },
  {
    "id": "ss_gompers_labor_1886",
    "subject": "social_studies",
    "topic": "Economy / Labor",
    "title": "Labor Convention Address (Excerpt)",
    "author": "Samuel Gompers",
    "year": 1886,
    "text": "The mission of labor is to secure for the workers of this nation a fair share of the wealth they create, better wages, shorter hours, and conditions consistent with human dignity.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Labor",
    "label": "General"
  },
  {
    "id": "ss_eugene_debs_labor_1903",
    "subject": "social_studies",
    "topic": "Economy / Labor",
    "title": "Speech on Labor and Industrial Democracy (Excerpt)",
    "author": "Eugene V. Debs",
    "year": 1903,
    "text": "So long as there is a lower class, I am in it; while there is a criminal element, I am of it; and while there is a soul in prison, I am not free.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Labor",
    "label": "General"
  },
  {
    "id": "ss_fdr_fireside_banking_1933",
    "subject": "social_studies",
    "topic": "Economy / Banking",
    "title": "First Fireside Chat on Banking (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1933,
    "text": "When you deposit money in a bank the bank does not put the money into a safe deposit vault. It invests your money in many different forms of credit and in securities. What, then, happened during the last few days of February and the first few days of March?",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Banking",
    "label": "General"
  },
  {
    "id": "ss_hamilton_national_bank_1790",
    "subject": "social_studies",
    "topic": "Economy / Federal Finance",
    "title": "Report on a National Bank (Excerpt)",
    "author": "Alexander Hamilton",
    "year": 1790,
    "text": "A national bank is an institution of primary importance to the prosperous administration of the finances and would be of the greatest utility in the operations connected with the support of public credit.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Federal Finance",
    "label": "American Revolution"
  },
  {
    "id": "ss_jackson_bank_veto_1832",
    "subject": "social_studies",
    "topic": "Economy / Executive Power",
    "title": "Bank Veto Message (Excerpt)",
    "author": "Andrew Jackson",
    "year": 1832,
    "text": "It is to be regretted that the rich and powerful too often bend the acts of government to their selfish purposes. Distinctions in society will always exist under every just government.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Executive Power",
    "label": "General"
  },
  {
    "id": "ss_henry_george_progress_poverty_1879",
    "subject": "social_studies",
    "topic": "Economy / Inequality",
    "title": "Progress and Poverty (Excerpt)",
    "author": "Henry George",
    "year": 1879,
    "text": "The association of poverty with progress is the great enigma of our times. So long as all the increased wealth that modern progress brings goes but to build up great fortunes, progress is not real and cannot be permanent.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Inequality",
    "label": "General"
  },
  {
    "id": "ss_ulysses_grant_state_of_union_1875",
    "subject": "social_studies",
    "topic": "Economy / Currency",
    "title": "State of the Union on Currency Stability (Excerpt)",
    "author": "Ulysses S. Grant",
    "year": 1875,
    "text": "To protect the national credit and maintain confidence in the value of our money is essential to commerce, labor, and the fair conduct of business throughout the Republic.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Currency",
    "label": "General"
  },
  {
    "id": "ss_fdr_new_deal_recovery_1935",
    "subject": "social_studies",
    "topic": "Economy / Great Depression",
    "title": "Message to Congress on Economic Security (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1935,
    "text": "We must provide safeguards against the hazards and vicissitudes of life and especially against those uncertainties which no individual can wholly eliminate from his own resources.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Great Depression",
    "label": "General"
  },
  {
    "id": "ss_woodrow_wilson_new_freedom_1912",
    "subject": "social_studies",
    "topic": "Economy / Competition",
    "title": "The New Freedom (Excerpt)",
    "author": "Woodrow Wilson",
    "year": 1912,
    "text": "If monopoly persists, monopoly will always sit at the helm of government. The first duty of law is to keep sound the society it serves.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Competition",
    "label": "General"
  },
  {
    "id": "ss_populist_omaha_platform_1892",
    "subject": "social_studies",
    "topic": "Economy / Agrarian Politics",
    "title": "People's Party Omaha Platform (Excerpt)",
    "author": "People's Party Delegates",
    "year": 1892,
    "text": "We meet in the midst of a nation brought to the verge of moral, political, and material ruin. Corruption dominates the ballot-box, the legislatures, the Congress, and touches even the ermine of the bench.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Agrarian Politics",
    "label": "General"
  },
  {
    "id": "ss_william_jennings_bryan_cross_gold_1896",
    "subject": "social_studies",
    "topic": "Economy / Money Policy",
    "title": "Cross of Gold Speech (Excerpt)",
    "author": "William Jennings Bryan",
    "year": 1896,
    "text": "You shall not press down upon the brow of labor this crown of thorns. You shall not crucify mankind upon a cross of gold.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Economy / Money Policy",
    "label": "General"
  },
  {
    "id": "ss_john_quincy_adams_monroe_doctrine_1821",
    "subject": "social_studies",
    "topic": "Geography / Foreign Affairs",
    "title": "Address on Hemisphere Policy (Excerpt)",
    "author": "John Quincy Adams",
    "year": 1821,
    "text": "America does not go abroad in search of monsters to destroy. She is the well-wisher to the freedom and independence of all.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Geography / Foreign Affairs",
    "label": "General"
  },
  {
    "id": "ss_theodore_roosevelt_corollary_1904",
    "subject": "social_studies",
    "topic": "Geography / International",
    "title": "Annual Message (Roosevelt Corollary Excerpt)",
    "author": "Theodore Roosevelt",
    "year": 1904,
    "text": "Chronic wrongdoing, or an impotence which results in a general loosening of the ties of civilized society, may in America, as elsewhere, ultimately require intervention by some civilized nation.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Geography / International",
    "label": "General"
  },
  {
    "id": "ss_wilson_league_nations_1919",
    "subject": "social_studies",
    "topic": "World / International Cooperation",
    "title": "Speech Supporting the League of Nations (Excerpt)",
    "author": "Woodrow Wilson",
    "year": 1919,
    "text": "The stage is set, the destiny disclosed. It has come about by no plan of our conceiving, but by the hand of God who led us into this way. We cannot turn back.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "World / International Cooperation",
    "label": "General"
  },
  {
    "id": "ss_fdr_four_policemen_1943",
    "subject": "social_studies",
    "topic": "World / Security",
    "title": "Address on Postwar International Security (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1943,
    "text": "The peace cannot include any continued despotism. The world needs responsible cooperation among major nations to preserve order and protect smaller states.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "World / Security",
    "label": "General"
  },
  {
    "id": "ss_truman_un_address_1947",
    "subject": "social_studies",
    "topic": "International / United Nations",
    "title": "Address to the UN General Assembly (Excerpt)",
    "author": "Harry S. Truman",
    "year": 1947,
    "text": "The United Nations represents man's best hope to substitute reason and justice for force and aggression in the relations among nations.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "International / United Nations",
    "label": "General"
  },
  {
    "id": "ss_eisenhower_atoms_for_peace_1953",
    "subject": "social_studies",
    "topic": "World / Science and Diplomacy",
    "title": "Atoms for Peace Address (Excerpt)",
    "author": "Dwight D. Eisenhower",
    "year": 1953,
    "text": "The United States knows that if the fearful trend of atomic military build-up can be reversed, this greatest of destructive forces can be developed into a great boon for the benefit of all mankind.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "World / Science and Diplomacy",
    "label": "General"
  },
  {
    "id": "ss_jfk_berlin_1963",
    "subject": "social_studies",
    "topic": "World / Cold War",
    "title": "Speech in West Berlin (Excerpt)",
    "author": "John F. Kennedy",
    "year": 1963,
    "text": "Two thousand years ago the proudest boast was civis Romanus sum. Today, in the world of freedom, the proudest boast is Ich bin ein Berliner.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "World / Cold War",
    "label": "General"
  },
  {
    "id": "ss_reagan_tear_down_wall_1987",
    "subject": "social_studies",
    "topic": "World / Cold War",
    "title": "Berlin Wall Speech (Excerpt)",
    "author": "Ronald Reagan",
    "year": 1987,
    "text": "Mr. Gorbachev, open this gate. Mr. Gorbachev, tear down this wall.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "World / Cold War",
    "label": "General"
  },
  {
    "id": "ss_fdr_universal_rights_1941",
    "subject": "social_studies",
    "topic": "World / Human Rights",
    "title": "Four Freedoms and Global Rights (Excerpt)",
    "author": "Franklin D. Roosevelt",
    "year": 1941,
    "text": "Freedom means the supremacy of human rights everywhere. Our support goes to those who struggle to gain those rights and keep them.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "World / Human Rights",
    "label": "General"
  },
  {
    "id": "ss_lincoln_transcontinental_1862",
    "subject": "social_studies",
    "topic": "Geography / Territorial Integration",
    "title": "Message Supporting Internal Connections (Excerpt)",
    "author": "Abraham Lincoln",
    "year": 1862,
    "text": "The strengthening of the ties that bind together the States requires wise national improvements that connect the regions of this continent in commerce and communication.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "Geography / Territorial Integration",
    "label": "General"
  },
  {
    "id": "ss_theodore_roosevelt_nobel_1910",
    "subject": "social_studies",
    "topic": "World / International Arbitration",
    "title": "Nobel Lecture (Excerpt)",
    "author": "Theodore Roosevelt",
    "year": 1910,
    "text": "It would be a masterstroke if those great powers honestly bent on peace would form a League of Peace, not only to keep the peace among themselves, but to prevent, by force if necessary, its being broken by others.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "public_domain_speeches.json",
    "area": "World / International Arbitration",
    "label": "General"
  },
  {
    "id": "ss_obama_cairo_2009",
    "subject": "social_studies",
    "topic": "World / International Relations",
    "title": "A New Beginning (Cairo Speech Excerpt)",
    "author": "Barack Obama",
    "year": 2009,
    "text": "No system of government can or should be imposed by one nation by any other. America does not presume to know what is best for everyone, just as we would not presume to pick the outcome of a peaceful election.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "World / International Relations",
    "label": "General"
  },
  {
    "id": "ss_trump_un_2018",
    "subject": "social_studies",
    "topic": "World / Sovereignty",
    "title": "UN General Assembly Address (Excerpt)",
    "author": "Donald J. Trump",
    "year": 2018,
    "text": "We reject the ideology of globalism, and we embrace the doctrine of patriotism. Responsible nations must defend against threats to sovereignty and freedom.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "World / Sovereignty",
    "label": "General"
  },
  {
    "id": "ss_eleanor_roosevelt_un_rights_1948",
    "subject": "social_studies",
    "topic": "World / Human Rights",
    "title": "Statement on the Universal Declaration of Human Rights (Excerpt)",
    "author": "Eleanor Roosevelt",
    "year": 1948,
    "text": "This declaration may well become the international Magna Carta of all men everywhere. It is a first step in a great evolutionary process.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "World / Human Rights",
    "label": "General"
  },
  {
    "id": "ss_ceasar_chavez_commonwealth_club_1984",
    "subject": "social_studies",
    "topic": "Economy / Labor Rights",
    "title": "Commonwealth Club Address (Excerpt)",
    "author": "Cesar Chavez",
    "year": 1984,
    "text": "Once social change begins, it cannot be reversed. You cannot uneducate the person who has learned to read. You cannot oppress the people who are not afraid anymore.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "Economy / Labor Rights",
    "label": "Civil Rights"
  },
  {
    "id": "ss_frances_perkins_new_deal_1935",
    "subject": "social_studies",
    "topic": "Economy / Labor Policy",
    "title": "Address on Social Insurance and Labor Standards (Excerpt)",
    "author": "Frances Perkins",
    "year": 1935,
    "text": "The people are what matter to government, and a government should aim to give all the people under its jurisdiction the best possible life.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "Economy / Labor Policy",
    "label": "General"
  },
  {
    "id": "ss_hubert_humphrey_civil_rights_1948",
    "subject": "social_studies",
    "topic": "Civil Rights / Party Politics",
    "title": "Democratic Convention Civil Rights Speech (Excerpt)",
    "author": "Hubert H. Humphrey",
    "year": 1948,
    "text": "The time has arrived in America for the Democratic Party to get out of the shadow of states' rights and walk forthrightly into the bright sunshine of human rights.",
    "content_type": "passage",
    "grade_band": "ged",
    "difficulty": "medium",
    "source_file": "official_transcript_excerpt.json",
    "area": "Civil Rights / Party Politics",
    "label": "Civil Rights"
  }
]
