{
  "Science": [
    {
      "term": "Hypothesis",
      "definition": "A testable explanation for an observation that can be supported or refuted through experimentation."
    },
    {
      "term": "Variable",
      "definition": "A factor in an experiment that can change or be controlled."
    },
    {
      "term": "Control Group",
      "definition": "The group in an experiment that does not receive the independent variable and is used for comparison."
    },
    {
      "term": "Ecosystem",
      "definition": "A community of living organisms interacting with each other and with their physical environment."
    },
    {
      "term": "Photosynthesis",
      "definition": "The process by which plants use light energy to convert carbon dioxide and water into glucose and oxygen."
    },
    {
      "term": "Cellular Respiration",
      "definition": "The process in which cells break down glucose and oxygen to release energy, carbon dioxide, and water."
    },
    {
      "term": "Mitosis",
      "definition": "A type of cell division that results in two identical daughter cells."
    },
    {
      "term": "Meiosis",
      "definition": "A type of cell division that produces four non-identical gametes (sex cells) with half the genetic information."
    },
    {
      "term": "DNA",
      "definition": "The molecule that carries genetic information in living organisms."
    },
    {
      "term": "RNA",
      "definition": "A molecule that carries out DNA instructions to produce proteins."
    },
    {
      "term": "Atom",
      "definition": "The smallest unit of an element that retains the properties of that element."
    },
    {
      "term": "Molecule",
      "definition": "Two or more atoms that are chemically bonded together."
    },
    {
      "term": "Gravity",
      "definition": "The force of attraction between objects with mass."
    },
    {
      "term": "Qualitative Observation",
      "definition": "An observation that describes qualities or characteristics without using numbers."
    },
    {
      "term": "Quantitative Observation",
      "definition": "An observation that uses numbers or measurements to describe what is observed."
    },
    {
      "term": "Homeostasis",
      "definition": "The process by which organisms maintain stable internal conditions despite external changes."
    },
    {
      "term": "Independent Variable",
      "definition": "The factor that is purposely changed in an experiment to test its effect."
    },
    {
      "term": "Dependent Variable",
      "definition": "The factor that is measured in an experiment and changes in response to the independent variable."
    },
    {
      "term": "Scientific Method",
      "definition": "A systematic process of asking questions, forming hypotheses, conducting experiments, and drawing conclusions."
    },
    {
      "term": "Plate Tectonics",
      "definition": "The theory explaining the movement of Earth's lithospheric plates and the activity at their boundaries."
    },
    {
      "term": "Fossil",
      "definition": "The preserved remains, impression, or trace of an organism from the past."
    },
    {
      "term": "Energy Transfer",
      "definition": "The movement of energy from one object or system to another."
    },
    {
      "term": "Mutation",
      "definition": "A change in the DNA sequence that can result in inherited variation."
    },
    {
      "term": "Protein",
      "definition": "Large molecules made of amino acids that perform essential functions in living cells."
    },
    {
      "term": "Enzyme",
      "definition": "A protein that speeds up chemical reactions in living organisms."
    },
    {
      "term": "Organ",
      "definition": "A structure made of different tissues working together to perform a specific function."
    },
    {
      "term": "Tissue",
      "definition": "A group of similar cells working together to perform a function."
    },
    {
      "term": "Cell Membrane",
      "definition": "The outer boundary of a cell that controls what enters and exits."
    },
    {
      "term": "Nucleus",
      "definition": "The membrane-bound organelle containing DNA in a eukaryotic cell."
    },
    {
      "term": "Mitochondria",
      "definition": "The organelle responsible for producing energy through cellular respiration."
    },
    {
      "term": "Chloroplast",
      "definition": "The organelle in plant cells where photosynthesis occurs."
    },
    {
      "term": "Respiration",
      "definition": "The process of oxygen intake and carbon dioxide release in organisms."
    },
    {
      "term": "Circulation",
      "definition": "The movement of blood throughout the body via the cardiovascular system."
    },
    {
      "term": "Phototropism",
      "definition": "The growth response of plants toward or away from light."
    },
    {
      "term": "Geotropism",
      "definition": "The growth response of plants in relation to gravity."
    },
    {
      "term": "Reproduction",
      "definition": "The biological process by which organisms produce offspring."
    },
    {
      "term": "Heredity",
      "definition": "The passing of traits from parents to offspring through genes."
    },
    {
      "term": "Allele",
      "definition": "One of the alternative forms of a gene for a specific trait."
    },
    { "term": "Genotype", "definition": "The genetic makeup of an organism." },
    {
      "term": "Phenotype",
      "definition": "The observable characteristics of an organism determined by genotype and environment."
    },
    {
      "term": "Extinction",
      "definition": "The permanent disappearance of a species from Earth."
    },
    {
      "term": "Speciation",
      "definition": "The evolutionary process by which new species arise."
    },
    {
      "term": "Erosion",
      "definition": "The wearing away of rock and soil by water, wind, or ice."
    },
    {
      "term": "Weathering",
      "definition": "The breakdown of rocks and minerals by wind, water, temperature changes, or organisms."
    },
    {
      "term": "Sedimentation",
      "definition": "The process of sediment being deposited in layers over time."
    },
    {
      "term": "Metamorphic Rock",
      "definition": "Rock formed from existing rock changed by heat and pressure deep in the Earth."
    },
    {
      "term": "Sedimentary Rock",
      "definition": "Rock formed from consolidated sediment layers compressed over time."
    },
    {
      "term": "Igneous Rock",
      "definition": "Rock formed from cooled and solidified magma or lava."
    },
    {
      "term": "Mineral",
      "definition": "A naturally occurring solid with a definite chemical composition and orderly structure."
    },
    {
      "term": "Rock Cycle",
      "definition": "The continuous process of rock formation, destruction, and reformation."
    },
    {
      "term": "Tsunami",
      "definition": "A large ocean wave caused by sudden movement of the Earth's crust."
    },
    {
      "term": "Earthquake",
      "definition": "Sudden shaking of the Earth's crust caused by tectonic plate movement."
    },
    {
      "term": "Volcano",
      "definition": "An opening in the Earth's crust where lava, ash, and gases erupt."
    },
    {
      "term": "Magma",
      "definition": "Molten rock beneath the Earth's surface."
    },
    {
      "term": "Lava",
      "definition": "Molten rock that has erupted onto the Earth's surface."
    },
    {
      "term": "Crust",
      "definition": "The outermost solid layer of the Earth."
    },
    {
      "term": "Mantle",
      "definition": "The layer beneath the crust composed of hot rock."
    },
    { "term": "Core", "definition": "The hot, dense center of the Earth." },
    {
      "term": "Lithosphere",
      "definition": "The rigid outer layer of the Earth consisting of crust and upper mantle."
    },
    {
      "term": "Atmosphere",
      "definition": "The layer of gases surrounding the Earth."
    },
    { "term": "Biosphere", "definition": "All life and habitats on Earth." },
    {
      "term": "Hydrosphere",
      "definition": "All water on and around the Earth."
    },
    { "term": "Photon", "definition": "A particle of light energy." },
    {
      "term": "Wavelength",
      "definition": "The distance between consecutive wave crests or troughs."
    },
    {
      "term": "Frequency",
      "definition": "The number of waves passing a point per unit time."
    },
    {
      "term": "Sound Wave",
      "definition": "Vibrations that travel through a medium as waves."
    },
    {
      "term": "Pitch",
      "definition": "The perceived highness or lowness of a sound determined by frequency."
    },
    {
      "term": "Amplitude",
      "definition": "The maximum displacement of a wave from equilibrium, affecting loudness or brightness."
    },
    {
      "term": "Lens",
      "definition": "A curved transparent optical element that focuses or disperses light."
    },
    {
      "term": "Refraction",
      "definition": "The bending of light when passing from one medium to another."
    },
    {
      "term": "Reflection",
      "definition": "The bouncing back of light or sound from a surface."
    },
    { "term": "Optics", "definition": "The science of light and vision." },
    {
      "term": "Electromagnetic Spectrum",
      "definition": "The range of all electromagnetic radiation from radio waves to gamma rays."
    },
    {
      "term": "Kinetic Energy",
      "definition": "The energy an object possesses due to its motion."
    },
    {
      "term": "Potential Energy",
      "definition": "The energy an object possesses due to its position or condition."
    },
    {
      "term": "Thermodynamics",
      "definition": "The study of heat and its relationship to mechanical energy."
    },
    { "term": "Enthalpy", "definition": "The total heat content of a system." },
    {
      "term": "Entropy",
      "definition": "A measure of disorder or randomness in a system."
    },
    {
      "term": "Exothermic",
      "definition": "A reaction that releases heat energy."
    },
    {
      "term": "Endothermic",
      "definition": "A reaction that absorbs heat energy."
    },
    {
      "term": "Reactant",
      "definition": "A substance that participates in a chemical reaction."
    },
    {
      "term": "Product",
      "definition": "A substance formed as a result of a chemical reaction."
    },
    {
      "term": "Oxidation",
      "definition": "The loss of electrons from an atom or molecule."
    },
    {
      "term": "Reduction",
      "definition": "The gain of electrons by an atom or molecule."
    },
    {
      "term": "Catalyst",
      "definition": "A substance that speeds up a reaction without being consumed."
    },
    {
      "term": "Equilibrium",
      "definition": "A state in which forward and reverse reactions occur at the same rate."
    },
    {
      "term": "Solution",
      "definition": "A homogeneous mixture of a solute dissolved in a solvent."
    },
    {
      "term": "Solute",
      "definition": "The substance being dissolved in a solution."
    },
    {
      "term": "Solvent",
      "definition": "The liquid medium in which a solute is dissolved."
    },
    {
      "term": "Saturation",
      "definition": "The condition when a solution contains the maximum amount of dissolved solute."
    },
    {
      "term": "Molarity",
      "definition": "The concentration of a solution expressed as moles of solute per liter."
    },
    {
      "term": "pH Scale",
      "definition": "A numerical scale from 0 to 14 measuring the acidity or alkalinity of a solution."
    },
    {
      "term": "Buffer",
      "definition": "A solution that resists changes in pH when acids or bases are added."
    },
    {
      "term": "Titration",
      "definition": "A laboratory technique for determining the concentration of an acid or base."
    },
    {
      "term": "Valence",
      "definition": "The combining capacity of an element."
    },
    {
      "term": "Atomic Number",
      "definition": "The number of protons in an atom, determining the element's identity."
    },
    {
      "term": "Mass Number",
      "definition": "The total number of protons and neutrons in an atom."
    },
    {
      "term": "Isotope",
      "definition": "Atoms of the same element with different numbers of neutrons."
    },
    {
      "term": "Ion",
      "definition": "An atom or molecule with a net electrical charge."
    },
    { "term": "Cation", "definition": "A positively charged ion." },
    { "term": "Anion", "definition": "A negatively charged ion." },
    {
      "term": "Crystal",
      "definition": "A solid form with atoms arranged in an orderly repeating pattern."
    },
    {
      "term": "Polymer",
      "definition": "A large molecule made of many repeating subunits called monomers."
    },
    {
      "term": "Momentum",
      "definition": "The product of an object's mass and velocity."
    },
    {
      "term": "Inertia",
      "definition": "The resistance of an object to changes in its motion."
    },
    {
      "term": "Impulse",
      "definition": "The product of force and the time interval over which the force acts."
    },
    {
      "term": "Torque",
      "definition": "A force that causes rotation around a pivot point."
    },
    {
      "term": "Pressure",
      "definition": "The force applied perpendicular to a surface per unit area."
    },
    {
      "term": "Buoyancy",
      "definition": "The upward force exerted by a fluid on an object immersed in it."
    },
    {
      "term": "Specific Heat",
      "definition": "The amount of energy needed to raise the temperature of one unit of mass by one degree."
    },
    {
      "term": "Latent Heat",
      "definition": "The energy required to change the state of matter without changing temperature."
    },
    {
      "term": "Sublimation",
      "definition": "The direct change from solid to gas without passing through the liquid phase."
    },
    {
      "term": "Deposition",
      "definition": "The direct change from gas to solid without passing through the liquid phase."
    },
    {
      "term": "Osmosis",
      "definition": "Diffusion of water through a selectively permeable membrane."
    },
    {
      "term": "Diffusion",
      "definition": "Movement of particles from high to low concentration."
    },
    {
      "term": "Active Transport",
      "definition": "Movement of substances against concentration gradient using energy."
    },
    {
      "term": "Passive Transport",
      "definition": "Movement of substances without using cellular energy."
    },
    {
      "term": "Biome",
      "definition": "A large region characterized by distinctive climate and organisms."
    },
    {
      "term": "Succession",
      "definition": "The gradual change in species composition of a community over time."
    },
    {
      "term": "Carrying Capacity",
      "definition": "The maximum population size an environment can sustain."
    },
    {
      "term": "Predation",
      "definition": "The hunting and consumption of one organism by another."
    },
    {
      "term": "Symbiosis",
      "definition": "A close relationship between two different species."
    },
    {
      "term": "Mutation Rate",
      "definition": "The frequency at which mutations occur in a population."
    },
    {
      "term": "Genetic Drift",
      "definition": "Random changes in allele frequencies in a population."
    },
    {
      "term": "Gene Pool",
      "definition": "The sum of all genetic information in a population."
    },
    {
      "term": "Hardy-Weinberg",
      "definition": "A principle stating that allele frequencies remain constant without evolution."
    },
    {
      "term": "Adaptation",
      "definition": "A trait that improves an organism's survival or reproduction."
    },
    {
      "term": "Speciation",
      "definition": "The evolutionary process by which new species arise."
    },
    {
      "term": "Natural Selection",
      "definition": "Process where organisms with favorable traits reproduce more."
    },
    {
      "term": "Artificial Selection",
      "definition": "Human-directed breeding for desired traits."
    },
    {
      "term": "Convergent Evolution",
      "definition": "Evolution of similar traits in unrelated species in similar environments."
    },
    {
      "term": "Divergent Evolution",
      "definition": "Evolution where species become more different over time."
    },
    {
      "term": "Biogeography",
      "definition": "The study of the distribution of organisms across Earth."
    },
    { "term": "Stratum", "definition": "A layer of sedimentary rock." },
    {
      "term": "Paleontology",
      "definition": "The study of ancient life through fossils."
    },
    {
      "term": "Radiometric Dating",
      "definition": "Method of determining age using radioactive decay."
    },
    {
      "term": "Half-Life",
      "definition": "Time for half the atoms in a radioactive sample to decay."
    },
    { "term": "Eon", "definition": "The largest division of geologic time." },
    {
      "term": "Era",
      "definition": "A major division of geologic time within an eon."
    },
    {
      "term": "Period",
      "definition": "A division of geologic time within an era."
    },
    { "term": "Epoch", "definition": "A subdivision of a geological period." },
    {
      "term": "Orography",
      "definition": "The study of mountain formation and characteristics."
    },
    {
      "term": "Glaciation",
      "definition": "The formation and movement of glaciers."
    },
    {
      "term": "Saturation Vapor Pressure",
      "definition": "The maximum amount of water vapor air can hold at a given temperature."
    },
    {
      "term": "Dew Point",
      "definition": "The temperature at which water vapor becomes saturated."
    },
    {
      "term": "Convection Current",
      "definition": "Circular movement of fluids caused by heating and cooling."
    },
    {
      "term": "Jetstream",
      "definition": "Fast-moving river of air in the upper atmosphere."
    },
    {
      "term": "Pressure System",
      "definition": "Regions of high or low atmospheric pressure."
    },
    {
      "term": "Front",
      "definition": "The boundary between different air masses."
    },
    {
      "term": "Doppler Effect",
      "definition": "Change in frequency of waves due to relative motion."
    },
    {
      "term": "Resonance",
      "definition": "Amplification of vibrations at the natural frequency."
    },
    {
      "term": "Interference",
      "definition": "The meeting and combining of two waves."
    },
    {
      "term": "Diffraction",
      "definition": "The bending of waves around obstacles."
    }
  ],
  "Math": [
    {
      "term": "Integer",
      "definition": "A whole number that can be positive, negative, or zero."
    },
    {
      "term": "Fraction",
      "definition": "A number that represents a part of a whole or a part of a set."
    },
    {
      "term": "Decimal",
      "definition": "A number that uses a decimal point to show a value smaller than one."
    },
    {
      "term": "Percent",
      "definition": "A ratio that compares a number to 100."
    },
    {
      "term": "Ratio",
      "definition": "A comparison of two quantities by division."
    },
    {
      "term": "Proportion",
      "definition": "An equation stating that two ratios are equivalent."
    },
    {
      "term": "Equation",
      "definition": "A mathematical statement that shows two expressions are equal."
    },
    {
      "term": "Coefficient",
      "definition": "The number that is multiplied by a variable in an algebraic expression."
    },
    {
      "term": "Expression",
      "definition": "A mathematical phrase that can contain numbers, variables, and operations."
    },
    {
      "term": "Inequality",
      "definition": "A mathematical statement that compares two expressions using greater than, less than, or equal to symbols."
    },
    {
      "term": "Slope",
      "definition": "A measure of the steepness of a line, found by the ratio of rise over run."
    },
    {
      "term": "Quadratic Equation",
      "definition": "An equation in the form ax² + bx + c = 0, where a, b, and c are constants and a ≠ 0."
    },
    {
      "term": "Linear Function",
      "definition": "A function whose graph is a straight line."
    },
    {
      "term": "Pythagorean Theorem",
      "definition": "A formula that relates the side lengths of a right triangle: a² + b² = c²."
    },
    {
      "term": "Mean",
      "definition": "The average of a set of numbers, found by adding the numbers and dividing by how many there are."
    },
    {
      "term": "Median",
      "definition": "The middle value in an ordered set of numbers."
    },
    {
      "term": "Mode",
      "definition": "The number that appears most often in a set of data."
    },
    {
      "term": "Range",
      "definition": "The difference between the highest and lowest values in a data set."
    },
    {
      "term": "Probability",
      "definition": "The likelihood that an event will occur, expressed as a ratio, fraction, or percent."
    },
    {
      "term": "Factor",
      "definition": "A number that divides another number evenly."
    },
    {
      "term": "Prime Number",
      "definition": "A whole number greater than 1 that has exactly two factors: 1 and itself."
    },
    {
      "term": "Composite Number",
      "definition": "A whole number greater than 1 that has more than two factors."
    },
    {
      "term": "Perimeter",
      "definition": "The total distance around the outside of a shape."
    },
    {
      "term": "Area",
      "definition": "The amount of surface covered by a shape."
    },
    {
      "term": "Volume",
      "definition": "The amount of space a three-dimensional object occupies."
    },
    { "term": "Circumference", "definition": "The distance around a circle." },
    {
      "term": "Exponent",
      "definition": "A small number written above and to the right of a base number that shows how many times the base is multiplied by itself."
    },
    {
      "term": "Order of Operations",
      "definition": "The rules that tell you the correct sequence to evaluate a mathematical expression (PEMDAS)."
    },
    {
      "term": "Absolute Value",
      "definition": "Distance of a number from zero on the number line."
    },
    {
      "term": "Reciprocal",
      "definition": "Multiplicative inverse of a number (a * 1/a = 1)."
    },
    {
      "term": "Unit Rate",
      "definition": "Rate with a denominator of one (e.g., miles per hour)."
    },
    {
      "term": "Slope-Intercept Form",
      "definition": "Linear equation form y = mx + b."
    },
    {
      "term": "Point-Slope Form",
      "definition": "Linear equation form y - y1 = m(x - x1)."
    },
    {
      "term": "Standard Form",
      "definition": "Linear equation form Ax + By = C."
    },
    {
      "term": "Function",
      "definition": "Relation assigning exactly one output to each input."
    },
    {
      "term": "Domain",
      "definition": "Set of all input values for a function."
    },
    {
      "term": "Range (Function)",
      "definition": "Set of all output values for a function."
    },
    {
      "term": "Irrational Number",
      "definition": "Number not expressible as a fraction; non-repeating decimal."
    },
    {
      "term": "Ordered Pair",
      "definition": "Coordinates (x, y) locating a point."
    },
    {
      "term": "Cartesian Plane",
      "definition": "Plane defined by perpendicular x and y axes."
    },
    {
      "term": "Scatter Plot",
      "definition": "Graph showing relationship between paired data."
    },
    {
      "term": "Line of Best Fit",
      "definition": "Line best approximating a data set's trend."
    },
    {
      "term": "Mean Absolute Deviation",
      "definition": "Average distance of each data point from the mean."
    },
    { "term": "Permutation", "definition": "Arrangement where order matters." },
    {
      "term": "Combination",
      "definition": "Selection where order does not matter."
    },
    { "term": "Simple Interest", "definition": "Principal × Rate × Time." },
    {
      "term": "Compound Interest",
      "definition": "Interest added to principal causing exponential growth."
    },
    {
      "term": "Principal",
      "definition": "Original amount invested or borrowed."
    },
    {
      "term": "Similar Figures",
      "definition": "Figures with equal angles and proportional sides."
    },
    {
      "term": "Congruent Figures",
      "definition": "Figures identical in size and shape."
    },
    {
      "term": "Translation",
      "definition": "Slide of a figure without rotation."
    },
    { "term": "Rotation", "definition": "Turn of a figure around a point." },
    { "term": "Reflection", "definition": "Flip of a figure across a line." },
    {
      "term": "Dilation",
      "definition": "Resizing a figure proportionally from a center point."
    },
    { "term": "Radius", "definition": "Distance from circle center to edge." },
    {
      "term": "Diameter",
      "definition": "Distance across circle through center (2r)."
    },
    { "term": "Right Triangle", "definition": "Triangle with one 90° angle." },
    { "term": "Hypotenuse", "definition": "Longest side of a right triangle." },
    {
      "term": "Square Root",
      "definition": "Value which produces original when squared."
    },
    {
      "term": "Cube",
      "definition": "Number multiplied by itself three times."
    },
    {
      "term": "Cube Root",
      "definition": "Number which produces original when cubed."
    },
    {
      "term": "Linear Inequality",
      "definition": "Inequality containing a linear expression."
    },
    {
      "term": "System of Equations",
      "definition": "Two or more equations with shared variables."
    },
    {
      "term": "Solution (System)",
      "definition": "Values satisfying all equations in a system."
    },
    {
      "term": "Substitution Method",
      "definition": "Solve system by replacing a variable with an expression."
    },
    {
      "term": "Elimination Method",
      "definition": "Solve system by combining equations to remove a variable."
    },
    {
      "term": "Percent of Change",
      "definition": "Percent increase or decrease from original value."
    },
    {
      "term": "Composite Figure",
      "definition": "Shape formed by combining simpler shapes."
    },
    {
      "term": "Arithmetic Sequence",
      "definition": "Sequence with constant difference between consecutive terms."
    },
    {
      "term": "Geometric Sequence",
      "definition": "Sequence with constant ratio between consecutive terms."
    },
    {
      "term": "Experimental Probability",
      "definition": "Probability based on trials or experiments."
    },
    {
      "term": "Theoretical Probability",
      "definition": "Probability based on all possible outcomes."
    },
    {
      "term": "Box-and-Whisker Plot",
      "definition": "Graph summarizing data using quartiles."
    },
    {
      "term": "Interquartile Range",
      "definition": "Difference between Q3 and Q1 (middle 50%)."
    },
    {
      "term": "Outlier",
      "definition": "Data point far from the rest of a set."
    },
    { "term": "Monomial", "definition": "A polynomial with a single term." },
    {
      "term": "Binomial",
      "definition": "A polynomial with exactly two terms."
    },
    {
      "term": "Trinomial",
      "definition": "A polynomial with exactly three terms."
    },
    {
      "term": "Polynomial",
      "definition": "An expression containing multiple terms with variables and exponents."
    },
    {
      "term": "Degree (Polynomial)",
      "definition": "The highest power of a variable in a polynomial."
    },
    {
      "term": "Polynomial Division",
      "definition": "Process of dividing one polynomial by another."
    },
    {
      "term": "Factor (Polynomial)",
      "definition": "Break a polynomial into simpler multiplying factors."
    },
    {
      "term": "Rational Expression",
      "definition": "A fraction containing polynomials."
    },
    {
      "term": "Asymptote",
      "definition": "A line that a graph approaches but never reaches."
    },
    { "term": "Vertex", "definition": "The turning point of a parabola." },
    {
      "term": "Parabola",
      "definition": "U-shaped curve formed by a quadratic function."
    },
    {
      "term": "Focus (Parabola)",
      "definition": "Special point used in the geometric definition of a parabola."
    },
    {
      "term": "Directrix",
      "definition": "Line used in the geometric definition of a parabola."
    },
    {
      "term": "Ellipse",
      "definition": "An oval-shaped curve with two focal points."
    },
    {
      "term": "Hyperbola",
      "definition": "Two curved lines that mirror each other, forming a U shape."
    },
    {
      "term": "Logarithm",
      "definition": "The exponent to which a base must be raised to get a number."
    },
    {
      "term": "Exponential Function",
      "definition": "A function where the variable is in the exponent."
    },
    {
      "term": "Inverse Function",
      "definition": "A function that reverses the effect of another function."
    },
    {
      "term": "Composition",
      "definition": "Combining two functions by feeding the output of one into another."
    },
    {
      "term": "Iteration",
      "definition": "Repeating a process or function multiple times."
    },
    {
      "term": "Matrix",
      "definition": "A rectangular array of numbers arranged in rows and columns."
    },
    {
      "term": "Determinant",
      "definition": "A special value calculated from a square matrix."
    },
    {
      "term": "Inverse Matrix",
      "definition": "A matrix that when multiplied by the original produces identity matrix."
    },
    {
      "term": "Vector",
      "definition": "A quantity with both magnitude and direction."
    },
    {
      "term": "Scalar",
      "definition": "A quantity with only magnitude, no direction."
    },
    {
      "term": "Modulus",
      "definition": "Absolute value or magnitude of a number or vector."
    },
    {
      "term": "Vinculum",
      "definition": "Horizontal line used in division to group terms."
    },
    {
      "term": "Coefficient of Variation",
      "definition": "Standard deviation divided by the mean, expressed as a percentage."
    },
    {
      "term": "Variance",
      "definition": "The average of the squared deviations from the mean."
    },
    {
      "term": "Standard Deviation",
      "definition": "A measure of how spread out data values are from the mean."
    },
    {
      "term": "Z-Score",
      "definition": "Number of standard deviations a value is from the mean."
    },
    {
      "term": "Quartile",
      "definition": "Values dividing a data set into four equal parts."
    },
    {
      "term": "Percentile",
      "definition": "Value below which a percentage of data falls."
    },
    {
      "term": "Frequency Distribution",
      "definition": "Table showing the frequency of data values."
    },
    {
      "term": "Histogram",
      "definition": "Bar graph showing frequency distribution."
    },
    {
      "term": "Stem-and-Leaf Plot",
      "definition": "Display of data showing distribution and individual values."
    },
    {
      "term": "Cross-Multiplication",
      "definition": "Multiply numerators and denominators diagonally in a proportion."
    },
    {
      "term": "Least Common Multiple",
      "definition": "Smallest number divisible by all given numbers."
    },
    {
      "term": "Greatest Common Factor",
      "definition": "Largest number that divides all given numbers evenly."
    },
    {
      "term": "Simplify",
      "definition": "Reduce an expression to its simplest form."
    },
    {
      "term": "Least Common Denominator",
      "definition": "Smallest number that all denominators divide into evenly."
    }
  ],
  "Reasoning Through Language Arts (RLA)": [
    {
      "term": "Main Idea",
      "definition": "The central point or most important concept that an author wants the reader to understand."
    },
    {
      "term": "Supporting Detail",
      "definition": "Information that explains, proves, or enhances the main idea."
    },
    {
      "term": "Inference",
      "definition": "A conclusion reached by using evidence from the text and your own reasoning."
    },
    {
      "term": "Tone",
      "definition": "The author's attitude toward the subject or audience."
    },
    {
      "term": "Theme",
      "definition": "The underlying message or lesson the author wants to convey."
    },
    {
      "term": "Thesis Statement",
      "definition": "A sentence that states the main point or argument of an essay."
    },
    {
      "term": "Topic Sentence",
      "definition": "The sentence that expresses the main idea of a paragraph."
    },
    {
      "term": "Transition",
      "definition": "A word or phrase that connects ideas and helps writing flow smoothly."
    },
    {
      "term": "Evidence",
      "definition": "Facts, examples, or details used to support a claim."
    },
    {
      "term": "Claim",
      "definition": "A statement or position that requires support."
    },
    {
      "term": "Counterclaim",
      "definition": "An opposing viewpoint that challenges the writer's claim."
    },
    {
      "term": "Audience",
      "definition": "The specific group of readers or listeners a text is written for."
    },
    {
      "term": "Purpose",
      "definition": "The reason why an author writes a text: to inform, persuade, entertain, or explain."
    },
    {
      "term": "Figurative Language",
      "definition": "Words or expressions that go beyond literal meaning, such as metaphors and similes."
    },
    {
      "term": "Metaphor",
      "definition": "A comparison between two unlike things without using like or as."
    },
    {
      "term": "Simile",
      "definition": "A comparison between two unlike things using the words like or as."
    },
    {
      "term": "Connotation",
      "definition": "The emotional or cultural meaning attached to a word."
    },
    {
      "term": "Denotation",
      "definition": "The literal, dictionary definition of a word."
    },
    {
      "term": "Context Clues",
      "definition": "Hints within a sentence or paragraph that help the reader determine the meaning of an unfamiliar word."
    },
    {
      "term": "Revising",
      "definition": "Improving a draft by adding, removing, or rearranging ideas for clarity and effectiveness."
    },
    {
      "term": "Editing",
      "definition": "Correcting grammar, spelling, and punctuation errors in a draft."
    },
    {
      "term": "Proofreading",
      "definition": "Reviewing a final draft carefully to catch small errors before publishing."
    },
    {
      "term": "Persuasive Writing",
      "definition": "Writing that aims to convince the reader to accept a viewpoint or take a specific action."
    },
    {
      "term": "Narrative Writing",
      "definition": "Writing that tells a story with characters, setting, and plot."
    },
    {
      "term": "Informational Text",
      "definition": "Nonfiction writing that provides facts about a topic."
    },
    {
      "term": "Point of View",
      "definition": "The perspective from which a story is told."
    },
    {
      "term": "First-Person Point of View",
      "definition": "A storytelling perspective in which the narrator is a character in the story and uses words like I and we."
    },
    {
      "term": "Third-Person Point of View",
      "definition": "A storytelling perspective where the narrator is outside the story and uses words like he, she, or they."
    },
    {
      "term": "Chronological Order",
      "definition": "A text structure that presents events in the order they happened."
    },
    {
      "term": "Cause and Effect",
      "definition": "A text structure that explains why something happens and the result of it."
    },
    {
      "term": "Alliteration",
      "definition": "Repetition of initial consonant sounds in nearby words."
    },
    {
      "term": "Personification",
      "definition": "Giving human traits to non-human objects or ideas."
    },
    {
      "term": "Hyperbole",
      "definition": "Deliberate exaggeration for emphasis."
    },
    {
      "term": "Oxymoron",
      "definition": "Pair of contradictory words (e.g., jumbo shrimp)."
    },
    {
      "term": "Paraphrase",
      "definition": "Restate text in your own words while keeping meaning."
    },
    {
      "term": "Summarize",
      "definition": "Condense main ideas without details."
    },
    {
      "term": "Run-On Sentence",
      "definition": "Two or more sentences incorrectly joined."
    },
    {
      "term": "Fragment",
      "definition": "Incomplete sentence missing subject or predicate."
    },
    {
      "term": "Subject-Verb Agreement",
      "definition": "Rule that subjects and verbs must match in number."
    },
    { "term": "Pronoun", "definition": "Word replacing a noun." },
    { "term": "Antecedent", "definition": "Noun a pronoun refers to." },
    { "term": "Active Voice", "definition": "Subject performs the action." },
    { "term": "Passive Voice", "definition": "Subject receives the action." },
    {
      "term": "Parallel Structure",
      "definition": "Using same grammatical pattern for related ideas."
    },
    {
      "term": "Clause",
      "definition": "Group of words with a subject and verb."
    },
    {
      "term": "Independent Clause",
      "definition": "Clause that can stand alone."
    },
    {
      "term": "Dependent Clause",
      "definition": "Clause that cannot stand alone."
    },
    {
      "term": "Sentence Variety",
      "definition": "Using different sentence patterns for effect."
    },
    {
      "term": "Argument",
      "definition": "Claim supported by evidence and reasoning."
    },
    { "term": "Bias", "definition": "Unfair preference toward one side." },
    { "term": "Fact", "definition": "Statement proven true." },
    { "term": "Opinion", "definition": "Personal belief not provable." },
    {
      "term": "Informal Tone",
      "definition": "Casual language for familiar audience."
    },
    {
      "term": "Formal Tone",
      "definition": "Objective, professional language."
    },
    { "term": "Citation", "definition": "Reference giving credit to source." },
    {
      "term": "Plagiarism",
      "definition": "Using others' words or ideas without credit."
    },
    {
      "term": "Relevance",
      "definition": "Direct connection of evidence to claim."
    },
    { "term": "Credibility", "definition": "Trustworthiness of a source." },
    {
      "term": "Context",
      "definition": "Surrounding words or situation clarifying meaning."
    },
    {
      "term": "Figurative Meaning",
      "definition": "Non-literal meaning expressed by figures of speech."
    },
    { "term": "Literal Meaning", "definition": "Exact dictionary meaning." },
    { "term": "Dialogue", "definition": "Conversation between characters." },
    { "term": "Setting", "definition": "Time and place of a story." },
    { "term": "Plot", "definition": "Sequence of events in a story." },
    { "term": "Conflict", "definition": "Struggle between opposing forces." },
    { "term": "Resolution", "definition": "Outcome of the conflict." },
    { "term": "Foreshadowing", "definition": "Hints of future events." },
    { "term": "Flashback", "definition": "Scene showing past events." },
    {
      "term": "Irony",
      "definition": "Contrast between expectation and reality."
    },
    { "term": "Symbolism", "definition": "Use of symbols to represent ideas." },
    {
      "term": "Imagery",
      "definition": "Descriptive language appealing to senses."
    },
    { "term": "Protagonist", "definition": "The main character in a story." },
    {
      "term": "Antagonist",
      "definition": "A character opposing the protagonist."
    },
    {
      "term": "Dynamic Character",
      "definition": "A character that changes throughout a story."
    },
    {
      "term": "Static Character",
      "definition": "A character that remains unchanged throughout a story."
    },
    {
      "term": "Round Character",
      "definition": "A character with complex, realistic qualities."
    },
    {
      "term": "Flat Character",
      "definition": "A character that is simple with few distinctive qualities."
    },
    {
      "term": "Exposition",
      "definition": "Introduction providing background information."
    },
    {
      "term": "Rising Action",
      "definition": "Events building tension toward climax."
    },
    {
      "term": "Climax",
      "definition": "The turning point and most intense moment of a story."
    },
    {
      "term": "Falling Action",
      "definition": "Events following climax leading to resolution."
    },
    { "term": "Denouement", "definition": "Final resolution after climax." },
    { "term": "Pun", "definition": "A play on words using multiple meanings." },
    {
      "term": "Metonymy",
      "definition": "Substituting the name of one thing for another related to it."
    },
    {
      "term": "Synecdoche",
      "definition": "A figure of speech where part represents whole or vice versa."
    },
    {
      "term": "Understatement",
      "definition": "Representing something as less important than it is."
    },
    {
      "term": "Mood",
      "definition": "The feeling or atmosphere created by a text."
    },
    {
      "term": "Voice",
      "definition": "The distinctive way a writer uses language and expresses ideas."
    },
    { "term": "Diction", "definition": "Choice and use of words in writing." },
    {
      "term": "Syntax",
      "definition": "The arrangement of words and phrases to create sentences."
    },
    {
      "term": "Register",
      "definition": "The style of language appropriate for a specific situation."
    },
    {
      "term": "Rhetoric",
      "definition": "The art of persuasive speaking or writing."
    },
    { "term": "Ethos", "definition": "Appeal to credibility or character." },
    { "term": "Pathos", "definition": "Appeal to emotion." },
    { "term": "Logos", "definition": "Appeal to logic and reason." },
    {
      "term": "Logical Fallacy",
      "definition": "A flaw in reasoning that undermines an argument."
    },
    {
      "term": "Ad Hominem",
      "definition": "Attacking the person rather than their argument."
    },
    {
      "term": "Straw Man",
      "definition": "Misrepresenting an opponent's argument to refute it."
    },
    {
      "term": "Generalization",
      "definition": "A broad statement based on specific examples."
    },
    {
      "term": "Analogy",
      "definition": "Comparison between two different things showing similarities."
    },
    {
      "term": "Juxtaposition",
      "definition": "Placing contrasting elements side by side."
    },
    {
      "term": "Allusion",
      "definition": "Indirect reference to another work or historical event."
    },
    {
      "term": "Idiom",
      "definition": "A phrase or expression with meaning different from individual words."
    },
    { "term": "Cliché", "definition": "An overused phrase or expression." },
    {
      "term": "Genre",
      "definition": "A category of literature with shared characteristics."
    },
    {
      "term": "Fiction",
      "definition": "Literature based on imagination rather than fact."
    },
    {
      "term": "Nonfiction",
      "definition": "Literature based on facts and real events."
    },
    {
      "term": "Poetry",
      "definition": "Literary work using language for emotional and aesthetic effect."
    },
    {
      "term": "Prose",
      "definition": "Written or spoken language in ordinary form."
    },
    {
      "term": "Drama",
      "definition": "Literature written for performance on stage."
    },
    {
      "term": "Tragedy",
      "definition": "Drama dealing with serious or disastrous events."
    },
    { "term": "Comedy", "definition": "Drama written to amuse and entertain." },
    {
      "term": "Essay",
      "definition": "Short prose composition on a specific topic."
    },
    {
      "term": "Memoir",
      "definition": "Narrative account based on writer's personal experience."
    },
    {
      "term": "Biography",
      "definition": "Account of someone's life written by another person."
    },
    {
      "term": "Autobiography",
      "definition": "Account of one's own life written by oneself."
    },
    {
      "term": "Sonnet",
      "definition": "A 14-line poem with specific rhyme scheme."
    },
    {
      "term": "Haiku",
      "definition": "A three-line poem with syllable pattern 5-7-5."
    },
    { "term": "Stanza", "definition": "A grouped set of lines in a poem." },
    { "term": "Verse", "definition": "Poetry or metrical writing." },
    {
      "term": "Meter",
      "definition": "The rhythmic pattern of stressed and unstressed syllables."
    },
    {
      "term": "Rhyme Scheme",
      "definition": "The pattern of rhymes at ends of lines."
    },
    {
      "term": "Free Verse",
      "definition": "Poetry without regular rhythm or rhyme."
    },
    {
      "term": "Blank Verse",
      "definition": "Poetry written in unrhymed iambic pentameter."
    }
  ],
  "Social Studies": [
    {
      "term": "Democracy",
      "definition": "A system of government in which citizens hold the power to make decisions through voting."
    },
    {
      "term": "Republic",
      "definition": "A form of government in which citizens elect representatives to make decisions on their behalf."
    },
    {
      "term": "Constitution",
      "definition": "A written plan that outlines the structure, powers, and limits of a government."
    },
    {
      "term": "Amendment",
      "definition": "A change or addition to a legal or governmental document, such as the U.S. Constitution."
    },
    {
      "term": "Federalism",
      "definition": "A system of government in which power is divided between a national government and state governments."
    },
    {
      "term": "Separation of Powers",
      "definition": "The division of government responsibilities into distinct branches to prevent any one branch from becoming too powerful."
    },
    {
      "term": "Checks and Balances",
      "definition": "A system that allows each branch of government to limit the powers of the other branches."
    },
    {
      "term": "Suffrage",
      "definition": "The right to vote in political elections."
    },
    {
      "term": "Civil Rights",
      "definition": "The rights of citizens to political and social freedom and equality."
    },
    {
      "term": "Industrialization",
      "definition": "The development of industries in a country or region on a wide scale."
    },
    {
      "term": "Urbanization",
      "definition": "The growth of cities and the movement of people from rural areas to urban centers."
    },
    {
      "term": "Economy",
      "definition": "The system by which goods and services are produced, distributed, and consumed."
    },
    {
      "term": "Inflation",
      "definition": "A general increase in prices and a decrease in the purchasing value of money."
    },
    {
      "term": "Gross Domestic Product",
      "definition": "The total value of all goods and services produced in a country during a specific time period."
    },
    {
      "term": "Supply and Demand",
      "definition": "The relationship between the amount of a product available and the desire of buyers for it, which affects price."
    },
    {
      "term": "Primary Source",
      "definition": "An original document or firsthand account created at the time of an event."
    },
    {
      "term": "Secondary Source",
      "definition": "A document or account that interprets or analyzes primary sources."
    },
    {
      "term": "Manifest Destiny",
      "definition": "The 19th-century belief that the United States was destined to expand across the North American continent."
    },
    {
      "term": "Reconstruction",
      "definition": "The period after the U.S. Civil War when southern states were reorganized and reintegrated into the Union."
    },
    {
      "term": "Great Depression",
      "definition": "A severe worldwide economic downturn that took place during the 1930s."
    },
    {
      "term": "Cold War",
      "definition": "The period of political tension and military rivalry between the United States and the Soviet Union after World War II."
    },
    {
      "term": "Bill of Rights",
      "definition": "The first ten amendments to the U.S. Constitution that protect individual liberties."
    },
    {
      "term": "Legislature",
      "definition": "The branch of government responsible for making laws."
    },
    {
      "term": "Executive Branch",
      "definition": "The branch of government responsible for enforcing laws."
    },
    {
      "term": "Judicial Branch",
      "definition": "The branch of government responsible for interpreting laws and administering justice."
    },
    {
      "term": "Monarchy",
      "definition": "A form of government in which a single person, such as a king or queen, rules for life."
    },
    { "term": "Tariff", "definition": "A tax imposed on imported goods." },
    {
      "term": "Treaty",
      "definition": "A formal agreement between two or more countries."
    },
    {
      "term": "Great Migration",
      "definition": "Movement of African Americans to northern cities (1910–1970)."
    },
    {
      "term": "New Deal",
      "definition": "Programs addressing Great Depression under FDR."
    },
    {
      "term": "Civil Disobedience",
      "definition": "Nonviolent refusal to obey unjust laws."
    },
    { "term": "Abolition", "definition": "Movement to end slavery." },
    {
      "term": "Ratification",
      "definition": "Formal approval of a document or amendment."
    },
    {
      "term": "Propaganda",
      "definition": "Biased information used to shape opinion."
    },
    {
      "term": "Isolationism",
      "definition": "Policy of avoiding foreign alliances."
    },
    {
      "term": "Globalization",
      "definition": "Increasing interconnectedness of economies and cultures."
    },
    { "term": "Deficit", "definition": "Spending exceeding revenue." },
    { "term": "Surplus", "definition": "Revenue exceeding spending." },
    { "term": "Budget", "definition": "Plan for income and expenditures." },
    { "term": "Embargo", "definition": "Government order restricting trade." },
    {
      "term": "Taxation",
      "definition": "System of raising money for public needs."
    },
    {
      "term": "Industrial Revolution",
      "definition": "Era of rapid industrial growth beginning in 18th century."
    },
    {
      "term": "Emancipation Proclamation",
      "definition": "1863 order freeing slaves in Confederate states."
    },
    {
      "term": "14th Amendment",
      "definition": "Granted citizenship and equal protection."
    },
    {
      "term": "15th Amendment",
      "definition": "Prohibited denying vote based on race."
    },
    { "term": "19th Amendment", "definition": "Granted women voting rights." },
    {
      "term": "Electoral College",
      "definition": "Process used to elect U.S. President."
    },
    {
      "term": "Cabinet",
      "definition": "Advisory heads of executive departments."
    },
    { "term": "Supreme Court", "definition": "Highest U.S. court." },
    {
      "term": "Judicial Review",
      "definition": "Court power to declare laws unconstitutional."
    },
    {
      "term": "Due Process",
      "definition": "Fair treatment through justice system."
    },
    { "term": "Liberty", "definition": "Freedom from oppressive control." },
    {
      "term": "Civic Duty",
      "definition": "Citizen responsibility to participate."
    },
    {
      "term": "Natural Rights",
      "definition": "Inherent rights (life, liberty, property)."
    },
    { "term": "Oligarchy", "definition": "Government ruled by a small group." },
    {
      "term": "Dictatorship",
      "definition": "Government under one absolute ruler."
    },
    {
      "term": "Totalitarian",
      "definition": "System seeking complete control over life."
    },
    {
      "term": "Segregation",
      "definition": "Separation of groups by race or other trait."
    },
    {
      "term": "Federal Budget",
      "definition": "Annual plan of government revenues and spending."
    },
    {
      "term": "Human Rights",
      "definition": "Basic rights and freedoms for all people."
    },
    {
      "term": "Capitalism",
      "definition": "Economic system based on private ownership and free markets."
    },
    {
      "term": "Socialism",
      "definition": "Economic system with collective or state ownership of production."
    },
    {
      "term": "Communism",
      "definition": "Political ideology seeking classless, stateless society."
    },
    {
      "term": "Amendment Process",
      "definition": "Formal procedure for changing the Constitution."
    },
    {
      "term": "Electoral Process",
      "definition": "System and procedures for holding elections."
    },
    {
      "term": "Political Party",
      "definition": "Organized group sharing common political goals."
    },
    {
      "term": "Bipartisan",
      "definition": "Involving or supported by two political parties."
    },
    {
      "term": "Lobbyist",
      "definition": "Person attempting to influence legislation on behalf of interests."
    },
    {
      "term": "Incumbent",
      "definition": "Person currently holding a political office."
    },
    {
      "term": "Campaign",
      "definition": "Organized effort to win an election."
    },
    {
      "term": "Platform",
      "definition": "Set of principles and policies of a political party."
    },
    {
      "term": "Diplomat",
      "definition": "Official representing their country's interests abroad."
    },
    {
      "term": "Diplomacy",
      "definition": "Negotiation and conduct of relations between nations."
    },
    {
      "term": "Sovereignty",
      "definition": "Power of a state to govern itself and make decisions."
    },
    {
      "term": "Neutral",
      "definition": "Not aligned with either side in a conflict."
    },
    {
      "term": "Alliance",
      "definition": "Formal agreement between nations for mutual benefit."
    },
    {
      "term": "Sanctions",
      "definition": "Economic or political penalties against a nation."
    },
    {
      "term": "Imperialism",
      "definition": "Policy of extending a nation's power through colonization."
    },
    {
      "term": "Colonialism",
      "definition": "Establishment and maintenance of colonies by foreign powers."
    },
    {
      "term": "Nationalism",
      "definition": "Devotion to the interests of one's own nation."
    },
    {
      "term": "Cultural Diffusion",
      "definition": "Spread of cultural beliefs and practices between groups."
    },
    {
      "term": "Migration",
      "definition": "Movement of people from one place to another."
    },
    {
      "term": "Persecution",
      "definition": "Hostile treatment of a person or group."
    },
    {
      "term": "Genocide",
      "definition": "Deliberate attempt to destroy an ethnic or cultural group."
    },
    {
      "term": "Refugee",
      "definition": "Person fleeing persecution or danger."
    },
    {
      "term": "Asylum",
      "definition": "Protection granted to refugees by a nation."
    },
    {
      "term": "Discrimination",
      "definition": "Unjust treatment based on group membership."
    },
    {
      "term": "Prejudice",
      "definition": "Negative preconceived notion about a group."
    },
    {
      "term": "Stereotype",
      "definition": "Generalized, often inaccurate belief about a group."
    },
    { "term": "Literacy", "definition": "Ability to read and write." },
    { "term": "Education", "definition": "Process of teaching and learning." },
    {
      "term": "Infrastructure",
      "definition": "Basic systems and facilities supporting a society."
    },
    {
      "term": "Natural Resources",
      "definition": "Materials supplied by nature useful to humans."
    },
    {
      "term": "Conservation",
      "definition": "Protection and preservation of natural resources."
    },
    {
      "term": "Sustainability",
      "definition": "Meeting present needs without harming future generations."
    },
    {
      "term": "Environmental Protection",
      "definition": "Safeguarding nature and ecosystems."
    },
    {
      "term": "Fossil Fuel",
      "definition": "Energy source formed from ancient organic material."
    },
    {
      "term": "Renewable Energy",
      "definition": "Energy from sources that naturally replenish."
    },
    {
      "term": "Climate Change",
      "definition": "Long-term shift in global temperatures and weather patterns."
    },
    { "term": "Recession", "definition": "Temporary economic decline." },
    {
      "term": "Depression (Economic)",
      "definition": "Extended severe economic downturn."
    },
    {
      "term": "Unemployment",
      "definition": "Condition of being without a job."
    },
    {
      "term": "Minimum Wage",
      "definition": "Lowest hourly wage employers legally pay workers."
    },
    {
      "term": "Trade",
      "definition": "Exchange of goods and services between nations."
    },
    {
      "term": "Imports",
      "definition": "Goods brought into a country from abroad."
    },
    {
      "term": "Exports",
      "definition": "Goods sent from one country to another."
    },
    { "term": "Currency", "definition": "Money in circulation in a country." },
    {
      "term": "Inflation Rate",
      "definition": "Percentage increase in overall prices over time."
    },
    {
      "term": "Stock Market",
      "definition": "Place where shares of companies are bought and sold."
    },
    {
      "term": "Bond",
      "definition": "Debt security issued by governments or corporations."
    },
    {
      "term": "Investment",
      "definition": "Money committed to earn future financial returns."
    },
    { "term": "Dividend", "definition": "Profit distributed to shareholders." },
    {
      "term": "Monopoly",
      "definition": "Exclusive control of a product or service by one entity."
    },
    {
      "term": "Antitrust Law",
      "definition": "Legislation preventing unfair business practices."
    },
    {
      "term": "Regulation",
      "definition": "Government rule controlling conduct or practice."
    },
    {
      "term": "Labor Movement",
      "definition": "Organized action by workers for better conditions."
    },
    {
      "term": "Union",
      "definition": "Organization of workers advocating for their rights."
    },
    {
      "term": "Strike",
      "definition": "Work stoppage by employees seeking concessions."
    },
    {
      "term": "Collective Bargaining",
      "definition": "Negotiation between employer and organized workers."
    },
    {
      "term": "Compromise",
      "definition": "Settlement where each side gives up something."
    }
  ]
}
