{
  "Science": [
    {
      "term": "Hypothesis",
      "definition": "A testable explanation for an observation that can be supported or refuted through experimentation."
    },
    {
      "term": "Variable",
      "definition": "A factor in an experiment that can change or be controlled."
    },
    {
      "term": "Control Group",
      "definition": "The group in an experiment that does not receive the independent variable and is used for comparison."
    },
    {
      "term": "Ecosystem",
      "definition": "A community of living organisms interacting with each other and with their physical environment."
    },
    {
      "term": "Photosynthesis",
      "definition": "The process by which plants use light energy to convert carbon dioxide and water into glucose and oxygen."
    },
    {
      "term": "Cellular Respiration",
      "definition": "The process in which cells break down glucose and oxygen to release energy, carbon dioxide, and water."
    },
    {
      "term": "Mitosis",
      "definition": "A type of cell division that results in two identical daughter cells."
    },
    {
      "term": "DNA",
      "definition": "The molecule that carries genetic information in living organisms."
    },
    {
      "term": "Atom",
      "definition": "The smallest unit of an element that retains the properties of that element."
    },
    {
      "term": "Molecule",
      "definition": "Two or more atoms that are chemically bonded together."
    },
    {
      "term": "Gravity",
      "definition": "The force of attraction between objects with mass."
    },
    {
      "term": "Qualitative Observation",
      "definition": "An observation that describes qualities or characteristics without using numbers."
    },
    {
      "term": "Quantitative Observation",
      "definition": "An observation that uses numbers or measurements to describe what is observed."
    },
    {
      "term": "Homeostasis",
      "definition": "The process by which organisms maintain stable internal conditions despite external changes."
    },
    {
      "term": "Independent Variable",
      "definition": "The factor that is purposely changed in an experiment to test its effect."
    },
    {
      "term": "Dependent Variable",
      "definition": "The factor that is measured in an experiment and changes in response to the independent variable."
    },
    {
      "term": "Scientific Method",
      "definition": "A systematic process of asking questions, forming hypotheses, conducting experiments, and drawing conclusions."
    },
    {
      "term": "Plate Tectonics",
      "definition": "The theory explaining the movement of Earth's lithospheric plates and the activity at their boundaries."
    },
    {
      "term": "Fossil",
      "definition": "The preserved remains, impression, or trace of an organism from the past."
    },
    {
      "term": "Energy Transfer",
      "definition": "The movement of energy from one object or system to another."
    }
  ],
  "Math": [
    {
      "term": "Integer",
      "definition": "A whole number that can be positive, negative, or zero."
    },
    {
      "term": "Fraction",
      "definition": "A number that represents a part of a whole or a part of a set."
    },
    {
      "term": "Decimal",
      "definition": "A number that uses a decimal point to show a value smaller than one."
    },
    {
      "term": "Percent",
      "definition": "A ratio that compares a number to 100."
    },
    {
      "term": "Ratio",
      "definition": "A comparison of two quantities by division."
    },
    {
      "term": "Proportion",
      "definition": "An equation stating that two ratios are equivalent."
    },
    {
      "term": "Equation",
      "definition": "A mathematical statement that shows two expressions are equal."
    },
    {
      "term": "Variable",
      "definition": "A symbol, usually a letter, that represents an unknown value."
    },
    {
      "term": "Coefficient",
      "definition": "The number that is multiplied by a variable in an algebraic expression."
    },
    {
      "term": "Expression",
      "definition": "A mathematical phrase that can contain numbers, variables, and operations."
    },
    {
      "term": "Inequality",
      "definition": "A mathematical statement that compares two expressions using greater than, less than, or equal to symbols."
    },
    {
      "term": "Slope",
      "definition": "A measure of the steepness of a line, found by the ratio of rise over run."
    },
    {
      "term": "Quadratic Equation",
      "definition": "An equation in the form ax² + bx + c = 0, where a, b, and c are constants and a ≠ 0."
    },
    {
      "term": "Linear Function",
      "definition": "A function whose graph is a straight line."
    },
    {
      "term": "Pythagorean Theorem",
      "definition": "A formula that relates the side lengths of a right triangle: a² + b² = c²."
    },
    {
      "term": "Mean",
      "definition": "The average of a set of numbers, found by adding the numbers and dividing by how many there are."
    },
    {
      "term": "Median",
      "definition": "The middle value in an ordered set of numbers."
    },
    {
      "term": "Mode",
      "definition": "The number that appears most often in a set of data."
    },
    {
      "term": "Range",
      "definition": "The difference between the highest and lowest values in a data set."
    },
    {
      "term": "Probability",
      "definition": "The likelihood that an event will occur, expressed as a ratio, fraction, or percent."
    },
    {
      "term": "Factor",
      "definition": "A number that divides another number evenly."
    },
    {
      "term": "Multiple",
      "definition": "The product of a number and any whole number."
    },
    {
      "term": "Prime Number",
      "definition": "A whole number greater than 1 that has exactly two factors: 1 and itself."
    },
    {
      "term": "Composite Number",
      "definition": "A whole number greater than 1 that has more than two factors."
    },
    {
      "term": "Perimeter",
      "definition": "The total distance around the outside of a shape."
    },
    {
      "term": "Area",
      "definition": "The amount of surface covered by a shape."
    },
    {
      "term": "Volume",
      "definition": "The amount of space a three-dimensional object occupies."
    },
    {
      "term": "Circumference",
      "definition": "The distance around a circle."
    },
    {
      "term": "Exponent",
      "definition": "A small number written above and to the right of a base number that shows how many times the base is multiplied by itself."
    },
    {
      "term": "Order of Operations",
      "definition": "The rules that tell you the correct sequence to evaluate a mathematical expression (PEMDAS)."
    }
  ],
  "Reasoning Through Language Arts (RLA)": [
    {
      "term": "Main Idea",
      "definition": "The central point or most important concept that an author wants the reader to understand."
    },
    {
      "term": "Supporting Detail",
      "definition": "Information that explains, proves, or enhances the main idea."
    },
    {
      "term": "Inference",
      "definition": "A conclusion reached by using evidence from the text and your own reasoning."
    },
    {
      "term": "Tone",
      "definition": "The author's attitude toward the subject or audience."
    },
    {
      "term": "Theme",
      "definition": "The underlying message or lesson the author wants to convey."
    },
    {
      "term": "Thesis Statement",
      "definition": "A sentence that states the main point or argument of an essay."
    },
    {
      "term": "Topic Sentence",
      "definition": "The sentence that expresses the main idea of a paragraph."
    },
    {
      "term": "Transition",
      "definition": "A word or phrase that connects ideas and helps writing flow smoothly."
    },
    {
      "term": "Evidence",
      "definition": "Facts, examples, or details used to support a claim."
    },
    {
      "term": "Claim",
      "definition": "A statement or position that requires support."
    },
    {
      "term": "Counterclaim",
      "definition": "An opposing viewpoint that challenges the writer's claim."
    },
    {
      "term": "Audience",
      "definition": "The specific group of readers or listeners a text is written for."
    },
    {
      "term": "Purpose",
      "definition": "The reason why an author writes a text: to inform, persuade, entertain, or explain."
    },
    {
      "term": "Figurative Language",
      "definition": "Words or expressions that go beyond literal meaning, such as metaphors and similes."
    },
    {
      "term": "Metaphor",
      "definition": "A comparison between two unlike things without using like or as."
    },
    {
      "term": "Simile",
      "definition": "A comparison between two unlike things using the words like or as."
    },
    {
      "term": "Connotation",
      "definition": "The emotional or cultural meaning attached to a word."
    },
    {
      "term": "Denotation",
      "definition": "The literal, dictionary definition of a word."
    },
    {
      "term": "Context Clues",
      "definition": "Hints within a sentence or paragraph that help the reader determine the meaning of an unfamiliar word."
    },
    {
      "term": "Revising",
      "definition": "Improving a draft by adding, removing, or rearranging ideas for clarity and effectiveness."
    },
    {
      "term": "Editing",
      "definition": "Correcting grammar, spelling, and punctuation errors in a draft."
    },
    {
      "term": "Proofreading",
      "definition": "Reviewing a final draft carefully to catch small errors before publishing."
    },
    {
      "term": "Persuasive Writing",
      "definition": "Writing that aims to convince the reader to accept a viewpoint or take a specific action."
    },
    {
      "term": "Narrative Writing",
      "definition": "Writing that tells a story with characters, setting, and plot."
    },
    {
      "term": "Informational Text",
      "definition": "Nonfiction writing that provides facts about a topic."
    },
    {
      "term": "Point of View",
      "definition": "The perspective from which a story is told."
    },
    {
      "term": "First-Person Point of View",
      "definition": "A storytelling perspective in which the narrator is a character in the story and uses words like I and we."
    },
    {
      "term": "Third-Person Point of View",
      "definition": "A storytelling perspective where the narrator is outside the story and uses words like he, she, or they."
    },
    {
      "term": "Chronological Order",
      "definition": "A text structure that presents events in the order they happened."
    },
    {
      "term": "Cause and Effect",
      "definition": "A text structure that explains why something happens and the result of it."
    }
  ],
  "Social Studies": [
    {
      "term": "Democracy",
      "definition": "A system of government in which citizens hold the power to make decisions through voting."
    },
    {
      "term": "Republic",
      "definition": "A form of government in which citizens elect representatives to make decisions on their behalf."
    },
    {
      "term": "Constitution",
      "definition": "A written plan that outlines the structure, powers, and limits of a government."
    },
    {
      "term": "Amendment",
      "definition": "A change or addition to a legal or governmental document, such as the U.S. Constitution."
    },
    {
      "term": "Federalism",
      "definition": "A system of government in which power is divided between a national government and state governments."
    },
    {
      "term": "Separation of Powers",
      "definition": "The division of government responsibilities into distinct branches to prevent any one branch from becoming too powerful."
    },
    {
      "term": "Checks and Balances",
      "definition": "A system that allows each branch of government to limit the powers of the other branches."
    },
    {
      "term": "Suffrage",
      "definition": "The right to vote in political elections."
    },
    {
      "term": "Civil Rights",
      "definition": "The rights of citizens to political and social freedom and equality."
    },
    {
      "term": "Industrialization",
      "definition": "The development of industries in a country or region on a wide scale."
    },
    {
      "term": "Urbanization",
      "definition": "The growth of cities and the movement of people from rural areas to urban centers."
    },
    {
      "term": "Immigration",
      "definition": "The movement of people into a country from another country."
    },
    {
      "term": "Cultural Diffusion",
      "definition": "The spread of cultural beliefs and practices from one group to another."
    },
    {
      "term": "Economy",
      "definition": "The system by which goods and services are produced, distributed, and consumed."
    },
    {
      "term": "Inflation",
      "definition": "A general increase in prices and a decrease in the purchasing value of money."
    },
    {
      "term": "Gross Domestic Product",
      "definition": "The total value of all goods and services produced in a country during a specific time period."
    },
    {
      "term": "Supply and Demand",
      "definition": "The relationship between the amount of a product available and the desire of buyers for it, which affects price."
    },
    {
      "term": "Primary Source",
      "definition": "An original document or firsthand account created at the time of an event."
    },
    {
      "term": "Secondary Source",
      "definition": "A document or account that interprets or analyzes primary sources."
    },
    {
      "term": "Manifest Destiny",
      "definition": "The 19th-century belief that the United States was destined to expand across the North American continent."
    },
    {
      "term": "Reconstruction",
      "definition": "The period after the U.S. Civil War when southern states were reorganized and reintegrated into the Union."
    },
    {
      "term": "Great Depression",
      "definition": "A severe worldwide economic downturn that took place during the 1930s."
    },
    {
      "term": "Cold War",
      "definition": "The period of political tension and military rivalry between the United States and the Soviet Union after World War II."
    },
    {
      "term": "Bill of Rights",
      "definition": "The first ten amendments to the U.S. Constitution that protect individual liberties."
    },
    {
      "term": "Legislature",
      "definition": "The branch of government responsible for making laws."
    },
    {
      "term": "Executive Branch",
      "definition": "The branch of government responsible for enforcing laws."
    },
    {
      "term": "Judicial Branch",
      "definition": "The branch of government responsible for interpreting laws and administering justice."
    },
    {
      "term": "Monarchy",
      "definition": "A form of government in which a single person, such as a king or queen, rules for life."
    },
    {
      "term": "Tariff",
      "definition": "A tax imposed on imported goods."
    },
    {
      "term": "Treaty",
      "definition": "A formal agreement between two or more countries."
    }
  ]
}
