{
                  "questionNumber": 1,
                  "type": "multipleChoice",
                  "difficulty": "medium",
                  "question": "Which British policy prompted colonial leaders to convene the First Continental Congress in 1774?",
                    {
                      "text": "The passage of the Coercive (Intolerable) Acts",
                      "isCorrect": true,
                      "rationale": "Correct. The harsh Coercive Acts imposed on Massachusetts pushed the colonies to coordinate a joint response."
                    },
                    {
                      "text": "The repeal of the Stamp Act",
                      "isCorrect": false,
                      "rationale": "Repealing the Stamp Act eased tensions rather than triggering the Congress."
                    },
                    {
                      "text": "The signing of the Treaty of Paris in 1763",
                      "isCorrect": false,
                      "rationale": "That treaty ended the French and Indian War a decade earlier."
                    },
                    {
                      "text": "The introduction of the Proclamation Line of 1763",
                      "isCorrect": false,
                      "rationale": "The proclamation angered colonists, but it did not directly lead to the First Continental Congress."
                    }
                  ]
                  "questionNumber": 2,
                  "type": "multipleChoice",
                  "difficulty": "medium",
                  "question": "What was the primary purpose of the colonial Committees of Correspondence?",
                    {
                      "text": "To coordinate communication and resistance strategies among the colonies",
                      "isCorrect": true,
                      "rationale": "Correct. The committees linked colonial legislatures and activists so they could share news and plan responses."
                    },
                    {
                      "text": "To recruit soldiers for the Continental Army",
                      "isCorrect": false,
                      "rationale": "Recruiting soldiers was handled later by provincial congresses and the Continental Army."
                    },
                    {
                      "text": "To negotiate trade treaties with European powers",
                      "isCorrect": false,
                      "rationale": "Foreign diplomacy was not the main role of the committees."
                    },
                    {
                      "text": "To collect taxes owed to Parliament",
                      "isCorrect": false,
                      "rationale": "The committees were a tool of resistance, not tax collection."
                    }
                  ]
                  "questionNumber": 3,
                  "question": "Why was the Battle of Bunker Hill significant for the patriot cause?",
                      "text": "It proved that colonial militia could challenge professional British troops",
                      "rationale": "Correct. Heavy British casualties demonstrated that patriot forces could stand up to the British army."
                      "text": "It secured a decisive victory that forced Britain to recognize independence",
                      "rationale": "The British technically won the ground, and independence would not be recognized for years."
                      "text": "It ended the British naval blockade of Boston Harbor",
                      "rationale": "The blockade continued even after the battle."
                      "text": "It convinced Spain to join the war on the American side",
                      "rationale": "Spain did not join the war until later and was influenced by other factors."
                  ]
                  "questionNumber": 4,
                  "question": "What did the Olive Branch Petition of 1775 ask King George III to do?",
                      "text": "Restore harmony by addressing colonial grievances without war",
                      "rationale": "Correct. The petition professed loyalty but requested the King to halt hostilities and negotiate."
                      "text": "Recognize the Continental Congress as the new colonial parliament",
                      "rationale": "It did not demand recognition of a new governing body."
                      "text": "Grant immediate independence to the thirteen colonies",
                      "rationale": "The petition sought reconciliation, not independence."
                      "text": "Punish Parliament for imposing new taxes",
                      "rationale": "The petition focused on ending conflict, not punishing Parliament."
                  ]
                  "questionNumber": 5,
                  "difficulty": "medium",
                  "question": "Which writer’s pamphlet “Common Sense” persuaded many colonists to support independence?",
                      "text": "Thomas Paine",
                      "rationale": "Correct. Paine’s plain-language arguments for republican government reached a wide audience."
                      "text": "John Dickinson",
                      "rationale": "Dickinson wrote the “Letters from a Farmer in Pennsylvania,” urging moderation."
                      "text": "Mercy Otis Warren",
                      "rationale": "Warren wrote plays and histories supporting the patriot cause but not “Common Sense.”"
                      "text": "Alexander Hamilton",
                      "rationale": "Hamilton authored other pamphlets but not “Common Sense.”"
                  ]
                  "questionNumber": 6,
                  "question": "What central idea is expressed in the Declaration of Independence’s preamble?",
                      "text": "Government derives its power from the consent of the governed",
                      "rationale": "Correct. The preamble lays out natural rights and the principle of popular sovereignty."
                      "text": "Colonies must remain loyal to the British Crown",
                      "rationale": "The Declaration rejects the notion of perpetual loyalty to the Crown."
                      "text": "Religious freedom should be guaranteed in the new nation",
                      "rationale": "Religious liberty is valued, but the preamble focuses on natural rights and consent."
                      "text": "The United States would immediately form a permanent army",
                      "rationale": "The document makes no such promise about military policy."
                  ]
                  "questionNumber": 7,
                  "question": "Which alliance formally recognized the United States and provided vital military support in 1778?",
                      "text": "The Treaty of Alliance with France",
                      "rationale": "Correct. France recognized American independence and pledged military aid."
                      "text": "The Franco-Spanish Pact",
                      "rationale": "Spain aided the patriots later but did not sign this treaty."
                      "text": "The Jay-Gardoqui Treaty",
                      "rationale": "This proposed treaty with Spain was never ratified."
                      "text": "The Treaty of Greenville",
                      "rationale": "That treaty dealt with Native American nations after the Revolutionary War."
                  ]
                  "questionNumber": 8,
                  "question": "How did Marquis de Lafayette contribute to the American Revolution?",
                      "text": "He volunteered as a military officer and helped secure French support",
                      "rationale": "Correct. Lafayette served on Washington’s staff and used his influence to gain French aid."
                      "text": "He negotiated the Treaty of Paris",
                      "rationale": "American diplomats, including John Jay and Benjamin Franklin, negotiated the treaty."
                      "text": "He commanded the British navy in North America",
                      "rationale": "Lafayette fought for the patriot cause, not the British."
                      "text": "He led the capture of Fort Ticonderoga in 1775",
                      "rationale": "That mission was led by Ethan Allen and Benedict Arnold."
                  ]
                  "questionNumber": 9,
                  "difficulty": "medium",
                  "question": "Why was Washington’s victory at Trenton on December 26, 1776, so important?",
                      "text": "It revived patriot morale after a series of defeats",
                      "rationale": "Correct. The surprise attack on Hessian troops boosted morale and encouraged reenlistments."
                      "text": "It captured the main British army and ended the war",
                      "rationale": "The British war effort continued for several years."
                      "text": "It convinced the Dutch Republic to enter the war",
                      "rationale": "Dutch support came later, largely through loans."
                      "text": "It forced Britain to abandon New York City",
                      "rationale": "Britain retained New York until the end of the war."
                  ]
                  "questionNumber": 10,
                  "question": "What governmental framework was created by the Articles of Confederation in 1777?",
                      "text": "A loose confederation of sovereign states with a weak central Congress",
                      "rationale": "Correct. The Articles emphasized state power and limited national authority."
                      "text": "A strong executive-led national government modeled on the British system",
                      "rationale": "The Articles lacked a chief executive entirely."
                      "text": "A federal judiciary capable of enforcing laws on the states",
                      "rationale": "The Articles created no national court system."
                      "text": "A parliamentary union that included representatives from British colonies in Canada",
                      "rationale": "Canada was invited to join but never did, and the structure was not parliamentary."
                  ]
                  "questionNumber": 11,
                  "difficulty": "medium",
                  "question": "What was one outcome of the 1777 Battle of Saratoga?",
                      "text": "It persuaded France to openly support the American cause",
                      "rationale": "Correct. The victory convinced France the patriots could win and helped secure the alliance."
                      "text": "It forced General Washington to retreat into New Jersey",
                      "rationale": "Washington was not present at Saratoga."
                      "text": "It ended British occupation of Boston Harbor",
                      "rationale": "Boston had already been evacuated in 1776."
                      "text": "It resulted in British control of the Hudson River",
                      "rationale": "The patriots captured Burgoyne’s army and retained control of the region."
                  ]
                  "questionNumber": 12,
                  "difficulty": "medium",
                  "question": "Which provision of the Treaty of Paris (1783) benefited the United States?",
                      "text": "Recognition of U.S. independence and territory stretching to the Mississippi River",
                      "rationale": "Correct. Britain acknowledged independence and granted generous western boundaries."
                      "text": "British retention of forts along the Great Lakes indefinitely",
                      "rationale": "Britain agreed to evacuate those forts, though it delayed doing so."
                      "text": "Spanish control of the port of New Orleans",
                      "rationale": "Spain gained Florida, not New Orleans, which it already controlled."
                      "text": "Guarantees of voting rights for all adult male colonists",
                      "rationale": "Voting rights were left to the individual states."
                  ]
                  "questionNumber": 1,
                  "type": "multipleChoice",
                  "difficulty": "medium",
                  "question": "Why was the 1777 American victory at Saratoga considered a turning point in the war?",
                    {
                      "text": "It secured a formal military alliance with France",
                      "isCorrect": true,
                      "rationale": "Correct. Saratoga convinced France to provide open military and financial support."
                    },
                    {
                      "text": "It forced Britain to abandon all forts in Canada",
                      "isCorrect": false,
                      "rationale": "The battle took place in New York, and Britain retained Canada."
                    },
                    {
                      "text": "It ended Loyalist resistance in the southern colonies",
                      "isCorrect": false,
                      "rationale": "Fighting in the South escalated later in the war."
                    },
                    {
                      "text": "It led directly to the surrender of General Cornwallis",
                      "isCorrect": false,
                      "rationale": "Cornwallis surrendered at Yorktown in 1781."
                    }
                  ]
                  "questionNumber": 2,
                  "type": "multipleChoice",
                  "difficulty": "medium",
                  "question": "What hardship did Washington’s army endure at Valley Forge during the winter of 1777–1778?",
                    {
                      "text": "Severe shortages of food, clothing, and shelter",
                      "isCorrect": true,
                      "rationale": "Correct. Soldiers suffered greatly from supply shortages until reforms improved logistics."
                    },
                    {
                      "text": "A massive smallpox epidemic that wiped out the army",
                      "isCorrect": false,
                      "rationale": "Inoculation kept smallpox under control."
                    },
                    {
                      "text": "Continuous British attacks on the encampment",
                      "isCorrect": false,
                      "rationale": "The army faced cold and scarcity but not daily British assaults."
                    },
                    {
                      "text": "A naval blockade that trapped the army on the Delaware River",
                      "isCorrect": false,
                      "rationale": "The army was encamped on land away from naval operations."
                    }
                  ]
                  "questionNumber": 3,
                  "difficulty": "medium",
                  "question": "How did Baron von Steuben assist the Continental Army?",
                      "text": "He drilled soldiers at Valley Forge and introduced a disciplined training program",
                      "rationale": "Correct. Von Steuben standardized drills and tactics that improved the army’s effectiveness."
                      "text": "He negotiated loans from Dutch bankers",
                      "rationale": "American diplomats handled foreign financing."
                      "text": "He commanded the Continental Navy during the war",
                      "rationale": "Von Steuben was an infantry officer."
                      "text": "He served as the first U.S. ambassador to France",
                      "rationale": "Benjamin Franklin held that role."
                  ]
                  "questionNumber": 4,
                  "question": "Why did the British government adopt a “southern strategy” after 1778?",
                      "text": "It expected strong Loyalist support in the Carolinas and Georgia",
                      "rationale": "Correct. British leaders believed Loyalists in the South would help regain control."
                      "text": "It needed to protect sugar plantations in the Caribbean",
                      "rationale": "The southern strategy focused on the mainland colonies."
                      "text": "It sought to capture the Continental Congress in Philadelphia",
                      "rationale": "Philadelphia had already been evacuated by the British."
                      "text": "It aimed to blockade all New England ports",
                      "rationale": "Naval blockades continued, but the strategy centered on southern campaigns."
                  ]
                  "questionNumber": 5,
                  "difficulty": "medium",
                  "question": "Which patriot victory in 1780 blunted British momentum in the southern colonies?",
                      "text": "The Battle of Kings Mountain",
                      "rationale": "Correct. Frontier militia defeated Loyalist forces, weakening British plans."
                      "text": "The Battle of Long Island",
                      "rationale": "Long Island was a British victory early in the war."
                      "text": "The Battle of Quebec",
                      "rationale": "That failed American attack occurred in 1775."
                      "text": "The Battle of Lexington",
                      "rationale": "Lexington and Concord took place in 1775 in Massachusetts."
                  ]
                  "questionNumber": 6,
                  "question": "What role did privateers play during the American Revolution?",
                      "text": "They disrupted British commerce by capturing supply ships",
                      "rationale": "Correct. Privateers raided British shipping and strained the empire’s supply lines."
                      "text": "They transported enslaved people to Spanish Florida",
                      "rationale": "Privateers targeted British vessels, not human trafficking operations."
                      "text": "They served as diplomats to secure foreign alliances",
                      "rationale": "Privateers were privately owned warships, not diplomatic envoys."
                      "text": "They protected British merchants from American raids",
                      "rationale": "Privateers served the patriot cause."
                  ]
                  "questionNumber": 7,
                  "difficulty": "medium",
                  "question": "Which diplomatic achievement helped secure French military assistance for the patriots?",
                      "text": "Benjamin Franklin’s negotiation of the Treaty of Alliance",
                      "rationale": "Correct. Franklin’s diplomacy won French recognition and aid."
                      "text": "John Jay’s negotiation of the Jay Treaty",
                      "rationale": "The Jay Treaty was negotiated with Britain in the 1790s."
                      "text": "James Madison’s authorship of the Virginia Plan",
                      "rationale": "The Virginia Plan related to the Constitutional Convention of 1787."
                      "text": "Patrick Henry’s speech opposing the Stamp Act",
                      "rationale": "Henry’s speech predated the alliance efforts."
                  ]
                  "questionNumber": 8,
                  "question": "Which of the following best describes the contributions of women to the patriot war effort?",
                      "text": "They managed farms and businesses, produced supplies, and in some cases aided troops directly",
                      "rationale": "Correct. Women sustained households, made clothing, and sometimes served as nurses or camp followers."
                      "text": "They gained full voting rights in every state",
                      "rationale": "Voting rights for women were not granted during the Revolution."
                      "text": "They were drafted into the Continental Army",
                      "rationale": "Women were not conscripted into combat units."
                      "text": "They were prohibited from participating in boycotts",
                      "rationale": "Women actively supported boycotts and other protests."
                  ]
                  "questionNumber": 9,
                  "question": "What was a direct consequence of the patriot victory at Yorktown in 1781?",
                      "text": "British political leaders began negotiating a peace settlement",
                      "rationale": "Correct. Yorktown convinced Parliament to seek peace and led to the Treaty of Paris."
                      "text": "General Washington resigned his commission immediately",
                      "rationale": "Washington resigned after the Treaty of Paris was signed."
                      "text": "Spain gained control of Canada",
                      "rationale": "Spain recovered Florida, not Canada."
                      "text": "France withdrew all military support",
                      "rationale": "French assistance continued through the end of the war."
                  ]
                  "questionNumber": 10,
                  "difficulty": "medium",
                  "question": "How did the Revolution affect enslaved African Americans in the South?",
                      "text": "Some gained freedom by escaping to British lines, though slavery largely persisted",
                      "rationale": "Correct. British proclamations offered freedom, but the institution endured after the war."
                      "text": "The Continental Congress abolished slavery nationwide in 1781",
                      "rationale": "No national emancipation law was passed during the war."
                      "text": "All enslaved people were relocated to the Caribbean",
                      "rationale": "There was no mass relocation policy."
                      "text": "Southern legislatures compensated enslaved laborers for wartime service",
                      "rationale": "Enslaved people were rarely compensated for their contributions."
                  ]
                  "questionNumber": 11,
                  "question": "What did the Treaty of Paris (1783) stipulate regarding Loyalists?",
                      "text": "States were encouraged to restore Loyalist property that had been confiscated",
                      "rationale": "Correct. The treaty recommended restitution, though enforcement was uneven."
                      "text": "All Loyalists were deported to British Canada",
                      "rationale": "Many Loyalists emigrated, but deportation was not mandated."
                      "text": "Loyalists automatically gained seats in the new U.S. Congress",
                      "rationale": "There was no such political guarantee."
                      "text": "Loyalists were granted independent colonies in the West",
                      "rationale": "No western Loyalist colonies were established."
                  ]
                  "questionNumber": 12,
                  "difficulty": "medium",
                  "question": "Why were loans from the Dutch Republic significant to the patriot cause?",
                      "text": "They provided much-needed credit to finance the Continental Army",
                      "rationale": "Correct. Dutch loans supplied funds when the Continental Congress lacked revenue."
                      "text": "They guaranteed Dutch military intervention in the war",
                      "rationale": "The Dutch offered financial support, not direct military intervention."
                      "text": "They forced Britain to abandon its naval blockade",
                      "rationale": "The blockade persisted despite foreign loans."
                      "text": "They compelled Spain to join the British side",
                      "rationale": "Spain fought against Britain during the war."
                  ]
                  "questionNumber": 1,
                  "type": "multipleChoice",
                  "difficulty": "medium",
                  "question": "What was a major weakness of the national government under the Articles of Confederation?",
                    {
                      "text": "It lacked the power to levy taxes directly on citizens",
                      "isCorrect": true,
                      "rationale": "Correct. Without taxation authority, Congress struggled to pay debts and fund national needs."
                    },
                    {
                      "text": "It possessed a strong executive branch that dominated the states",
                      "isCorrect": false,
                      "rationale": "The Articles created no executive branch."
                    },
                    {
                      "text": "It could easily regulate interstate commerce",
                      "isCorrect": false,
                      "rationale": "Regulating trade among states was another weakness."
                    },
                    {
                      "text": "It allowed Congress to draft soldiers without state approval",
                      "isCorrect": false,
                      "rationale": "Congress relied on state militias for troops."
                    }
                  ]
                  "questionNumber": 2,
                  "type": "multipleChoice",
                  "difficulty": "medium",
                  "question": "How did Shays’ Rebellion influence American political leaders?",
                    {
                      "text": "It convinced many that a stronger national government was necessary",
                      "isCorrect": true,
                      "rationale": "Correct. The uprising highlighted the inability of the Confederation government to maintain order."
                    },
                    {
                      "text": "It led to immediate ratification of the Bill of Rights",
                      "isCorrect": false,
                      "rationale": "The rebellion predated the Constitution and Bill of Rights."
                    },
                    {
                      "text": "It resulted in Massachusetts rejoining the British Empire",
                      "isCorrect": false,
                      "rationale": "The rebellion sought debt relief, not reunion with Britain."
                    },
                    {
                      "text": "It demonstrated the success of the Confederation’s tax policies",
                      "isCorrect": false,
                      "rationale": "The rebellion stemmed from grievances about debt and taxation."
                    }
                  ]
                  "questionNumber": 3,
                  "question": "Which idea from the Declaration of Independence most influenced new state constitutions after the war?",
                      "text": "Government should rest on the consent of the governed",
                      "rationale": "Correct. Many state constitutions expanded voting rights and emphasized popular sovereignty."
                      "text": "Monarchies provide the most stable form of government",
                      "rationale": "The Declaration denounced monarchy."
                      "text": "The British Parliament should remain the legislative authority",
                      "rationale": "States rejected British legislative control."
                      "text": "Religious leaders must hold political office",
                      "rationale": "While some states retained established churches, most separated political power from clergy."
                  ]
                  "questionNumber": 4,
                  "difficulty": "medium",
                  "question": "Why was the Northwest Ordinance of 1787 significant?",
                      "text": "It established a process for territories to become states and banned slavery in the Northwest Territory",
                      "rationale": "Correct. The ordinance set orderly statehood procedures and prohibited slavery north of the Ohio River."
                      "text": "It granted France control over the Mississippi River",
                      "rationale": "The ordinance addressed U.S. governance of the Northwest Territory."
                      "text": "It required Native nations to receive full citizenship",
                      "rationale": "The ordinance did not grant citizenship to Native peoples."
                      "text": "It allowed the national government to tax imports",
                      "rationale": "Taxing imports required separate legislation."
                  ]
                  "questionNumber": 5,
                  "question": "How did the Treaty of Paris (1783) affect Native American nations in the Ohio Valley?",
                      "text": "Their lands were ceded to the United States without their participation in negotiations",
                      "rationale": "Correct. Britain surrendered territory claimed by Native nations, leading to future conflicts."
                      "text": "They gained guaranteed representation in the Continental Congress",
                      "rationale": "The treaty offered no political representation for Native nations."
                      "text": "They received independent homelands recognized by Britain",
                      "rationale": "No sovereign Native homelands were created by the treaty."
                      "text": "They formed a permanent military alliance with Spain",
                      "rationale": "Spain was not part of the treaty negotiations over the Ohio Valley."
                  ]
                  "questionNumber": 6,
                  "question": "What did the concept of “republican motherhood” encourage women to do after the Revolution?",
                      "text": "Educate their children to become virtuous, informed citizens",
                      "rationale": "Correct. Republican motherhood emphasized women’s role in shaping the republic through education."
                      "text": "Vote in national elections for the first time",
                      "rationale": "Women generally remained excluded from voting."
                      "text": "Serve as delegates in the Constitutional Convention",
                      "rationale": "No women served as delegates."
                      "text": "Join state militias as commissioned officers",
                      "rationale": "Women were not commissioned in militias."
                  ]
                  "questionNumber": 7,
                  "question": "Which nation regained control of Florida as a result of the Treaty of Paris (1783)?",
                      "text": "Spain",
                      "rationale": "Correct. Spain regained Florida from Britain after assisting the American cause."
                      "text": "France",
                      "rationale": "France gained no territorial adjustments in North America at the treaty."
                      "text": "The Netherlands",
                      "rationale": "The Netherlands focused on trade concessions, not territory."
                      "text": "Portugal",
                      "rationale": "Portugal was not a party to the treaty."
                  ]
                  "questionNumber": 8,
                  "question": "How did the American Revolution influence future independence movements abroad?",
                      "text": "It demonstrated that colonies could successfully break from a European empire",
                      "rationale": "Correct. The American example inspired movements in France, Haiti, and Latin America."
                      "text": "It convinced European monarchies to strengthen colonial control",
                      "rationale": "If anything, it alarmed monarchies about colonial unrest."
                      "text": "It halted calls for constitutional reform in France",
                      "rationale": "The revolution energized reformers in France."
                      "text": "It encouraged Britain to expand slavery in the Caribbean",
                      "rationale": "The treaty did not drive such an expansion."
                  ]
                  "questionNumber": 9,
                  "difficulty": "medium",
                  "question": "Which state enacted the first gradual emancipation law during the Revolutionary era?",
                      "text": "Pennsylvania",
                      "rationale": "Correct. Pennsylvania’s 1780 law set a model for gradual emancipation in the North."
                      "text": "South Carolina",
                      "rationale": "Southern states did not adopt gradual emancipation at that time."
                      "text": "Virginia",
                      "rationale": "Virginia eased manumission rules but did not pass gradual emancipation in 1780."
                      "text": "Georgia",
                      "rationale": "Georgia maintained slavery without gradual emancipation legislation."
                  ]
                  "questionNumber": 10,
                  "question": "What financial problem plagued the Confederation Congress in the 1780s?",
                      "text": "War debts remained unpaid because Congress could not raise revenue effectively",
                      "rationale": "Correct. Lacking taxation power, Congress struggled to pay soldiers and foreign creditors."
                      "text": "A surplus of funds led to arguments over how to spend the excess",
                      "rationale": "The government faced chronic shortages, not surpluses."
                      "text": "States refused to mint their own currency",
                      "rationale": "States printed their own paper money, often to excess."
                      "text": "Foreign governments forgave all American loans",
                      "rationale": "Loans had to be repaid, adding to the financial strain."
                  ]
                  "questionNumber": 11,
                  "question": "Which statement best describes the status of Loyalists after the Revolution?",
                      "text": "Many faced social hostility and relocated to British territories",
                      "rationale": "Correct. Loyalists often endured confiscation and harassment, prompting migration."
                      "text": "They were immediately granted full representation in Congress",
                      "rationale": "Loyalists had no automatic political rights after the war."
                      "text": "They were barred from holding any property in the United States",
                      "rationale": "Confiscation occurred in some states, but not all Loyalists lost property permanently."
                      "text": "They regained political control of several state governments",
                      "rationale": "Patriots retained control after independence."
                  ]
                  "questionNumber": 12,
                  "question": "What did the Virginia Statute for Religious Freedom (1786) accomplish?",
                      "text": "It disestablished the Anglican Church and protected religious liberty in Virginia",
                      "rationale": "Correct. Jefferson’s statute ended state support for an established church and guaranteed freedom of conscience."
                      "text": "It required all citizens to attend church weekly",
                      "rationale": "The statute opposed compulsory worship."
                      "text": "It created a national church for the United States",
                      "rationale": "The statute applied only to Virginia and supported religious freedom."
                      "text": "It limited public office to members of the Anglican Church",
                      "rationale": "The law barred religious tests for public office."
                  ]
                "questionNumber": 1,
                "type": "multipleChoice",
                "difficulty": "medium",
                "question": "Which British policy prompted colonial leaders to convene the First Continental Congress in 1774?",
                  {
                    "text": "The passage of the Coercive (Intolerable) Acts",
                    "isCorrect": true,
                    "rationale": "Correct. The harsh Coercive Acts imposed on Massachusetts pushed the colonies to coordinate a joint response."
                  },
                  {
                    "text": "The repeal of the Stamp Act",
                    "isCorrect": false,
                    "rationale": "Repealing the Stamp Act eased tensions rather than triggering the Congress."
                  },
                  {
                    "text": "The signing of the Treaty of Paris in 1763",
                    "isCorrect": false,
                    "rationale": "That treaty ended the French and Indian War a decade earlier."
                  },
                  {
                    "text": "The introduction of the Proclamation Line of 1763",
                    "isCorrect": false,
                    "rationale": "The proclamation angered colonists, but it did not directly lead to the First Continental Congress."
                  }
                ]
                "questionNumber": 2,
                "type": "multipleChoice",
                "difficulty": "medium",
                "question": "What was the primary purpose of the colonial Committees of Correspondence?",
                  {
                    "text": "To coordinate communication and resistance strategies among the colonies",
                    "isCorrect": true,
                    "rationale": "Correct. The committees linked colonial legislatures and activists so they could share news and plan responses."
                  },
                  {
                    "text": "To recruit soldiers for the Continental Army",
                    "isCorrect": false,
                    "rationale": "Recruiting soldiers was handled later by provincial congresses and the Continental Army."
                  },
                  {
                    "text": "To negotiate trade treaties with European powers",
                    "isCorrect": false,
                    "rationale": "Foreign diplomacy was not the main role of the committees."
                  },
                  {
                    "text": "To collect taxes owed to Parliament",
                    "isCorrect": false,
                    "rationale": "The committees were a tool of resistance, not tax collection."
                  }
                ]
                "questionNumber": 3,
                "question": "Why was the Battle of Bunker Hill significant for the patriot cause?",
                    "text": "It proved that colonial militia could challenge professional British troops",
                    "rationale": "Correct. Heavy British casualties demonstrated that patriot forces could stand up to the British army."
                    "text": "It secured a decisive victory that forced Britain to recognize independence",
                    "rationale": "The British technically won the ground, and independence would not be recognized for years."
                    "text": "It ended the British naval blockade of Boston Harbor",
                    "rationale": "The blockade continued even after the battle."
                    "text": "It convinced Spain to join the war on the American side",
                    "rationale": "Spain did not join the war until later and was influenced by other factors."
                ]
                "questionNumber": 4,
                "question": "What did the Olive Branch Petition of 1775 ask King George III to do?",
                    "text": "Restore harmony by addressing colonial grievances without war",
                    "rationale": "Correct. The petition professed loyalty but requested the King to halt hostilities and negotiate."
                    "text": "Recognize the Continental Congress as the new colonial parliament",
                    "rationale": "It did not demand recognition of a new governing body."
                    "text": "Grant immediate independence to the thirteen colonies",
                    "rationale": "The petition sought reconciliation, not independence."
                    "text": "Punish Parliament for imposing new taxes",
                    "rationale": "The petition focused on ending conflict, not punishing Parliament."
                ]
                "questionNumber": 5,
                "difficulty": "medium",
                "question": "Which writer’s pamphlet “Common Sense” persuaded many colonists to support independence?",
                    "text": "Thomas Paine",
                    "rationale": "Correct. Paine’s plain-language arguments for republican government reached a wide audience."
                    "text": "John Dickinson",
                    "rationale": "Dickinson wrote the “Letters from a Farmer in Pennsylvania,” urging moderation."
                    "text": "Mercy Otis Warren",
                    "rationale": "Warren wrote plays and histories supporting the patriot cause but not “Common Sense.”"
                    "text": "Alexander Hamilton",
                    "rationale": "Hamilton authored other pamphlets but not “Common Sense.”"
                ]
                "questionNumber": 6,
                "question": "What central idea is expressed in the Declaration of Independence’s preamble?",
                    "text": "Government derives its power from the consent of the governed",
                    "rationale": "Correct. The preamble lays out natural rights and the principle of popular sovereignty."
                    "text": "Colonies must remain loyal to the British Crown",
                    "rationale": "The Declaration rejects the notion of perpetual loyalty to the Crown."
                    "text": "Religious freedom should be guaranteed in the new nation",
                    "rationale": "Religious liberty is valued, but the preamble focuses on natural rights and consent."
                    "text": "The United States would immediately form a permanent army",
                    "rationale": "The document makes no such promise about military policy."
                ]
                "questionNumber": 7,
                "question": "Which alliance formally recognized the United States and provided vital military support in 1778?",
                    "text": "The Treaty of Alliance with France",
                    "rationale": "Correct. France recognized American independence and pledged military aid."
                    "text": "The Franco-Spanish Pact",
                    "rationale": "Spain aided the patriots later but did not sign this treaty."
                    "text": "The Jay-Gardoqui Treaty",
                    "rationale": "This proposed treaty with Spain was never ratified."
                    "text": "The Treaty of Greenville",
                    "rationale": "That treaty dealt with Native American nations after the Revolutionary War."
                ]
                "questionNumber": 8,
                "question": "How did Marquis de Lafayette contribute to the American Revolution?",
                    "text": "He volunteered as a military officer and helped secure French support",
                    "rationale": "Correct. Lafayette served on Washington’s staff and used his influence to gain French aid."
                    "text": "He negotiated the Treaty of Paris",
                    "rationale": "American diplomats, including John Jay and Benjamin Franklin, negotiated the treaty."
                    "text": "He commanded the British navy in North America",
                    "rationale": "Lafayette fought for the patriot cause, not the British."
                    "text": "He led the capture of Fort Ticonderoga in 1775",
                    "rationale": "That mission was led by Ethan Allen and Benedict Arnold."
                ]
                "questionNumber": 9,
                "difficulty": "medium",
                "question": "Why was Washington’s victory at Trenton on December 26, 1776, so important?",
                    "text": "It revived patriot morale after a series of defeats",
                    "rationale": "Correct. The surprise attack on Hessian troops boosted morale and encouraged reenlistments."
                    "text": "It captured the main British army and ended the war",
                    "rationale": "The British war effort continued for several years."
                    "text": "It convinced the Dutch Republic to enter the war",
                    "rationale": "Dutch support came later, largely through loans."
                    "text": "It forced Britain to abandon New York City",
                    "rationale": "Britain retained New York until the end of the war."
                ]
                "questionNumber": 10,
                "question": "What governmental framework was created by the Articles of Confederation in 1777?",
                    "text": "A loose confederation of sovereign states with a weak central Congress",
                    "rationale": "Correct. The Articles emphasized state power and limited national authority."
                    "text": "A strong executive-led national government modeled on the British system",
                    "rationale": "The Articles lacked a chief executive entirely."
                    "text": "A federal judiciary capable of enforcing laws on the states",
                    "rationale": "The Articles created no national court system."
                    "text": "A parliamentary union that included representatives from British colonies in Canada",
                    "rationale": "Canada was invited to join but never did, and the structure was not parliamentary."
                ]
                "questionNumber": 11,
                "difficulty": "medium",
                "question": "What was one outcome of the 1777 Battle of Saratoga?",
                    "text": "It persuaded France to openly support the American cause",
                    "rationale": "Correct. The victory convinced France the patriots could win and helped secure the alliance."
                    "text": "It forced General Washington to retreat into New Jersey",
                    "rationale": "Washington was not present at Saratoga."
                    "text": "It ended British occupation of Boston Harbor",
                    "rationale": "Boston had already been evacuated in 1776."
                    "text": "It resulted in British control of the Hudson River",
                    "rationale": "The patriots captured Burgoyne’s army and retained control of the region."
                ]
                "questionNumber": 12,
                "difficulty": "medium",
                "question": "Which provision of the Treaty of Paris (1783) benefited the United States?",
                    "text": "Recognition of U.S. independence and territory stretching to the Mississippi River",
                    "rationale": "Correct. Britain acknowledged independence and granted generous western boundaries."
                    "text": "British retention of forts along the Great Lakes indefinitely",
                    "rationale": "Britain agreed to evacuate those forts, though it delayed doing so."
                    "text": "Spanish control of the port of New Orleans",
                    "rationale": "Spain gained Florida, not New Orleans, which it already controlled."
                    "text": "Guarantees of voting rights for all adult male colonists",
                    "rationale": "Voting rights were left to the individual states."
                ]
                "questionNumber": 1,
                "type": "multipleChoice",
                "difficulty": "medium",
                "question": "Why was the 1777 American victory at Saratoga considered a turning point in the war?",
                  {
                    "text": "It secured a formal military alliance with France",
                    "isCorrect": true,
                    "rationale": "Correct. Saratoga convinced France to provide open military and financial support."
                  },
                  {
                    "text": "It forced Britain to abandon all forts in Canada",
                    "isCorrect": false,
                    "rationale": "The battle took place in New York, and Britain retained Canada."
                  },
                  {
                    "text": "It ended Loyalist resistance in the southern colonies",
                    "isCorrect": false,
                    "rationale": "Fighting in the South escalated later in the war."
                  },
                  {
                    "text": "It led directly to the surrender of General Cornwallis",
                    "isCorrect": false,
                    "rationale": "Cornwallis surrendered at Yorktown in 1781."
                  }
                ]
                "questionNumber": 2,
                "type": "multipleChoice",
                "difficulty": "medium",
                "question": "What hardship did Washington’s army endure at Valley Forge during the winter of 1777–1778?",
                  {
                    "text": "Severe shortages of food, clothing, and shelter",
                    "isCorrect": true,
                    "rationale": "Correct. Soldiers suffered greatly from supply shortages until reforms improved logistics."
                  },
                  {
                    "text": "A massive smallpox epidemic that wiped out the army",
                    "isCorrect": false,
                    "rationale": "Inoculation kept smallpox under control."
                  },
                  {
                    "text": "Continuous British attacks on the encampment",
                    "isCorrect": false,
                    "rationale": "The army faced cold and scarcity but not daily British assaults."
                  },
                  {
                    "text": "A naval blockade that trapped the army on the Delaware River",
                    "isCorrect": false,
                    "rationale": "The army was encamped on land away from naval operations."
                  }
                ]
                "questionNumber": 3,
                "difficulty": "medium",
                "question": "How did Baron von Steuben assist the Continental Army?",
                    "text": "He drilled soldiers at Valley Forge and introduced a disciplined training program",
                    "rationale": "Correct. Von Steuben standardized drills and tactics that improved the army’s effectiveness."
                    "text": "He negotiated loans from Dutch bankers",
                    "rationale": "American diplomats handled foreign financing."
                    "text": "He commanded the Continental Navy during the war",
                    "rationale": "Von Steuben was an infantry officer."
                    "text": "He served as the first U.S. ambassador to France",
                    "rationale": "Benjamin Franklin held that role."
                ]
                "questionNumber": 4,
                "question": "Why did the British government adopt a “southern strategy” after 1778?",
                    "text": "It expected strong Loyalist support in the Carolinas and Georgia",
                    "rationale": "Correct. British leaders believed Loyalists in the South would help regain control."
                    "text": "It needed to protect sugar plantations in the Caribbean",
                    "rationale": "The southern strategy focused on the mainland colonies."
                    "text": "It sought to capture the Continental Congress in Philadelphia",
                    "rationale": "Philadelphia had already been evacuated by the British."
                    "text": "It aimed to blockade all New England ports",
                    "rationale": "Naval blockades continued, but the strategy centered on southern campaigns."
                ]
                "questionNumber": 5,
                "difficulty": "medium",
                "question": "Which patriot victory in 1780 blunted British momentum in the southern colonies?",
                    "text": "The Battle of Kings Mountain",
                    "rationale": "Correct. Frontier militia defeated Loyalist forces, weakening British plans."
                    "text": "The Battle of Long Island",
                    "rationale": "Long Island was a British victory early in the war."
                    "text": "The Battle of Quebec",
                    "rationale": "That failed American attack occurred in 1775."
                    "text": "The Battle of Lexington",
                    "rationale": "Lexington and Concord took place in 1775 in Massachusetts."
                ]
                "questionNumber": 6,
                "question": "What role did privateers play during the American Revolution?",
                    "text": "They disrupted British commerce by capturing supply ships",
                    "rationale": "Correct. Privateers raided British shipping and strained the empire’s supply lines."
                    "text": "They transported enslaved people to Spanish Florida",
                    "rationale": "Privateers targeted British vessels, not human trafficking operations."
                    "text": "They served as diplomats to secure foreign alliances",
                    "rationale": "Privateers were privately owned warships, not diplomatic envoys."
                    "text": "They protected British merchants from American raids",
                    "rationale": "Privateers served the patriot cause."
                ]
                "questionNumber": 7,
                "difficulty": "medium",
                "question": "Which diplomatic achievement helped secure French military assistance for the patriots?",
                    "text": "Benjamin Franklin’s negotiation of the Treaty of Alliance",
                    "rationale": "Correct. Franklin’s diplomacy won French recognition and aid."
                    "text": "John Jay’s negotiation of the Jay Treaty",
                    "rationale": "The Jay Treaty was negotiated with Britain in the 1790s."
                    "text": "James Madison’s authorship of the Virginia Plan",
                    "rationale": "The Virginia Plan related to the Constitutional Convention of 1787."
                    "text": "Patrick Henry’s speech opposing the Stamp Act",
                    "rationale": "Henry’s speech predated the alliance efforts."
                ]
                "questionNumber": 8,
                "question": "Which of the following best describes the contributions of women to the patriot war effort?",
                    "text": "They managed farms and businesses, produced supplies, and in some cases aided troops directly",
                    "rationale": "Correct. Women sustained households, made clothing, and sometimes served as nurses or camp followers."
                    "text": "They gained full voting rights in every state",
                    "rationale": "Voting rights for women were not granted during the Revolution."
                    "text": "They were drafted into the Continental Army",
                    "rationale": "Women were not conscripted into combat units."
                    "text": "They were prohibited from participating in boycotts",
                    "rationale": "Women actively supported boycotts and other protests."
                ]
                "questionNumber": 9,
                "question": "What was a direct consequence of the patriot victory at Yorktown in 1781?",
                    "text": "British political leaders began negotiating a peace settlement",
                    "rationale": "Correct. Yorktown convinced Parliament to seek peace and led to the Treaty of Paris."
                    "text": "General Washington resigned his commission immediately",
                    "rationale": "Washington resigned after the Treaty of Paris was signed."
                    "text": "Spain gained control of Canada",
                    "rationale": "Spain recovered Florida, not Canada."
                    "text": "France withdrew all military support",
                    "rationale": "French assistance continued through the end of the war."
                ]
                "questionNumber": 10,
                "difficulty": "medium",
                "question": "How did the Revolution affect enslaved African Americans in the South?",
                    "text": "Some gained freedom by escaping to British lines, though slavery largely persisted",
                    "rationale": "Correct. British proclamations offered freedom, but the institution endured after the war."
                    "text": "The Continental Congress abolished slavery nationwide in 1781",
                    "rationale": "No national emancipation law was passed during the war."
                    "text": "All enslaved people were relocated to the Caribbean",
                    "rationale": "There was no mass relocation policy."
                    "text": "Southern legislatures compensated enslaved laborers for wartime service",
                    "rationale": "Enslaved people were rarely compensated for their contributions."
                ]
                "questionNumber": 11,
                "question": "What did the Treaty of Paris (1783) stipulate regarding Loyalists?",
                    "text": "States were encouraged to restore Loyalist property that had been confiscated",
                    "rationale": "Correct. The treaty recommended restitution, though enforcement was uneven."
                    "text": "All Loyalists were deported to British Canada",
                    "rationale": "Many Loyalists emigrated, but deportation was not mandated."
                    "text": "Loyalists automatically gained seats in the new U.S. Congress",
                    "rationale": "There was no such political guarantee."
                    "text": "Loyalists were granted independent colonies in the West",
                    "rationale": "No western Loyalist colonies were established."
                ]
                "questionNumber": 12,
                "difficulty": "medium",
                "question": "Why were loans from the Dutch Republic significant to the patriot cause?",
                    "text": "They provided much-needed credit to finance the Continental Army",
                    "rationale": "Correct. Dutch loans supplied funds when the Continental Congress lacked revenue."
                    "text": "They guaranteed Dutch military intervention in the war",
                    "rationale": "The Dutch offered financial support, not direct military intervention."
                    "text": "They forced Britain to abandon its naval blockade",
                    "rationale": "The blockade persisted despite foreign loans."
                    "text": "They compelled Spain to join the British side",
                    "rationale": "Spain fought against Britain during the war."
                ]
                "questionNumber": 1,
                "type": "multipleChoice",
                "difficulty": "medium",
                "question": "What was a major weakness of the national government under the Articles of Confederation?",
                  {
                    "text": "It lacked the power to levy taxes directly on citizens",
                    "isCorrect": true,
                    "rationale": "Correct. Without taxation authority, Congress struggled to pay debts and fund national needs."
                  },
                  {
                    "text": "It possessed a strong executive branch that dominated the states",
                    "isCorrect": false,
                    "rationale": "The Articles created no executive branch."
                  },
                  {
                    "text": "It could easily regulate interstate commerce",
                    "isCorrect": false,
                    "rationale": "Regulating trade among states was another weakness."
                  },
                  {
                    "text": "It allowed Congress to draft soldiers without state approval",
                    "isCorrect": false,
                    "rationale": "Congress relied on state militias for troops."
                  }
                ]
                "questionNumber": 2,
                "type": "multipleChoice",
                "difficulty": "medium",
                "question": "How did Shays’ Rebellion influence American political leaders?",
                  {
                    "text": "It convinced many that a stronger national government was necessary",
                    "isCorrect": true,
                    "rationale": "Correct. The uprising highlighted the inability of the Confederation government to maintain order."
                  },
                  {
                    "text": "It led to immediate ratification of the Bill of Rights",
                    "isCorrect": false,
                    "rationale": "The rebellion predated the Constitution and Bill of Rights."
                  },
                  {
                    "text": "It resulted in Massachusetts rejoining the British Empire",
                    "isCorrect": false,
                    "rationale": "The rebellion sought debt relief, not reunion with Britain."
                  },
                  {
                    "text": "It demonstrated the success of the Confederation’s tax policies",
                    "isCorrect": false,
                    "rationale": "The rebellion stemmed from grievances about debt and taxation."
                  }
                ]
                "questionNumber": 3,
                "question": "Which idea from the Declaration of Independence most influenced new state constitutions after the war?",
                    "text": "Government should rest on the consent of the governed",
                    "rationale": "Correct. Many state constitutions expanded voting rights and emphasized popular sovereignty."
                    "text": "Monarchies provide the most stable form of government",
                    "rationale": "The Declaration denounced monarchy."
                    "text": "The British Parliament should remain the legislative authority",
                    "rationale": "States rejected British legislative control."
                    "text": "Religious leaders must hold political office",
                    "rationale": "While some states retained established churches, most separated political power from clergy."
                ]
                "questionNumber": 4,
                "difficulty": "medium",
                "question": "Why was the Northwest Ordinance of 1787 significant?",
                    "text": "It established a process for territories to become states and banned slavery in the Northwest Territory",
                    "rationale": "Correct. The ordinance set orderly statehood procedures and prohibited slavery north of the Ohio River."
                    "text": "It granted France control over the Mississippi River",
                    "rationale": "The ordinance addressed U.S. governance of the Northwest Territory."
                    "text": "It required Native nations to receive full citizenship",
                    "rationale": "The ordinance did not grant citizenship to Native peoples."
                    "text": "It allowed the national government to tax imports",
                    "rationale": "Taxing imports required separate legislation."
                ]
                "questionNumber": 5,
                "question": "How did the Treaty of Paris (1783) affect Native American nations in the Ohio Valley?",
                    "text": "Their lands were ceded to the United States without their participation in negotiations",
                    "rationale": "Correct. Britain surrendered territory claimed by Native nations, leading to future conflicts."
                    "text": "They gained guaranteed representation in the Continental Congress",
                    "rationale": "The treaty offered no political representation for Native nations."
                    "text": "They received independent homelands recognized by Britain",
                    "rationale": "No sovereign Native homelands were created by the treaty."
                    "text": "They formed a permanent military alliance with Spain",
                    "rationale": "Spain was not part of the treaty negotiations over the Ohio Valley."
                ]
                "questionNumber": 6,
                "question": "What did the concept of “republican motherhood” encourage women to do after the Revolution?",
                    "text": "Educate their children to become virtuous, informed citizens",
                    "rationale": "Correct. Republican motherhood emphasized women’s role in shaping the republic through education."
                    "text": "Vote in national elections for the first time",
                    "rationale": "Women generally remained excluded from voting."
                    "text": "Serve as delegates in the Constitutional Convention",
                    "rationale": "No women served as delegates."
                    "text": "Join state militias as commissioned officers",
                    "rationale": "Women were not commissioned in militias."
                ]
                "questionNumber": 7,
                "question": "Which nation regained control of Florida as a result of the Treaty of Paris (1783)?",
                    "text": "Spain",
                    "rationale": "Correct. Spain regained Florida from Britain after assisting the American cause."
                    "text": "France",
                    "rationale": "France gained no territorial adjustments in North America at the treaty."
                    "text": "The Netherlands",
                    "rationale": "The Netherlands focused on trade concessions, not territory."
                    "text": "Portugal",
                    "rationale": "Portugal was not a party to the treaty."
                ]
                "questionNumber": 8,
                "question": "How did the American Revolution influence future independence movements abroad?",
                    "text": "It demonstrated that colonies could successfully break from a European empire",
                    "rationale": "Correct. The American example inspired movements in France, Haiti, and Latin America."
                    "text": "It convinced European monarchies to strengthen colonial control",
                    "rationale": "If anything, it alarmed monarchies about colonial unrest."
                    "text": "It halted calls for constitutional reform in France",
                    "rationale": "The revolution energized reformers in France."
                    "text": "It encouraged Britain to expand slavery in the Caribbean",
                    "rationale": "The treaty did not drive such an expansion."
                ]
                "questionNumber": 9,
                "difficulty": "medium",
                "question": "Which state enacted the first gradual emancipation law during the Revolutionary era?",
                    "text": "Pennsylvania",
                    "rationale": "Correct. Pennsylvania’s 1780 law set a model for gradual emancipation in the North."
                    "text": "South Carolina",
                    "rationale": "Southern states did not adopt gradual emancipation at that time."
                    "text": "Virginia",
                    "rationale": "Virginia eased manumission rules but did not pass gradual emancipation in 1780."
                    "text": "Georgia",
                    "rationale": "Georgia maintained slavery without gradual emancipation legislation."
                ]
                "questionNumber": 10,
                "question": "What financial problem plagued the Confederation Congress in the 1780s?",
                    "text": "War debts remained unpaid because Congress could not raise revenue effectively",
                    "rationale": "Correct. Lacking taxation power, Congress struggled to pay soldiers and foreign creditors."
                    "text": "A surplus of funds led to arguments over how to spend the excess",
                    "rationale": "The government faced chronic shortages, not surpluses."
                    "text": "States refused to mint their own currency",
                    "rationale": "States printed their own paper money, often to excess."
                    "text": "Foreign governments forgave all American loans",
                    "rationale": "Loans had to be repaid, adding to the financial strain."
                ]
                "questionNumber": 11,
                "question": "Which statement best describes the status of Loyalists after the Revolution?",
                    "text": "Many faced social hostility and relocated to British territories",
                    "rationale": "Correct. Loyalists often endured confiscation and harassment, prompting migration."
                    "text": "They were immediately granted full representation in Congress",
                    "rationale": "Loyalists had no automatic political rights after the war."
                    "text": "They were barred from holding any property in the United States",
                    "rationale": "Confiscation occurred in some states, but not all Loyalists lost property permanently."
                    "text": "They regained political control of several state governments",
                    "rationale": "Patriots retained control after independence."
                ]
                "questionNumber": 12,
                "question": "What did the Virginia Statute for Religious Freedom (1786) accomplish?",
                    "text": "It disestablished the Anglican Church and protected religious liberty in Virginia",
                    "rationale": "Correct. Jefferson’s statute ended state support for an established church and guaranteed freedom of conscience."
                    "text": "It required all citizens to attend church weekly",
                    "rationale": "The statute opposed compulsory worship."
                    "text": "It created a national church for the United States",
                    "rationale": "The statute applied only to Virginia and supported religious freedom."
                    "text": "It limited public office to members of the Anglican Church",
                    "rationale": "The law barred religious tests for public office."
                ]
                  ],
                  "question": "Which classification best describes this historian’s book?"
                ],
                "question": "Which classification best describes this historian’s book?"
